{"business_id":"__EmsZiRXiUmljbfpOqZig","date":"2011-01-04","review_id":"yvT6dqTq8M3MN28tRIpP8Q","stars":4,"text":"Most people writing reviews probably ate at the other AA locations. These locations not being in the center of a party college town. Nightlife atmosphere is very good here. AA also has great bands on friday and saturday nights. Also A great comedy club on wed at 9. Im not going to take my girlfriend here for fine dinning but if a good night on the town is what your looking for you've found it.","type":"review","user_id":"4ad2MmO7VDILLAKRSD7wGw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"g-mJhTtvg_uyv5zRFCIOkQ","date":"2008-11-26","review_id":"No3XhV74wnMg3yyZHF2mkg","stars":3,"text":"Best kept secret in Blacksburg.\n\nI know you've driven up Main Street and passed by the ordinary-looking building with the \"dog sign\" in the front. I did for three years before we ventured in -- and once we did, we kept going back.\n\nThis place is as simple as you can get. Generally we would go for ANY of the specials they have to offer (a different one for each day of the week), but we got a little crazy with the menu sometimes, as well.\n\nGo in, get yourself a large sweet tea or a PBR and enjoy some comfort food.\n\nYour friends may look at you strange for stopping in here, but that's only because they're ignorant.\n\nIn this case, ignorance is not bliss. But eating a special at Abby's just might be...","type":"review","user_id":"fJBmDZ4iDZW6f54RWnWFFA","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"nCWZR9NRc2grAwP1jq33PA","date":"2009-04-04","review_id":"f3-ByuapR4pYmz-Fbea6Fg","stars":5,"text":"Awesome. awesome. AWESOME. Pint night Mon-Wed 7-9pm $1 domestics, $2 imports on draft. Not to mention a fabulous menu. I personally love the tacos and the spicy bean dip. The rivermill tots are the perfect snack. This place feels like a community. If you start to come around enough, everybody knows your name. They have some great music here, not your top 40 crap or jukebox oldies hits, but some actually good indie music. Darts and pool, some video gun game (that never gets played) and great atmosphere. This is the only place I'll miss when I leave BBurg.","type":"review","user_id":"qfsK7_jZ68XAg9Jpt5KQ8w","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"KsrMCDF689P4bTBrrbTLjA","date":"2009-03-06","review_id":"B1I6jCWUzejJRxeRynegaA","stars":3,"text":"Admittedly I am not a big beer fan. I have a few select beers that I drink, but outside of those, I just haven't acquired a taste for them. I tried their Pale Ale and it wasn't for me. The next time I'm there, I will try their sampler and see if I can find one that I like.\n\nAs for the food, I had the crab cakes and an appetizer that I couldn't find on the menu, but was recommended by one of the owners. It was like a pepper-crusted raw Mahi Mahi. It wasn't too bad actually and I do not usually eat raw fish.\n\nOverall, I think Bull & Bones is a bit overpriced for most folks, but I have to say that the crab cakes were some of the best I've had this far inland. I think the restaurant is still working out the kinks and will improve over time. I am much more likely to hang out on the bar side where there are plenty of pool tables and a plethora of TVs for watching games.\n\nI would really like to see this establishment survive in Blacksburg. It's no more expensive than Outback and it's locally owned and operated. Give it a shot!","type":"review","user_id":"3xuYR9y1d44tMluc8qluEQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"a80CAB0Wa7-NzJtPRAt0ug","date":"2010-06-01","review_id":"4IQnQv5yFbjAp3EnL28aag","stars":3,"text":"The food here is great- I am a huge fan of the lentils.  I would give this place 5 stars, but I think the portions are insanely small for the price- either the price needs to go down, or the portion needs to go up.  I do appreciate the flavors and the diversity they add to the Bburg dining scene.\nAlso- sometime they are not open during posted hours without an explanation, so I just walk somewhere else...","type":"review","user_id":"al3Ii-nMy0KuuK42wdHfyg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Y_HIPFeBEb1V8_eOrZt6wQ","date":"2009-05-06","review_id":"_UzlTFGzRsNBUD7nXgl-YQ","stars":4,"text":"I love Eats. And I love their new bigger location. This is no Whole Foods by any means, but who would expect it to be in a small town. That being said, it far outweighs the one isle at Kroger or all of Annie Kays. I especially love their selection of Yogi tea, the organic local produce, the yogurt and cheese options, as well as the dispensing of honey from large keg-like containers. We have to save the honey bees, after all. Also, they sell plants so you can grow your own herbs or greens (no, not THAT kind) and the staff is very friendly; they will order you something if they don't have it and thank you for bringing a new product to their attention. But bring your own reusable bag - otherwise you'll be scorned by patrons and staff alike for not being green.","type":"review","user_id":"qfsK7_jZ68XAg9Jpt5KQ8w","votes":{"cool":2,"funny":1,"useful":2}},
{"business_id":"I_CFI8tpJHkGthEet3v3WA","date":"2011-04-02","review_id":"bQnWs31jYgmqwDqEa1UPAA","stars":5,"text":"This is probably my favorite bar in town. The atmosphere is great; it's not another sports bar! They offer a great beer selection and they give most of them to you in a pretty unique pint glass.\n\nThe food that I've tried was very good. The fish and chips are the best that I've had anywhere and the club sandwich is enormous. I haven't tried much else so I can't pass judgement there.\n\nThere are several dart boards to play on but watch out when the league stops in. They have a way of taking over the place.  But other than that, everybody I've met there has been very nice. They're mostly locals so you won't see many students (thank goodness...)\n\nAll told, this is a great place to have dinner, knock back a few, and enjoy the company of your friends.","type":"review","user_id":"NSBFQQcBFajCrby9DzjraQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"thlQuACT7g1GQLA-45pfkw","date":"2008-04-15","review_id":"Deo1Ss3lAT07vX6L3e8bTA","stars":4,"text":"This is the best Chinese food in Blacksburg, and heaven knows that college students need good Chinese food! It's always quick, and the food is consistent.","type":"review","user_id":"1iuUH43JM8Nq4_993ka7ag","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2007-01-20","review_id":"K_KacmjN86aH9IYVHQAGPw","stars":3,"text":"A vegetarian's dream! There is a variety of unique entrees and appetizers to choose from and they also offer seafood as well. The brunch here is legendary and all their food is made with the freshest ingredients so that  you can taste the quality in every bite. They also cook using olive oil so you can expect your meal to be healthy as well. Good choice if you're up for trying something new.","type":"review","user_id":"dvAXqNtZHuxLgTIyTC4omQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"HqPPWAttTuBpDoKnAQt4Vw","date":"2011-03-26","review_id":"lICpn7R401jdEt6PJ0UUOg","stars":2,"text":"I have stayed here about half a dozen times as it is the most convenient hotel to VT. I have had pretty good experiences but for the money you expect simple things like flat screen tvs especially since the hotel is relatively new. The rooms are just fine no real frills but typically the people at the front desk are very nice which help offset the bland interiors. \nWe were leaving Friday morning and were saying good bye to one of our freinds Thursday night and the night person decided to come out and yell at us for being too loud. I think he handled the situation very poorly and i was surprised by his brazen attitude when all we were doing was saying goodbye to a freind. His lack of tact has made me think about not staying here again there are nicer hotels in the area for sure.","type":"review","user_id":"WctC4-LK2CXS_NfOrC04uA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nXXfB3-tIIZczK4byP8JWQ","date":"2009-08-08","review_id":"pqDKCJd3geAkZfhQpHUj0w","stars":2,"text":"A pretty good place for burgers, their style is unique but Five Guys does have a better overall taste.\n\nMOOD:  I didn't realize it was a sit-down restaurant because it looks like a place where you can just place your order and pick it up and sit yourself down and eat. It looks like a really old fast-food joint.\n\nSERVICE: My service was good, but I would have came back more often if there were no waiters and more like Five Guys. The bottom line is that it is too expensive for what they give you. \n\nFOOD: The burger's are upside down for the juice to soak in the bun. It was a pretty damn tasty burger, but the bacon cheeseburger from Five Guys is the best in this category as well as being cheaper. Unfortunately for Mike's, there is a Five Guys chain in Blacksburg too. Their fries were pretty weak too, tasted very plain.","type":"review","user_id":"ZPpuU4Kz1SrFTrKDQ9S3AQ","votes":{"cool":1,"funny":1,"useful":1}},
{"business_id":"CQDgwHALlXTgvfOd0HoH8g","date":"2008-09-25","review_id":"IvQHW5DyIe6fec_ET2oCkA","stars":5,"text":"The Lyric is awesome!  Free popcorn on Mondays!  Cheap tickets and cheap popcorn all other times.  They usually do a decent job of rotating both popular and indie movies in their showing schedule.  And they have live bands on the weekends.  I've seen quite a few movies here that I would not bother with at the \"regular\" theater.  But seeing them at The Lyric makes it fun!  Plus they have a balcony!  How fun is that?  This place fits in perfectly with the downtown Bburg feel.  You can have dinner or drinks before or after the show.   Definitely check it out!","type":"review","user_id":"BqUm1rHPSxlCWr-3HhNQyw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nCWZR9NRc2grAwP1jq33PA","date":"2011-01-09","review_id":"CNWaOXcElzYe3kX5MhOCNg","stars":4,"text":"3.5 really.\n\nThe Rivermill is one of my favorite bars in Blacksburg. Attracts a slightly more \"alternative\" crowd than many other bars around and has one of the best beer selections. As a (mostly) vegetarian, I was surprised by the number of meatless food options. The veggie burgers and tacos are awesome. One can never go wrong with a bucket of their crispy tots.\n\nI have to dock some points for the state of the men's room, which is definitely the worst in Blacksburg. I'd estimate the last time it was cleaned was during Reagan's second term.","type":"review","user_id":"T3iaU9Gt_lcNKX2lA-o2tw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"lycHbq5ffGXtmEUE10vYpw","date":"2011-06-18","review_id":"M5x39FjdGyjuDrEl00STmw","stars":5,"text":"Excellent store and group of people working it. Very knowledgeable staff, definitely know what they are talking about. They have a ton of gear ranging from kayaking, skiing, hiking, canoeing, camping, and on and on.","type":"review","user_id":"QCl8mVVK8Eem47xc7jloag","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"n24Vn9DpMwDW5e6MPjOnrA","date":"2007-09-20","review_id":"QS_lx1iJHNBd2g6hA5Pbgw","stars":4,"text":"Awesome sandwiches in an out-of-the-way little house.  Is there anywhere else to buy kegs??","type":"review","user_id":"4hj-rUKdY20Un_h37RptjQ","votes":{"cool":0,"funny":0,"useful":3}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2010-07-24","review_id":"UuC21K-vLnJG4zJ4_tnZ4w","stars":3,"text":"My husband and I stopped at Gillie's for breakfast while on a road trip.\n\n Before I come off as a whiny vegan, let me first say that I'm always grateful for restaurants that offer vegan options. We were really happy to see several breakfast options marked as \"can be made animal free\".   I was immediately bummed to find out there wasn't a vegan grits option or pancake option (so damn easy to make vegan), but we pressed on. Husband ordered the tofu scramble with home fries and soy milk, and I got a veganized version of some other thing that ended up looking exactly like my husband's dish, but with just cubed tofu.   What bummed me out was the only vegan bread they offered was dry, toasted baguette slices. It seems like if you're going to specifically tout yourself as having vegan options, at least keep some vegan margarine on hand so us vegans don't have to nibble on dry white bread. The tofu \"scramble\" (actually cubed, not scrambled, but I know this can be a regional thing) was pretty good all slathered in BBQ sauce. The home fries were absolutely perfect. Super greasy and really awesome.  We were brought room temperature soy milk along with ice filled glasses. The server told us that they didn't have any soymilk in stock, so they stepped out to get us some. A nice gesture, but I wonder why no soymilk? Not enough vegans in this college town?\n\nThe service was friendly, and our bellies were filled and ready for our 10 hour drive back home. If I lived locally, I probably wouldn't be a regular at Gillie's, but it was a nice place to get a vegan bite while traveling.","type":"review","user_id":"1GQ1ah6xGho7CcKzCzntXw","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"GJIZlVlPncUQk9x1EjgnFA","date":"2011-02-12","review_id":"w4pcrK0YlN4f2RJEGl6bvA","stars":4,"text":"I like going here often. Its neat and clean, and the food is good just like most of their other locations. Just one thing, I usually order mediterranean veggie, and sometimes in the evening after 6 or 6:30 pm, they are out of tomato basil bread and french baguette. So, I recommend going there during day time or early in the evening.","type":"review","user_id":"zsLW1Ya5eAkQ12L8UhTevQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"KsrMCDF689P4bTBrrbTLjA","date":"2010-09-05","review_id":"OVqUSmUbFL3ZayxPPwuVFA","stars":2,"text":"This was decent barbeque but with some misses-so nothing to take a detour with your car.  The wings I had tasted of refrigerator air and reheated.  The ribs were good but were not sliced (I like them partially cut between the ribs) and since the top was a bit over cooked it made them very hard to eat.  The beans were good, the mac and cheese was terrible. \n\nI did have a gin and tonic but the tonic tasted flat (probably poor carbonation coming from a tap-why people can't use decent tonic I will never know).  The waiter was excellent.","type":"review","user_id":"N9tgUEYnMvdZSDDAZ46sJg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"t7B9UjbFqdD0BbbYggtqsA","date":"2010-06-13","review_id":"vrbDPP24P3RVlwiCuWoigg","stars":4,"text":"I wanted to move in!\nHadn't stayed in a Courtyard for awhile but was thoroughly impressed -  fresh cookies at check-in, a shower and water pressure that will make you melt, uber-comfy bed,pillows and linens and a treadmill with a TV screen. Large clean rooms and huge lobby with areas for checking email, chatting and breakfast.\nThe only downfall was the $7.95 continental breakfast...but hey you could always go with the bonus plan and get eggs prepared \"your way\".","type":"review","user_id":"h3Iydnd3iXDD_cAln6HhlQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"voXoIsapBR30q_7PgxVeAA","date":"2008-08-30","review_id":"T94nz-ssutCxggbsbUHjMA","stars":4,"text":"I went to Backstreets with my 3-year-old son last night before the Virginia Tech women's volleyball game. I hadn't eaten at Backstreets since I was a student at Tech more than 11 years ago, so I wasn't sure what to expect. I was very pleasantly surprised! The hostess was very nice and engaged my son in conversation. We were seated immediately, which surprised me on a Friday night at 6:15. Our server was a college-aged guy and he did a good job. The best part of the night was the New York Style pizza we ordered. It was outstanding! By far the best pizza in Blacksburg in my opinion. When we left, the hostess asked my son if he'd come back and see her ... most definitely, but mostly for the food! I can't wait to try their calzones and salads as Patrick M. suggests in his review.","type":"review","user_id":"3xuYR9y1d44tMluc8qluEQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"I5dFvzPt57bb9T7z0Mp-jw","date":"2010-06-01","review_id":"5ZdiHizlA_uOsBnNmbRwKw","stars":4,"text":"Great Bakery and Cafe- a wonderful place for a quick and light lunch.  Good selection of quiche, salads, sandwiches, etc.  Their loaves of bread and pastries are delicious and their cake is the best around.  I highly recommend OBD for birthday, graduation, shower, etc. cake- they are yummy and decorate very well!  My faves are their red velvet, pound cake and carrot.  Can't go wrong here.","type":"review","user_id":"al3Ii-nMy0KuuK42wdHfyg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nCWZR9NRc2grAwP1jq33PA","date":"2010-12-12","review_id":"GPe7wH1A5xWjJtu5zWg0SA","stars":3,"text":"Maybe I'm getting too old to be rubbing elbows with everyone and their brother in Blacksburg. There are pool tables which is a plus but aside from that its the typical main street scene.","type":"review","user_id":"twISWUMTq7r80UP_s11z3w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3ulgAMrHx6FFvDUMrLInDw","date":"2011-08-18","review_id":"p43S3oEbdSGpzgV8J2SdGg","stars":3,"text":"I came here during a snowstorm last year mostly because it was one of the few places open late as the snowplows cleared the roads. As other reviewers have stated its your typical Chinese buffet with your standard cafeteria quality food. The upside is that it's dirt cheap to eat here, the food doesn't taste awful and I've never gotten sick from it so they must be cooking it correctly. For about the price of a combo at your selection of fast food restaurant you get an all you can eat Chinese buffet, what collection student doesn't love that?","type":"review","user_id":"VaSNVqkMOqI5Yb5UZIH64g","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"__EmsZiRXiUmljbfpOqZig","date":"2010-11-30","review_id":"m_-z8kxyIhLbvDC7n5rT8Q","stars":2,"text":"I took my friend here with a group of people for his birthday since he really wanted raw oysters and liked the raw oysters at Awful Arthur's a lot the last time he visited. His cute little sister mentioned she was in the mood for shrimp. The waitress came over and announced they were out of oysters, shrimp, scallops, clams, and a few other items. My friend, who was visiting from out of town, and his sister, looked really disappointed. It seemed as if they were out of all of their seafood! The waitress also did not know what they had on draft, and seemed a bit flustered. The music kept cutting out completely then resuming, and the place was empty, making for a kind of awkward atmosphere. The bar on the other side of the restaurant looked packed, and my friends and I had a fun time last time we went to their bar for drinks. It's a fun place to drink at night, but, it's really a pretty bad place to grab food.","type":"review","user_id":"FQOjDaeGo3auekob8MCSqw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"KsrMCDF689P4bTBrrbTLjA","date":"2009-10-12","review_id":"7KxzYs-RDmJEvvVAmUt31Q","stars":2,"text":"I have been here 3 times, two for dinner and once for lunch.  Each time, I hope for a better experience and have yet to receive it.  I won't go over the other times I have been here since they are not as fresh in my brain as the previous weekends visit.\n\nI debated about going back to B&B and thought maybe we should go to Outback, Texas Roadhouse, or Texas Steakhouse however we did end up at B&B.  I \"called ahead\"  for a table which is pointless as it is not a reservation and only serves to put your name on the waiting list once you arrive.  Regardless, since there were two of us the wait as initially told to be 40 minutes was actually 15 minutes.  This allowed me to grab a Maroon Effect Ale from the bar.  One side note here is that the bartenders suck.  As I patiently waited at the bar for 10 minutes with money in hand in making eye contact with 2 of the 3 bartenders, it fell on blind eyes.  Only after 5 people that showed up after me were served, my order was taken.\n\nWe were seated (in front of the kitchen) and given menus.  The waiter (probably extremely busy) did not come over to the table for about 10 minutes or so.  This really wasn't an issue, more like a nuisance.  We ended up ordering another round of drinks (Maroon Effect and Sun Lit Wit) which took about 10 more minutes and followed that up with our dinner orders.  I ordered the rib eye (medium) with roasted vegetables, a crab cake, and a Caesar salad.  My dining partner ordered the sirloin (medium) with a baked potato.\n\nMy Caesar salad came out about a minute after I ordered and it probably took about 20 - 25 minutes thereafter to get our entrees.  The salad was nothing to write home about, consisting of lettuce, croutons, a small amount of grated cheese and a ho-hum Caesar dressing.  When our meal arrived, it was nice and hot.  I cut into my steak and it was cooked exactly right.  The taste was nothing notable, just meat.  My friends sirloin however was medium well to well done.  They commented on it being dry.  While it did not stop them from eating (as they were hungry), they were not happy.  My roasted vegetables were average at best.  They tasted like the seasoned frozen vegetables you heat up in the microwave.  The crab cake was good but tartar sauce tasted more like mayonnaise.\n\nThe biggest complaint I have about this place is the quantity versus the price versus the quality.  I would have no problem paying $57 (2 people) for a good meal with less food or $57 for an ok meal with more food but I don't like paying $57 for an ok meal with less food.  I knew the rib eye was 12 oz going in however I did not know the crab cake was going to be slightly larger than a half dollar coin (about as thick too) or the roasted vegetables were going to be about 3 forks worth.  The Caesar salad wasn't exactly big either but whatever.\n\nThe strongest points of this establishment are its beers.  The taste and style are great, with the price being justifiable.  It isn't outrageous but it's well above Blacksburg's pricing scheme.  The weakest points are its food.  While B&B delivers on one end, it fails on the other.\n\n2.5 stars, try it once for food, and multiple times for beers\n\nnote: the cost breakdown was about $40 for food, $9 for drinks, and $8 for tip.","type":"review","user_id":"--ugitI7hU4y2v81tSS7pg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"HqPPWAttTuBpDoKnAQt4Vw","date":"2009-11-17","review_id":"ne7Pp-P_f8m6BAH4yoegeg","stars":3,"text":"So after two separate visits I would summarize my stays as alright.  The first time there the hotel seemed more well kept.  Maybe it was because of the aging process that occurs with most hotels.  The staff has always been fabulous.  The one time I had a \"strange\" request for a spoon, so they had to run to the bar to get it...  The lobby area was small, but pretty.  Needless to say on a cold morning, the fireplace really did keep you warm!\n\nMy grip is that they did not have a microwave or a fridge, but probably to discourage the rodents and pests in the guest room...\n\nThe rooms were also very nice.  Although one time the room was next to the elevator, the noise was also somehow kept to a minimum.  The only thing I didn't like (but people traveling with families would) is that both times my room had a \"connecting door\" (I'm sure there's a real name for that somewhere) that links your room to the adjacent room, is locked on both sides, but is still somehow disconcerting.\n\nThe hotel also has a little gift shop/convenience store, so if you need something real quick it's right there for you.","type":"review","user_id":"uLthrQwJFUYvfNzsB45iHA","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"NLfQp6SUK9vwv3WNURbjIg","date":"2007-09-20","review_id":"7ImORoHbQ2frU4_9FWN2kA","stars":1,"text":"Yeah, Gumby's is cheap but god is it awful.  I can't recall ever eating it and not feeling sick afterwards.  Basically tastes like stale dough and that's it.  The cheese has to be candle wax, what little bit of cheese is actually on there.  I think the only reason people like it is because they sell \"pokey sticks\" and pokey rhymes with hokie.  Also, maybe girls think the little Gumby guy is cute.","type":"review","user_id":"4hj-rUKdY20Un_h37RptjQ","votes":{"cool":0,"funny":0,"useful":2}},
{"business_id":"tJwomYMNjpd4A31rDMXMCw","date":"2008-04-15","review_id":"Yy4jUeQeULL_sz1hicOgIA","stars":3,"text":"I far preferred the old location, but this is still a great place to meet up with old friends.  Pitchers of Woodchuck and sweet potato fries are the reasons to go.\n\nOh, and wing buffet. Need I say more?","type":"review","user_id":"1iuUH43JM8Nq4_993ka7ag","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"kjrq7LOaMawzLTVlLMpApQ","date":"2011-02-23","review_id":"fwtVH1k3Dqh1gJqzUrRDqw","stars":5,"text":"This was our first time eating at this restaurant in christiansburg, we usually eat at the one in Roanoke but we weren't disappointed! In fact our experience here just made me love this chain even more!\n\nWe ate there last night. 3 adults (one of our kids is 15), and 4 children (ages 8-10). The total bill for 7 of us came to $ 40 and some change. \n\nThey not only happily GIVE a military discount but if you are in uniform, your meal is free. We ate here to celebrate when my husband came home from Iraq, literally as soon as he got off the plane so he was still in uniform and they gave him his meal for free. \n\nThis restaurant chain had never disappointed with it's cleanliness, charming atmosphere, and impeccable service or price.\n\nThe greatest thing about Red Robin for bigger families is their bottomless meals! Seriously as a mother of 5, this concept is un-heard of!!! They have a childrens menu where the kids can color it and circle what they want to eat (takes the pain out of offering for 4 smaller kids), bring out cups with lids, AND (one of the kids just noticed last night) that they have a game of I spy on the cups to keep the kids busy!!! Kudos to the person who thought of that!! Instead of listening to who was touching who and who was being mean we heard, \"cool!!!\" While the game occupied them and opened them up to looking around the restaurant at all the neat stuff they have on the walls. Before we knew it.....DING....food was served.\n\nWhen you first walk in they have a tv in the floor! My kids are obsessed with standing on it and before we know it, we are being seated without having to hear the typical \"we're hungry\" that parents usually hear while standing in line to be seated. And as my son informed me, they have a tv in the boys bathroom...so be prepared for your kid to keep having to go to the bathroom, lol.\n\nTwo of my kids ordered the cheese pizza, one ordered the cheeseburger, and the other ordered the mac and cheese. All but one got the steak fries and the other got apple slices. ALL BOTTOMLESS! If you haven't experienced this yet, everything that the kids ordered....they could have as much as they wanted for no extra charge! My son ended up getting a second cheeseburger and the other a second pizza. You absolutely can not beat that especially for larger families when your kids are going through a growth spurt and one portion isn't quite filling.\n\nThey also have bottomless drinks, I just dont remember which ones but the different flavored Iced Teas were on there and they are good!!! \n\nThey also serve mixed drinks which is very nice for Mom and Dad!\n\nWhile we were sitting there eating, the Manager came around and stopped at every table to personally check on the customers needs. He stopped at our table, joked around with the kids and continuously asked if we needed anything and how our service was. That was very nice and made us feel like our every need was met. I watched the manager walk around to every table to check on his customers, it kind of made us feel like we were part of the Red Robin family! \n\nExcellent parking, smoke-free environment, super friendly staff, great food, great prices, fun atmosphere, comfortable dining experience, and not just kid-friendly....KID WELCOMING without the adults feeling like it's a kids restaurant. I can't say enough good things about Red Robin, and have not one bad thing to say and we've had the RR EXPERIENCE about 4 times in two different locations. \n\nAnd they also do sing Happy Birthday and I think you get a complimentary desert and they have a RR online club for deals.","type":"review","user_id":"3KU1QjFCtLHMxHQUOaRz4w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X381_JV6xOq3VSsep13GvA","date":"2009-08-01","review_id":"goSqctJvvK8av1J0-E_AlQ","stars":1,"text":"Uninspired cafeteria food served in an interesting setting due to all kinds of photos and kitsch on the walls. It's hard to describe the food because it is so boring. The menu covers basic American food and tries to present some Mexicanish options, too. Even though I had a $5 gift certificate for the place, I never used it after having been there once before. I am not a college student, and my taste buds were raised in Northern California, so interpret this review accordingly.","type":"review","user_id":"76aU-WjTIfgZsp1h-VBn3Q","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"j3lZQs0YKMDAwKSbDRNY7Q","date":"2011-02-27","review_id":"IrYX-KTLfQ7AjuFGQjrv0w","stars":3,"text":"Not the bubble tea that I'm used to from Nova, Richmond or Cali, but not bad either. Very over priced, but they've got me hooked only because I like the thai tea with the yummy chewy boba. I like how they make their boba, its not too hard or soft. that's what she said... but nah, they don't specialize in slushies, its more of a milk tea place. From what I'm aware of they mostly use powders and mix everything with shakers. I've heard their crepes are orgasmic also, but I have yet to try one, hopefully before I graduate. i'll keep you posted if I do try one (: Free Wi-Fi is definitely a plus too.\n\nedit:\nthis is what the manager told me via message:\n\nSome people think that we just use powders to make our drinks as other shops do. We do add creamer to our milk-tea based drinks, since it's one of the essential ingredient of Taiwanese bubble tea. But we are NOT like most of the tea shops that use 3-in-1 milk-tea powder, slushie powders (that makes their slushie tasted good but it is indeed unhealthy) or flavored tea powder to make their drinks. We do hourly brew fresh black and green tea as base and use syrup that contains concentrated juices for flavoring most of our drinks, except for flavors such as Taro and Matcha that come naturally in powder form. No mention that we even insist to use purified water to make our drinks healthy or just for being tasted good.","type":"review","user_id":"XiMjphpRsjC4jK8_4jYQtA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"zkmYfnGF3WilPsGiIkxYYw","date":"2007-09-20","review_id":"q_Hy4KJTPQ7SlFdrrJIl_g","stars":4,"text":"SECOND best pizza in town, next to Anthony's, but by far a better location and better atmosphere.  I can't tell you how many pizzas I've eaten here during flip Tuesdays.  Great place to go with a bunch of friends.","type":"review","user_id":"4hj-rUKdY20Un_h37RptjQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2008-04-15","review_id":"LY2BCbizjAPwRxyWRpzCig","stars":3,"text":"Average Mexican food, but not too expensive, and the jumbo margaritas are excellent. Go on your birthday (or just say it's your birthday) and you'll get free flan for dessert.","type":"review","user_id":"1iuUH43JM8Nq4_993ka7ag","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"hIl5mwJaGY1P95pf8cKciA","date":"2011-06-16","review_id":"pSCjO9K70NjKXeyOX5de8w","stars":5,"text":"These are the best doughnuts in the world!  I'm not usually a big fan of cake doughnuts but these are just sooo good.  They have plenty of varieties.  I didn't think I'd like a blueberry doughnut, but man.  It is good.  My brother likes the chocolate chocolate.  so good.  Their yeast doughnuts are good too.  Whenever I head back to the burg for a game, I always try to get here to get a dozen doughnuts.  When my brother was in school, he would stop by on his way home (middle of the afternoon) and they would throw in free doughnuts with his dozen for him to get rid of them.  He loved that!  \nWhen I think of my time in blacksburg and food, i think Carol Lee Donuts and Mike's Burgers.  My favorites.","type":"review","user_id":"Js30TjWhoilKjFlUplt3zQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"NLfQp6SUK9vwv3WNURbjIg","date":"2011-07-11","review_id":"nF5GmyWFyfcj4CR33D6--Q","stars":4,"text":"Good pizza and pokey stix for fair prices. Try the pokey stix with ranch or marinara after a night downtown!","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nXXfB3-tIIZczK4byP8JWQ","date":"2009-10-27","review_id":"eFMgO7bD5a997XhWaN1I9g","stars":4,"text":"The Mike's experience is great..  Huge Burgers and Calzones are big enough to two people to split.   Great food service and experience.  \n\nYou can get Five Guys anywhere but only one Mike's Grill.   Not to be missed.","type":"review","user_id":"hkvYJ1wZRXesOaraqxT1xg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Te72-fjbquQFCfPBgJ4ldQ","date":"2011-08-20","review_id":"nNPgVm8gb6VmBU6u5E8AmQ","stars":2,"text":"Offers southern style dishes with extensive drink menu. Rooftop provides better sitting arrangement. Very slow food service on simple dishes. Blackened cat fish was burnt and gumbo soup was salty.","type":"review","user_id":"8M6xXfYMADwKR6hFxC_qTQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X381_JV6xOq3VSsep13GvA","date":"2008-06-14","review_id":"B5GHWCOK1NFxlM9ZCpaS0Q","stars":3,"text":"Ah, nostalgia.  Macado's was one of our weekly stops in the good old college days, way back in the early nineties.  Gather 'round, youngsters, and let ol' Dad tell you about Sandwiches.\n\nSee, back when we were young and full of hope and dreams, we lived in a magical town called Blacksburg.  Near our happy little home was a restaurant called Macado's.  They had sandwiches.  Not your run of the mill peanut butter and jelly, or sad slabs of ham on soggy bread, but sandwiches so big and stuffed they made Darren Robinson look skinny.  There was one called the Hindenburg that you could eat off of for a week!\n\nDrinks?  Oh yes, they had drinks.  Beers in schooners so big you could swim in them.  And they only cost a dollar!  Try to find that today, you with your TivoPods and mountain unicycles.  Bah.\n\nAnyway, I remember this place fondly, and it sounds like it's still pretty much the same after 15-20 years.  Dang, it's been a long time...","type":"review","user_id":"sg41GNBvfwgf1Q9aBv123A","votes":{"cool":1,"funny":2,"useful":1}},
{"business_id":"Te72-fjbquQFCfPBgJ4ldQ","date":"2010-05-14","review_id":"_w1VdYosSDYsnv-v-0Cx-g","stars":4,"text":"Great deck awesome squash soup and oysters. Staff was attentive to detail","type":"review","user_id":"GnCm7qDmxkRO-kGAu2956Q","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"ZmABtfx5BCtz1BWTGt0sWA","date":"2011-08-18","review_id":"IeRl9dGx_XdNviDTt1mE4g","stars":1,"text":"Went in to do a little research about what kind of bike I should purchase with the goal of walking out with a bike to ride to class. Instead I walked out empty handed after being belittled by a rude and condescending bicycle shop owner. Upon asking for help I was told \"you're a college student so you must have an idea of what you want or the ability to research it.\" after attempting to explain that the reason I came to a bicycle shop was for research he said \"Have you ever even ridden a bicycle before?\" I refuse to support a business that is run by one of the rudest people I've ever encountered in a retail environment and quickly took my business to Bike Barn exactly one block away and within sight.","type":"review","user_id":"VaSNVqkMOqI5Yb5UZIH64g","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rXGioez8wVRBwJXJoBj9LQ","date":"2007-07-16","review_id":"FNEM_odM8_WLOoEtsafe5w","stars":5,"text":"I actually give this place six stars, but that's not an option, so five will have to do.\n\n\nI once asked my friend what he thought about Kobe. His answer is documented below:\n\n\n\"This place is unbelievable, and relatively inexpensive for a good amount of food. I'm not sure what the sauce is made of, but I think the main ingredient is perfection. If the chicken ain't swimmin, you ain't winnin.\"\n\nKobe is so amazing. I'm currently in Roanoke and am thinking about driving down to Bburg just to get some. The people are friendly, the food is delicious and for a Japanese restaurant it is very well priced. The amount of food you get is very filling as well and its location to campus makes stopping there mid-afternoon after a night out well worth the trip. They serve sushi, all sorts of teriyaki dishes, and so much more. \n\nGO THERE.","type":"review","user_id":"8k4y8CvcC5oL-rKFMxHb0g","votes":{"cool":1,"funny":1,"useful":1}},
{"business_id":"4kR9-F-iooU_l_n2mgSGDw","date":"2010-06-23","review_id":"lL-8SWfbJB-onLT-Y9ihxg","stars":5,"text":"Best beer selection in town.  Best wine selection in town.  They have some bargains for wines but the beers are a little more pricey than normal.  But like they guy that complained about Five Guys burgers having grease, what do you expect if you want the best beer?\n\nThe staff is Ÿber knowledgeable and friendly.  They have free wine and beer tastings every week too.  And bread from a great bakery in Roanoke delivered fresh every Friday.  And good cheese and a few craft soft drinks.  A beer of the month club is available as well as a wine of the month club.  Both offer discounts on their regular priced items for giving them some regular monthly income.\n\nSure, you can go next door to Kroger and get a few of the same beers for cheaper but that's not what Eat Local is about.  Support your local food places.  You get better service too.\n\nSo, yeah, their prices are up - for the beer - over mega chains but that's a bit like saying you can get cheaper burgers at McDonalds.  A, you don't want to support McD's when you can support Mike's Grill.  B, you want to try more and different burgers you can't get there.  Ermm, uh, beer.  Oh, dear.  I've gone and confused myself.\n\nAnyway, great beer and wine and other stuff.  Good service, knowledgeable staff and FREE BEER AND WINE TASTINGS.","type":"review","user_id":"VVzG_2ZQg63rOBfBkS6VLA","votes":{"cool":0,"funny":0,"useful":2}},
{"business_id":"nuU8Wg64xGbsyK_DaOma-w","date":"2009-05-05","review_id":"JzaQ5B4JzdFUx-g8i8Owzg","stars":4,"text":"Best meatball sub ever, EVER. Also, I'm a fan of the Pastrami on Rye,  the Reuben, and the presence of non Subway meats. You know how Subway says they have options, but really they don't... you just end up with meat you can barely detect covered by salad surrounded by too much bread. At Sub Station, it's all about the meat. Show me some meat!","type":"review","user_id":"qfsK7_jZ68XAg9Jpt5KQ8w","votes":{"cool":1,"funny":1,"useful":1}},
{"business_id":"kjrq7LOaMawzLTVlLMpApQ","date":"2010-04-04","review_id":"x8_-JMgUD_tuUl3s4HwP4Q","stars":2,"text":"An average burger for a higher than average price.  The burger itself wasn't too bad but I ordered it without mayo and it came with a heaping gob of mayo plastered onto the bun.  Nasty if you're like me and mayo makes you sick.  The prices were higher than I'd like to pay for just a burger and I don't plan on ever going back.  Still it wasn't the worst burger I've ever had.","type":"review","user_id":"nWT3tYZYFoKPUXSHYYhuLQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"FvaoSQEZdUJXi3A7gno1Xg","date":"2009-06-12","review_id":"BG-yWgDVYlyOonuHJujv8g","stars":5,"text":"D'Rose saved the day for me after their store hours! I called them and they were closed but it was important to get my order in for the next day delivery so I ended up calling their cell phone # which they leave on their voicemail message and was able to put in my order with a very nice kind gentlemen who was driving and he pulled over on the side of the road to take my order. The gift was a major hit and perfectly on time! I couldn't be happier with such kind and prompt service!!! I highly recommend D'Rose for flower and gifts and delivery.","type":"review","user_id":"KKd8jkRGTqZHADsNswtUZg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"zTuPYiRzmeYZqjxTeAqhSA","date":"2010-03-15","review_id":"WFuHdvAqo4fjIhZMC8KS3g","stars":3,"text":"oddly enough .. i miss jimmy john's sandwiches every so often.  the sandwiches here are a bit above average.  i love that they have different options and variety that you can do to your sandwich.\n\none thing i love about them the most .. is ...\nthey're lightening fast!  after you order and you paid  ... your sandwich is probably done a few seconds later (on an average day).\n\nit can get pretty crowded late at night for the after-party crowds.  they open late.\n\nps. their cookie come in frozen.  they leave it out until it's room temperature and then put it out.  so it's not fresh baked.","type":"review","user_id":"Yy5K-pdVXQUrdk-PrHGzLA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rXGioez8wVRBwJXJoBj9LQ","date":"2009-09-05","review_id":"sWmG-O_QqXzhETT_p5qgIg","stars":2,"text":"Overpriced. You can get more for your money at Springfield Mall in Northern Virginia. And the cost of living in Springfield is 5x more.  (Most students at VT come from Northern VA)","type":"review","user_id":"ZABoX8_9iMuLa3OAl2Pt8Q","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2010-04-04","review_id":"NNO2vIoEzWqqQ8IxmaaLBw","stars":2,"text":"There was nothing special about this place.  The food was iffy but drinks are cheap.  I wouldn't come here for the food or the drinks either really.  If you're not picky about your alcoholic drinks this could be the place for you.  Otherwise, I'd pass.","type":"review","user_id":"nWT3tYZYFoKPUXSHYYhuLQ","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"4kR9-F-iooU_l_n2mgSGDw","date":"2010-08-21","review_id":"GbwEutILzOrLqKJrwFiOKg","stars":5,"text":"Being stuck in college in middle of nowhere WV, I really find this place a gem when it comes to wine and beer selection. I love wine and the Lover is a beer connoisseur so this is a place that we both appreciate dearly. \n\nStaff is friendly, knowledgeable and very helpful to whatever questions you might have about wine and beer. Definitely worth 45 minutes of driving time. \n\nSpeaking of which, we are due for a visit soon!","type":"review","user_id":"NmK_2z5TovIX5cRbm0dFMA","votes":{"cool":0,"funny":0,"useful":2}},
{"business_id":"__EmsZiRXiUmljbfpOqZig","date":"2010-09-19","review_id":"dxZJMLr05xygRAQeD-XeFw","stars":3,"text":"Lacking other options, we headed over to Awful Arthurs for dinner before a work event at Vtech. I didn't think the food was awful at all. The service was not so great though. I ordered a combo platter w/scallops and crab cake and a side salad w/veggie. All were fine; not fantastic but fine. My peers enjoyed their salads. \n\nThe ambience is soreing lacking. But, if you want seafood; go. Also, they have a big bar and pool table area and a large area for private parties upstairs. Oh yeah and some outdoor seating.","type":"review","user_id":"Qd5wThqxfznODIlb6s9rvw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"-QNnL7C_z7NxiCarq3VZTQ","date":"2008-08-04","review_id":"U7szQ7VEGnArlF3Sbg1q9w","stars":4,"text":"Great fast food, the lamb meat cheesesteaks are delicious, as are the combo gyro/souvlaki's. This place also as beer on tap, unique for a fast food restaurant!","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"bLxwwBFOgqpxUiwDKCz9dw","date":"2011-07-11","review_id":"42k4GIUqGU1eU3lAAu7GAQ","stars":5,"text":"The new structure makes the farmers market a worthwhile trip every time!","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2011-02-12","review_id":"rEXB64ZrnZ4Qb7Z7uS7c9g","stars":4,"text":"Cabo Fish Taco is delicious!  To be honest, I didn't like the sound of fish tacos because I was always thinking of just plain fish inside of a taco shell.. Cabo Fish Taco dresses everything up nicely.\n\nI had the BBQ Mahi Tacos and it was so flavorful!  To be honest, I could barely tell I was eating fish.  The mahi was flavored so well that the taste is pretty memorable.  I had a bite of one of their specials, the red pepper steak taco, which is pretty good too (which means they serve not just fish).  For sides, I recommend the napolito salad (flavored black beans).  I'm not a big fan of beans, but this napolito salad makes me a fan.\n\nService is pretty quick and friendly as well.","type":"review","user_id":"eN00PkgPgiw5vcdP44JRIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2010-05-18","review_id":"H9CIYyF4z5G4O-x4vlxwkg","stars":4,"text":"Is it as good as you would find on the West Coast? No. Are you kidding yourself if you think you would find something like that in Blacksburg? Yup.\n\nThis place is great in comparison to anything else you might find around here. I love the corn salsa they bring out to snack on. The cheese or artichoke dips make great apps.  I've never had a bad taco whether from the standard cabo fish taco they derive their name from to the BBQ Mahi (and if you aren't a fan of seafood the steak tacos are good as well). And the potato salad is like none other I've had before.","type":"review","user_id":"_x7GY1uFoNePmirs3scEqg","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"jw8uu1q59V4-OBfLbFWxsQ","date":"2009-11-14","review_id":"kGbG_KvaM4KxYETW1jffDA","stars":5,"text":"This guys is amazing! When I lived in Blacksburg, I could always count on him to have a supply of buffalo steaks.  His prices are pretty reasonable too!","type":"review","user_id":"zEVuMXa6WNkQD4hXRnz7Lw","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2010-03-04","review_id":"wBFvYy0tU782hypG_K1caQ","stars":1,"text":"\"I don't know what that is, but it's not a burrito\" - Rob.\n\nEverytime I step into El Rodeo, I know I'm making a mistake. Think of El Rod as the booty call you know is wrong, but this one affects your gastrointestinal system. Servers address patrons as if this is a holiday in Cozumel (\"What can I get for you senorita?...Bueno.\"). I also have the sneaking suspicion that a peek of the boob or a dance on the table gets underage ladies drinks. Dunno. Just a hunch.*\n\nFood is gross. I swear the \"salsa\" comes out straight out of a canned tin of pureed tomatoes. Fajitas consist of vegetables standing in an oil slick. I think the melted cheese is mozzarella. Enchilada sauce is runny tomato \"sauce\" that reminds me of those old Prego/Ragu commercials comparing one sauce versus another - the loser is your enchilada's sauce.\n\nIt's close to campus. That is the only plus. A hard day sometimes requires a jumbo margarita and a free chip basket. \n\n*Not a hunch.","type":"review","user_id":"ajb0eqA8dKQZQyn9dtjEkQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"6CWCx51YbZ7ktkRSzA4ITQ","date":"2011-09-11","review_id":"bWdoqgfYknW5dFHmZ9h5Ww","stars":4,"text":"Staff is friendly and the subs are pretty good. \n\nI've had the NY Steamer and the Brisket Sandwich so far. While they weren't out of the world subs, they were solid enough and reasonably priced enough that I will be a regular. One thing though, I believe most of these man-subs have only meat and cheese in them. Wouldn't expect anything less. The pickle is good too","type":"review","user_id":"sa1oAg2Y762kz7p7IHryFw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"6ke_-lV12SwP0ebcGFErZA","date":"2008-12-09","review_id":"Fb90VOr09y7ebXMO2oSUnw","stars":5,"text":"Not fine dining, just good Italian counrty cooking. We stopped in after visiting Tech. Everyone in the family loved thier food.  Wood fired pizza and Lasagna were outstanding. My wife had the Gnocchi, might be the best I've tried. Pasta is made on site. Highly recommended, prices very reasonable, on the low end of the Price Range ($$) scale. Excellent food. 5 Stars relitive to it's location, price and service.","type":"review","user_id":"tdbHqXe5oGRy5X9vvAtSeA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"CQDgwHALlXTgvfOd0HoH8g","date":"2008-08-23","review_id":"XIAGeWWlKOvdB0jfNkKX7Q","stars":4,"text":"Cheap tickets and free popcorn on Monday's makes this indie thater one of the best cheap dates in the area.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"ZhwZCCBVmzwumpO8M27gIg","date":"2010-06-23","review_id":"Uw7GBU7iCCI7INCeyhgDGA","stars":4,"text":"I love the selection, there are a lot of independent and alternative films to choose from, and their prices are good as long as you don't go past the due date.  They also have a good CD and vinyl selection if you're into that.","type":"review","user_id":"mlkw5s9EpAW8MzCV3orA-A","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"F_ofTZiczPkYZ93JAE3RRQ","date":"2010-01-06","review_id":"cR06MdFKvClXxr9XedhVVQ","stars":2,"text":"I have had good experiences here in the past so it pains me to write a negative review but Cafe De Bangkok let me down badly.  I showed up for dinner with several friends only to find that the restaurant was \"closed for the holidays from 12/24 to 1/02\".  Ok, that's fine, I understand a holiday closing.  The only problem was, I showed up on 1/03 and they were closed.  Staying closed another day would be fine, just change your sign.  I was extremely disappointed.","type":"review","user_id":"RlfM67CZ4NSHsa2sJ9AYIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"F_ofTZiczPkYZ93JAE3RRQ","date":"2010-10-18","review_id":"4rv7SC0KowfH0R4LWraaHQ","stars":3,"text":"A Thai restaurant in a small rural college town in southwest va.\n\nI've had the chance to eat here at least 8 times before writing this review just to get a good idea of how this place really is before making any judgements or review.\n\nProz:\n-nice ambiance (just a lax environment with more 'modern' decor and a much needed break from the college-town bar-food restaurants and eateries)\n-servers are very friendly and willing to talk to you about the menu\n-food overall has been very tasty and seemingly 'authentic' enough at least for blacksburg\n-never really that busy in comparison to the rest of the restaurants in blacksburg\n\nCons:\n-prices are a little high for the portion sizes of the meals ($11ish for tofu ruby curry- about 10 cubes of tofu, 4 chunks of tomato, and 5 chunks of canned pineapple mixed into a curry sauce with a small amount of rice)\n-despite it never really being that busy, service can be quite painfully slow\n-thai tea is $3\n\nBottom line: This place is a nice break from the rest of food in Blacksburg, is never really that busy (although expect a wait in service), and isn't bad thai food considering it's in a small rural collegetown in southwest va.  My suggestions would be: the tofu pad thai (pretty standard pad thai with tofu, they're pretty skimpy on the tofu but the flavors of the pad thai make up for it), the ruby curry with tofu (again skimpy with the tofu, but to stretch the meal out just order 1 order of the curry and take it home and make several cups of rice and eat forever) I say come here for lunch and save yourself a couple of bucks.\n\nRough estimate spent on a date(dinner):\n-$6 for 2 thai teas (sweetened black tea with half and half)\n-$11 for 1 order of tofu ruby curry (comes with rice)\n-$11 for 1 order of tofu pad thai \n-$3 for tip\n\n=$31 mehhhhh","type":"review","user_id":"zNV3YeyLDsfN16j9d5lzrA","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"YKWQbP6B13LT60j9tEEtIg","date":"2011-03-05","review_id":"s5RgEncyQWIkQmBUfNeEkA","stars":5,"text":"This place is one of Blacksburg's best. Yes- the sushi portions are not gy-normous, but when are they ever?  The sushi creations are absolutely delicious, fresh, and can rival any other fusion-restaurant in the region.  The middle-eastern dishes, on the contrary, offer larger portions, and are fresh and taste quite nicely.\n\nThe staff is usually friendly; and once went above and beyond and spoke at length about the available tea selection with me.\nTry them out!","type":"review","user_id":"OqL9KDngaiQ__rWKSNKxfA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"-QNnL7C_z7NxiCarq3VZTQ","date":"2009-11-30","review_id":"fwW7YaVnf9jIPqvwDDwaIg","stars":4,"text":"Good, cheap food. Good people, slowish service.","type":"review","user_id":"_v9J4gRv_0q_ocYtZKm22w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"vpxUqSMqPJyhTisCDSG1_Q","date":"2011-07-18","review_id":"h5H8BlJH4BUKsqhV_VMq6g","stars":5,"text":"This is one of the hidden jems of Blacksburg food. Best (and only) kabob place in Blacksburg. They serve many different middle eastern food, with small tapas style appetizer trays. Their Soujuk and Chicken wraps are AWESOME, perfect spices and the sauces that come with them add the perfect amount of juice. Thier pita bread is the best in Blacksburg, thin and always served super warm. Give it a try.","type":"review","user_id":"zAEzK5FgrSVmrIPq43cxAQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"N19o2kuH7hcfnf5xzfC6AA","date":"2011-06-23","review_id":"Nrn0_il_K-2b_eHNfeF4qg","stars":5,"text":"I absolutely love coming into this bank. The employees are always so welcoming and always willing to help in any way they can. I recently opened a couple accounts and they offered me something to drink and a snack while I was waiting for them to set up my accounts.","type":"review","user_id":"fZr0WHGvoKnH7jNJLXg8Lg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"dZwZlfR-FZkRmA5D4PtMaA","date":"2011-01-04","review_id":"AgS0k7XkNPGrzTfuaaIUlQ","stars":5,"text":"Great decor good food and friendly staff","type":"review","user_id":"4ad2MmO7VDILLAKRSD7wGw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"r4panjUBSyDOEtDsSWyf9Q","date":"2009-05-02","review_id":"AiMmH5eWdDfbqUW9AG5Qcg","stars":5,"text":"El Mariachi. This is Spanish for The Mariachi. ( Actually \"the mexican street band\" )\n\nThis wouldn't be in my top 5 in Denver, but its definitely my #1 in the New River Valley. Maybe rivaled by Abuelos in Roanoke. They have good flavor, even if the spice is slightly lacking. \n\nSome favorites are the chile rellenos (which aren't deep fried), the chimichangas, the fajita quesadillas, and the carne asada. Don't be fooled, there are some poor choices on the menu like the pollo mexicano, but overall, the best in (or near) town. Also, the jumbo margs are a little sweet, but you can order the Texas marg and share with a friend and still need to call a DD. Also, imports are cheap and domestics are expensive comparatively - so that's a nice flip-flop.\n\nThe family that runs the place is always kind and if you come enough they start to recognize you and know what you'd like to drink. I admire the restaurant for staying open year-round and not having summer hours.  Tienes hambre? Bienvenido al Mariachi!","type":"review","user_id":"qfsK7_jZ68XAg9Jpt5KQ8w","votes":{"cool":1,"funny":2,"useful":2}},
{"business_id":"z2o5kP4SZVbsO5UCH1rP0g","date":"2010-04-04","review_id":"q7ol-8dIE-P4LEaAp_30MA","stars":3,"text":"The pizza is no where near the best I've ever had but for the price this is a good deal.  For less than 6 dollars a person you get all the pizza and salad you want.  If you're looking for super high quality pizza I'd recommend going elsewhere but if you're looking for decent pizza at a great price, go here.","type":"review","user_id":"nWT3tYZYFoKPUXSHYYhuLQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"G_GPyXy1k9yA3njUJpW55g","date":"2009-01-30","review_id":"2jlo1hTzOMeDvmQ_RK5inQ","stars":2,"text":"Poor Billy's is a bit overpriced for a restaurant in Blacksburg, but the seafood here is pretty good and the sushi is alright (much better than Kroger's \"sushi\", which is probably the only the place you can get sushi in the Burg). The place is usually packed, though, and the wait time is sometimes excruciatingly long. It may be more worth it to take that time to drive out of Blacksburg and find somewhere else in Christiansburg or Roanoke.","type":"review","user_id":"MGY9Z55I5o7X-8XT0QqOxQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X381_JV6xOq3VSsep13GvA","date":"2009-10-18","review_id":"DF1G0B-cCpT2WTHNKmV6eQ","stars":4,"text":"Yup, it's a chain, but a super friendly one.  There are dinosaurs and king kongs and all the funny stuff you see at the usual chain store.  The waitress was really cool.  She told us that the nachos were half price after a certain time.  We got the nachos with everything on it.  Literally, everything was on it!  I also got a rare roast beef sandwhich was bacon on it...  seriously, rare roast beef + bacon?!?!?!  My dreams have finally come to fruition.  The rare roast beef was the stand out star.  Very tender and juicy!","type":"review","user_id":"uLthrQwJFUYvfNzsB45iHA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"F_ofTZiczPkYZ93JAE3RRQ","date":"2010-03-05","review_id":"4lzja94AKNPXdflrp402hA","stars":3,"text":"I felt compelled to write a review because I really don't think this place is getting a fair shake.  I frequented Cafe De Bangkok when i was living in Blacksburg (through May 07) and I honestly can't say I ever had a bad experience.  Was it authentic, on point Thai food? No. Of course not. It's a little, cheap restaurant in SW Virginia. That's like asking if Olive Garden tastes like real Italian food or if your local Chinese take-out is what you would get in Beijing.\n\nThat being said, I always found the food tasty, particularly the yellow curry.  And it saved me a trip into Roanoke in search of slightly more authentic Thai.  It is rural college town Thai and I liked it.","type":"review","user_id":"FXPGGtOlCawxz5Uw5DNF3A","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"3OmYvTrYQFwITFq4vm6Vsg","date":"2009-07-17","review_id":"L8xAM4DJ4il8j2uTF2owxg","stars":2,"text":"You are paying for the atmosphere, plain and simple. The food is not worth the premium price. I have had better quality food for much less than the meal ticket here. The only reason I imagine people like the place is it makes them feel elite. I have mixed feelings about the Ala Carte style menu. And things like Charred Tomato Soup? Come on, I can burn soup at my house, that's what it tastes like.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"T0WFU_zBoeHD1-08TX33-g","date":"2008-10-12","review_id":"C2_YiUv7gsHbubbriPQV8A","stars":4,"text":"Contrary to what the first reviewer said, I like the buffet. When I review Chinese food, I think of Americanized Chinese food and it is delicious AND GREASY! America! F-yeah! I love the fried wontons with duck sauce they give (kind of like chips and salsa, but of the Chinese world)\n\nTheir fried rice is the best I've had in Blacksburg, and their portions are huuuuuuuuge and yummy. Can't really go wrong here, especially if you live in Foxridge, away from all other life forms.","type":"review","user_id":"ZABoX8_9iMuLa3OAl2Pt8Q","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"l1sY1Bp-ICeb8QduHjIjtA","date":"2010-12-14","review_id":"KEdN7eRs3YKK_mIZZhBK6g","stars":1,"text":"This place was selling gift certificates last year (December of 2009) and then in January of 2010 they closed. I'm posting this now, a little under a year later, because someone I gave a gift certificate to tried to cash it in recently and found they had gone out of business. After doing a quick google search, it seems as though this was the norm.","type":"review","user_id":"twISWUMTq7r80UP_s11z3w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2011-08-28","review_id":"MgbHEHFNN-Ns02oJV7-cvw","stars":3,"text":"Fish... fish tacos","type":"review","user_id":"E1Ly2m3xmMAyuylgptmfcA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Te72-fjbquQFCfPBgJ4ldQ","date":"2009-05-15","review_id":"UNqth3LDcQwq9bxAtfjoKg","stars":3,"text":"Customer service - 1 star.  Went there for lunch and the service was extremely slow and no apologies or explanation until we started getting aggravated.  It took almost an hour for our meal to come out for a party of 7 and we only order sandwiches.  However, the food was great.","type":"review","user_id":"4c2AjbgLRY2YmW7IlVk3GA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"KsrMCDF689P4bTBrrbTLjA","date":"2011-05-29","review_id":"K2yIzuwEWTxprNl-UTBWzA","stars":2,"text":"This review is ONLY about the food!\nI don't know why so many people like this place. I've been here many many times and have always WANTED to like it. They have beer and barbeque...how could they screw up barbeque?\n\nThe food is ok to sub-par. I had their special tonight. \"Slow smoked sirloin\" with grilled zucchini and garlic mashed potatoes. Sounds delicious right? Well, not really. The plate came with 6 unevenly cut slices of zucchini that had been steamed and then slapped on the grill for char-marks. The garlic mash was indeed garlic-laden, however had the consistency of lumpy glue. I ordered by steak medium rare but it came out well done and pre-sliced. I hate when they slice my steak for me, but that's not the point. The \"smoked\" flavor was atrocious. It was like they made a fire with plastic and then threw the steak on for a few hours. The only way I got the thing down was to cover up the \"smoke\" flavor with their vinegar based spicy barbeque sauce. \n\nMy friend got the pulled pork plate. That's a dish that is always on the menu so you think they would have perfected it. Again, no. The \"roasted vegetables\" it came with were still swimming in the water they used to boil them. The baked beans on the plate tasted like it came out of a can...actually the canned stuff is better than what was on his plate. The pork was just \"meh\". He also poured the mustard-spicy sauce on it and that made the whole thing taste considerably better. \n\nThe only great thing I've ever had here were the smoked wings. They come in a ton of flavors and taste great going down with a cold beer. Oh that's what's good there too: the beer.\n\nIn short, it's not worth what they charge for, so eat the food at your own risk. The happy hour is ridiculously good, though. So go for that.","type":"review","user_id":"dSMGngUonzIFBRWhYKiqXw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nbJSDQDMPopbVf6ASB8a5w","date":"2010-03-15","review_id":"kQKQoEN2G5f-uos8Bv6VQQ","stars":4,"text":"i like this place more than outback steak house!\n\nthe bread they give you before the meal is so good!  you know they're fresh because they're hot when they come out.  sometimes you have to wait because the bread's still baking in the oven!  the butter spread isn't any plain butter.  they made it with the own twist.\n\nthey offer many different cuts of steak.  you also have your chicken, pork, seafood, burgers, sandwiches and salads if you're in the mood for something else.  i think they do a better job in cooking your steak the way you wanted it than outback.  all the sides are pretty good!  they give you good portions, so you leave the place full!\n\nyou can find great \"early bird special\" deals on weeknights.  i think it's from sometime around 5ish.  but it's a good deal!\n\nit can get busy on weekends!","type":"review","user_id":"Yy5K-pdVXQUrdk-PrHGzLA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"F_ofTZiczPkYZ93JAE3RRQ","date":"2009-01-29","review_id":"vlXmndjNS0Rd6jdq36qyLQ","stars":1,"text":"Is this place still in business? I hope not. I remember it was one of the most horrible dining experiences I ever had when I lived in Blacksburg. The service was incredibly slow and the quality of the food was just horrible.","type":"review","user_id":"MGY9Z55I5o7X-8XT0QqOxQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"cv1AfDz53DzWftlHh-58pg","date":"2011-04-09","review_id":"Ut_F_quBV09WeGtg46H8qA","stars":1,"text":"If you're in the mood for sushi in Blacksburg, keep away from Poor Billy's.\n\nI've gone here four times now and all four times were consistently disappointing.  In most recent time-- my friend and I were the only ones in the restaurant, so you would expect a pretty fast service. WRONG! They are incredibly slow; taking more than 20 minutes to prepare 2 rolls, and another 5 minutes to get the check.\n\nBefore, Poor Billy's used to offer a $5 lunch with (come with soup and your choice from a list of rolls).  Now, they no longer offer that deal.  Now, I'm stuck with paying $8/roll, but that isn't really t the problem. \n\nI'm usually happy with paying ~$8/roll, given that they are of decent size and quality.  However, Poor Billy's rolls were THE smallest sushi rolls I have ever gotten and they were not tightly rolled, as you would expect.  \n\nThe only reason I would even consider giving Poor Billy's a single star is the staff was nice, despite their extreme sloth-like movement.","type":"review","user_id":"81r22SB_1_HNbz66E79YTQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"WKj7NYkcjY79SvaqIunzVw","date":"2009-11-30","review_id":"RiZuWcaU0HqT4FoGR9TQQA","stars":1,"text":"Go if you like shady crowds, no liquor and shitty music.","type":"review","user_id":"_v9J4gRv_0q_ocYtZKm22w","votes":{"cool":0,"funny":1,"useful":0}},
{"business_id":"Te72-fjbquQFCfPBgJ4ldQ","date":"2010-08-28","review_id":"toojeEZ7u56_QlhU6aXX6g","stars":4,"text":"Went here for drinks one night after work. Good selection, ok prices. Love the deck, but I didn't try any food.","type":"review","user_id":"twISWUMTq7r80UP_s11z3w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3UbkuKOjZ8YrWdAZx94-ww","date":"2006-12-29","review_id":"qz_JHCWcrfnNztM0nWX3pg","stars":3,"text":"Lia's has been my hair salon in Blacksburg for the last couple years. She or whoever cuts my hair is generally pretty good.  The haircut usually ends up being $25 or so before tip.  At least for women haircuts.. not sure for guys.  You do not normally need to schedule an appointment, walk ins are welcome. Even on the busier days, the wait  is not too long.  \n\nHowever if you have bangs, beware!  When someone is blow drying your hair in this town... they tend to curl-blow dry your bangs and you end up with 80's bangs!!  This has happened twice to me already!!  I had to rush home to undo the curling before going back out to meet friends for dinner before!!","type":"review","user_id":"5m-p2ddJBi4nIXWSglVGEQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"MyU7EzjeeWriyDwkenfLqA","date":"2011-06-24","review_id":"Z_CE18B9PnfveiJ8jbJ8FA","stars":1,"text":"Moe's offers tasteless and watery fare. They have cheesy-menu names which you choose your order from (no freedom like Chipotle) and no sense of quality of ingredients. Definitely go to Chipotle if you want a good burrito and quality ingredients! It is right across the street.","type":"review","user_id":"scL6AqiMiYt5I9H-RJjfUw","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"tJwomYMNjpd4A31rDMXMCw","date":"2011-07-18","review_id":"yKdLfrXlqf549waEjFP0WA","stars":4,"text":"It's a college bar. I love the Shark Tank. Happy hour every day, great drink specials, 5 dollar pitchers, Thursday is the BEST day of the week because of their Killa Kool Aids.\n\nI've had their food on two occasions: Sunday brunch buffet and one of their chicken wraps for dinner. Both were delicious and have no complains. Service is all right, it's a college bar so when it gets packed and you are eating, prepare to wait a while for your food. But that's no big deal if you have a beer in front of you.","type":"review","user_id":"zAEzK5FgrSVmrIPq43cxAQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"n24Vn9DpMwDW5e6MPjOnrA","date":"2008-11-24","review_id":"9y1dxoTCKBQ5tmzwJeYnrw","stars":5,"text":"Not Just for kegs \n\nThis place is without question the hidden gem of blacksburg. The dead give away that the food is great is that fact that a majority of there business is the football team. The service is a bit slow, but that is to be expected when everything is made from scratch to order. \n\nI recommend a double order of the mini me's without tomato. But you can't go wrong if you order something else, everything I have ever ordered has exceeded my expectations.","type":"review","user_id":"QSE-VB9cWndmTLo2u9UUMg","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"5zyibT__dkE21sAyLb1qvA","date":"2009-04-04","review_id":"lCMIgtA17wUeVwZCJRMufA","stars":4,"text":"I'm a fan of eating outside on a beautiful day. Their dinner menu is better than their lunch menu, in my opinion, but I can always find something I like. Portions aren't huge and ingredients are fresh. Not the best atmosphere inside, feels like a cafeteria, but outside is nice. Also, props to the establishment for its \"lefties at lefty's\" night, where are the liberals can get together and not feel like they'll be pounced upon by a popped collar frat boy who likes BUSH.","type":"review","user_id":"qfsK7_jZ68XAg9Jpt5KQ8w","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"I5dFvzPt57bb9T7z0Mp-jw","date":"2010-03-25","review_id":"GAL8HO-6tGpB-SvK40PSAw","stars":4,"text":"Stopped in last Saturday morning and was welcomed with wonderful food and a lady singing folk music. The building is not much to speak of (strip mall location) but the food and friendly people more than make up for that shortcoming. Scones were some of the best I have had in years.","type":"review","user_id":"oGv2UjFZ280Pup2lrg-1ew","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"wk8EiiHeB3TFx0YCOOityA","date":"2009-01-13","review_id":"PBS_2MM_kRXRdrHfghxpsw","stars":4,"text":"This is one of the few Italian restaurants I've been to that have their own Wine Cellar that you can look around in and buy wine from. They'll let you buy it from there and will cork it for you for only $2. Even though the cellar isn't large by any means, they still have a pretty extensive collection.\n\nAs for their food, we had a pretty good experience there. I got their combination platter, which was one manicotti roll and smaller portion of their eggplant Parmesan. My fiancee got their Veal Tenderloin. Both were pretty good. For desert, we got their Chocolate Lava Cake, which unfortunately I would NOT recommend to anyone. It was sooo rich that we couldn't eat very much of it and I love chocolate.","type":"review","user_id":"JDgAAy73XoGJK4S1Z0UHAA","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"lE_jefQ2F9PSjtNmNTSFIA","date":"2011-03-14","review_id":"XC9n2BDAt79HiXEjH4LhmA","stars":3,"text":"People seem to have bad experiences with this place.  I've never eaten here on a normal night, but we did have our rehearsal dinner there.  It was amazing.  The food was ridiculously good!  The ribs were to die for.  The baked potato was incredible and the drink refills just kept coming.  Of course, this was a rehearsal dinner with dedicated wait staff so they gave us the star treatment.\n\nThe place is a little tacky and outdated but the outside is kind of cool.  If it was more updated then I would give a higher review.","type":"review","user_id":"MEelJ6vFB3R98QijclGK6Q","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Vd9gGFmHfsfQE9Ytxnr85Q","date":"2011-05-22","review_id":"ri6jWvjx9Dy_J8lf-VM1VA","stars":3,"text":"Epic Fail back in the deli section.  Bought one of the Marketside Turkey & Bacon Croissants.  It's in a plastic container, but says \"made fresh in stores\".  Got this sandwich to eat later for dinner.  As I bit into it, it tasted a bit odd.  Was looking at the ingredients and realized that they forgot to remove that little piece of paper that separates servings of meat or servings of cheese.  Taste wasn't too bad after I pulled all the paper out of the sandwich (and my mouth), but the moment was already kinda ruined.  Could've done without it.","type":"review","user_id":"37x54E6hH0tfcWtbOdhiNA","votes":{"cool":0,"funny":1,"useful":1}},
{"business_id":"Ij5vTLLpmulfCsK64jGGxw","date":"2011-04-20","review_id":"7I1LHgwsJkG0VEFhCOC0yQ","stars":4,"text":"Pretty much exactly the same as it was 10 years ago, except now they serve a late night breakfast.  At night it is a weird mix of dive bar, pool hall, and college bar.\n\nLunch was good, but I don't think I would eat dinner here.  I can see why current Tech students wouldn't like this place with Sharkey's, BW3's, and Awful Arthur's within walking distance.  But if you want a cool place to have some beers, play some pool, and be able to talk to your friends without shouting, give this place a shot.","type":"review","user_id":"k9BAzY1cqjYtMY9J4YdSMQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"T6eavqkeaIrv4giuCeXTPw","date":"2011-09-11","review_id":"RlN4XW--xrVysBu92fRPwg","stars":3,"text":"I came here with a bunch of Chinese people and we ordered off the Chinese menu. Of the six dishes + one soup we ordered, one of them was good (Chicken with Chiles or ), and the others were about a 2.5/5 (they were all sichuanese-ish dishes and it's a curved 2.5). On a side note, they like to cook with star anise which is good if you don't like spicy. If you do like spice though, it's kind of a buzz kill. Just ask them not to add star anise or \"ba jiao\" in that case.\n\n*sigh* I think Sean makes a good point. You basically just have to lower your standards out here in blacksburg. Curved, it's a 3. Were I living in the city, I'd give it a 1.5 and never come back.","type":"review","user_id":"sa1oAg2Y762kz7p7IHryFw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X381_JV6xOq3VSsep13GvA","date":"2011-07-12","review_id":"q8YVLY6_sPuWZRd3Tk9J0w","stars":4,"text":"A fun environment with every type of delicious sandwich you could imagine!","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nXXfB3-tIIZczK4byP8JWQ","date":"2010-10-26","review_id":"n4Rs3hXTjI1CbgMUzmf3jg","stars":2,"text":"Want a good burger in Blacksburg, go to Lefty's Main Street Grille","type":"review","user_id":"xcXBq4wt5IpCoTBwwBhUyA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"XzsZqaWSTXbyS_kbv7GZSA","date":"2008-11-26","review_id":"EINB9zGV_Eh0ZkocFl7GAw","stars":4,"text":"Best Italian food in Blacksburg -- this is coming from someone that now lives in NY, NY. Zeppoli's isn't bad at all, but Vincent's takes care of you like an Italian restaurant should.\n\nI generally went with a veal or chicken parm, and both hit the spot.\n\nGive it a try. Go back enough, and they'll learn your name and order -- trust me on that one.","type":"review","user_id":"fJBmDZ4iDZW6f54RWnWFFA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3ulgAMrHx6FFvDUMrLInDw","date":"2010-11-29","review_id":"0CUyHccaj9zWBkFrdabvxg","stars":2,"text":"Being a big fan of Chinese Kitchen on the north side of Blacksburg I had high hopes for Hokkaido Buffet.  Unfortunately I was hard pressed to find a single dish I was enamored with.  Yes, its cheap and of course it's all you can eat.  The problem is, do you actually want to eat anything here that badly?  None of the normal fried Chinese classics are particularly good here, the sushi is incredibly suspicious, the desserts are extremely unimpressive and there are numerous bizarre dishes.  It doesn't help that they put things like shrimp next to the cantaloupe.\n\nOne thing I can say about the place is that they have excellent service.  The waiters came by often to keep my glass refilled and were great about clearing dishes.  The cashier was prompt and efficient.\n\nWhen it comes down to it I'd rather pay the same amount of money for a single dish from Chinese Kitchen than this buffet.","type":"review","user_id":"RlfM67CZ4NSHsa2sJ9AYIQ","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"Ij5vTLLpmulfCsK64jGGxw","date":"2010-11-08","review_id":"pUO0yV0Dj3tdtchez_ZY1g","stars":2,"text":"This place alternates between crap and okay.  When I started at Tech, it was decent, then became the place you'd go if you were looking to get into a fight.  I think it's fluctuated between the two since then, but one thing about HH has remained constant: they serve some of the worst food you can get in Blacksburg.  It's standard bar fare, so you wouldn't think it'd be that hard to deliver a decent product, but you'd be wrong.  I heard the wings \"weren't bad\", but the chicken tenders were terrible.  The establishment was moderately filled, but it took over 30-45 minutes to get an order of 10 wings and 4 burnt chicken tenders.\n\nAs far as the bar is concerned, they finally got Killians off tap upstairs, which is good since it tasted like soap for 5+ years.  Hopefully they replaced/cleaned the line before replacing it with something else.  I've only hung out downstairs once, and that was to play shuffleboard.  The rest of the times I've been there I've hung out upstairs, mostly to play pool.  It looks like they reupholstered the tables since the last time I was there, which was a pleasant surprise.  There's a shuffleboard table upstairs, too, so there's stuff to do.  Some might be interested to know that you can smoke upstairs, presumably because they have 2 separate bars and ventilation systems, so don't go upstairs without expecting to smell like ass afterward.\n\nReally, the only reason I went here this past time was because my friend knew the bartender and either got a great deal or was paying for everyone w/ his company card.  Free beer is always better, but I probably won't ever say, \"Hey, let's go to Hokie House!\"","type":"review","user_id":"Brzyv0JlzxG3PFMXq085KA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"J-pY8tSvUc2ekYnnUR-uQQ","date":"2010-06-26","review_id":"9W8BP6rAdV-ljj0x7mlFKQ","stars":2,"text":"Fast food burger joint.  It's better than McDonald's, but not by a whole bunch.  The place has the same design as the Carol's Jr. out West, but a much smaller menu and less clean/modern design.  I found the prices a touch too expensive and the wait excessive.  For a double cheeseburger and big hamburger, I had to wait 7 minutes in the drive-through.  The food was decent, but nothing special.  I think Burger King would have been better for it's time to quality ratio.\n\nGood tomatoes.","type":"review","user_id":"wMzGO3ZI7WV3bIplNjRVFw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Ij5vTLLpmulfCsK64jGGxw","date":"2010-02-03","review_id":"6a9Ak-XzDSYDMNuhpPkO6g","stars":1,"text":"What else is there to say about a place that's dead-empty at the height of lunchtime during Family Weekend at a school the size of Virginia Tech?\n\nDespite that fact that our party of four sat down and only one other table in the entire place was occupied, it nevertheless took THIRTEEN MINUTES for the hostess to bring us menus.  Then it took almost 30 minutes for her to return to take our orders.\n\nI was hungry, and ordered the bacon cheeseburger because of the way it was described on the menu:  \"All the bacon we can cram onto it!\"  Well, over half an hour later, it arrived -- with ONE slice of bacon (cut in half -- they tried telling me it was \"two\" slices of bacon).  I asked to see the menu, and showed the server how the burger was described, and how could anyone justify what was served to me?\n\nI didn't send it back because at this point, if another customer walked in (which never happened, BTW), I was hungry enough to eat HIM.  So I ate the stupid burger, which was downright AWFUL.  No flavor, severely overcooked, stale bun. . . In retrospect, we should have gone to the Wendy's down the street.\n\nFor only the second time in my life, I walked out of a restaurant without leaving a tip.","type":"review","user_id":"t37V8jz9h2QBKFHK9pI4Kg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3juObN8h-4AZfaxLDhPtQw","date":"2010-07-28","review_id":"raYG3JGfBMTLLQOCbToLJg","stars":3,"text":"The few times I have gone here to watch a sporting event, they had the music blasting insanely loud with no volume on the game.   Good food with decent service.   Good place to go shoot some pool or play some darts.","type":"review","user_id":"bN413avBeTgOIR7gdORjvQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rXGioez8wVRBwJXJoBj9LQ","date":"2011-01-26","review_id":"MyY7bV9gd2Btlka3IYNgxw","stars":4,"text":"This is a good place if you want some quick service Japanese food.  It's a shortcut of eating at a hibachi grill minus the presentation and service.  Although it's not as amazing as some of the Hokies hype it up to be, the \"Hokie Sauce\" is a pretty good thing to add if you want more flavor in your dishes.","type":"review","user_id":"eN00PkgPgiw5vcdP44JRIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3ulgAMrHx6FFvDUMrLInDw","date":"2010-09-26","review_id":"NnjeNsrXSZsU1qKa-jvAng","stars":4,"text":"If you're familiar with Blacksburg at all, a few people from 'Chinese Kitchen' on north main street decided to open up a Chinese buffet restaurant down south main street about a year and some change ago.\n\nThis place rocks.  As far as Chinese buffets in this area, this has got to be the best one for your money and tastebuds.  They have your typical options of Ameri-Chinese food (general tso's, chicken + broccoli, fried rice, etc.), some weird concept of 'american food' (beef stuffed in some random puff pastry and baked, mushrooms stuffed with idk, radioactive-looking pizza), fried foods (crab rangoon, egg rolls, etc.), sushi (none of it looked appealing at all, im pretty sure the ingredients used in it are extremely low-grade, but this IS an all you can eat buffet.), mongolian BBQ(pick your raw veggies and meats and pick your sauces and they stir-fry it for you) and some crappy desserts (pre packaged cakes and watery soft-serve)\n\nBottom line: I go here for lunch because it's $7 (includes a soda) and the food overall is pretty good.  Highlights for me include: pepper chicken (crispy chicken w lots of pepper), stuffed mushrooms (mushrooms stuffed with idk but pretty tasty), their mongolian bbq (go for lots of the garlic sauce + hot sauce), and their egg rolls.  I would definitely stay away from the desserts and sushi bar, but everything else is pretty good.  Beijing buffet is literally a few restaurants down, but nowhere close to the quality, cleanliness, and service that Hokkaido offers.\n\nps: they give you a 'frequent eater card' that if you eat 9 times there, your 10th visit is completely free!","type":"review","user_id":"zNV3YeyLDsfN16j9d5lzrA","votes":{"cool":1,"funny":1,"useful":1}},
{"business_id":"n24Vn9DpMwDW5e6MPjOnrA","date":"2010-11-08","review_id":"pe2opahQtu2yFNUNc19gEQ","stars":4,"text":"One of the best little-known places in Blacksburg.  Like any good deli and/or sandwich shop, they have a huge list of sandwiches with odd names posted up on the wall for you to choose from.  I'm personally a fan of the meatball sub, but I haven't had anything bad here.  The decor is different, but hey, it's a tiny shop in a college town.\n\nI try to stop in every time I visit Tech, especially the morning after the bars, but it doesn't always happen.  I love it, but not many others know about it so they always want to hit up some place they know.  If you can get in here, though, do it.","type":"review","user_id":"Brzyv0JlzxG3PFMXq085KA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"I_7cQmHxx6LokP9yr7Fx-w","date":"2009-01-13","review_id":"teYHGaTsjnjp48j29qS7VA","stars":4,"text":"This place gets my vote for movie theaters in the area! It looks relatively new from the outside and from the in, really. The seats are big and comfy and compared to DC Metro prices, it's a steal. The parking is attached to the mall parking, so it can be a little cumbersome to find a place to park, but it wasn't bad on a Saturday afternoon.","type":"review","user_id":"JDgAAy73XoGJK4S1Z0UHAA","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"vpxUqSMqPJyhTisCDSG1_Q","date":"2011-03-21","review_id":"IoJd8Q3SOfHzhHhQbifk3g","stars":3,"text":"Now called Pita Vera. Should be called \"Nickled & Dimed\". Food was good, but everything is an upcharge. Wanted chick peas added to salad -- add'l $1.50.  This isn't the first time they've done this either. Service was fine, but restaurant was empty.","type":"review","user_id":"qKVDNkNy1blHO71VfOcJ_w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"voXoIsapBR30q_7PgxVeAA","date":"2010-11-27","review_id":"GHkKkGxkTcUc8X3UG-_7UA","stars":3,"text":"I don't get it.  Backstreets generally has good food, though it's hit or miss, and how can the service be so slow when the restaurant isn't busy?  The last time I ate here, my sandwich was somewhat scorched, though I ate it anyway because we were in a hurry to catch a flight out of Roanoke (and our food had already taken long enough to arrive!).  It would have tasted really good if it hadn't been burnt.  The fries, however, were good, and everyone else at my table enjoyed their calzones.  I know that Backstreets is capable of more than this, because we had some good food here when we lived in the area about two years ago.  I used to love the baked ravioli, so I hope it's still as good as I remember.  The parking lot is cramped, but there's a parking garage across the street if you can't find a closer spot.","type":"review","user_id":"lcvzFfl-fw3gDyBQlNT9hQ","votes":{"cool":1,"funny":0,"useful":2}},
{"business_id":"F_ofTZiczPkYZ93JAE3RRQ","date":"2009-08-17","review_id":"4_k3Lkwz_0AsSYBrxGVU8A","stars":1,"text":"My spouse took cooking lessons in Chiang Mai, and we have hit dozens of Thai restaurants in the San Francisco area and Seattle, so I have some idea of what real Thai food should taste like, but this is not it. The dishes bear a passing resemblance to Thai food at best. The pad thai is ketchupy, the curries are one-dimensional, and the other attempts at Thai food go astray with odd, inauthentic, and diluted flavors. If you are not looking for authentic Thai food but could be satisfied with a general Asian-ish meal, then you may well enjoy your dinner. Service has been fine, and the ambiance is pleasant: modern, clean, with a hint of hip. If you want good Thai food, go to Tong's Thai in downtown Roanoke.","type":"review","user_id":"76aU-WjTIfgZsp1h-VBn3Q","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"J0_BwdMFpqTSlmc4TQhjsg","date":"2011-01-12","review_id":"3hgmLENymxGRjpfM5RD0tg","stars":5,"text":"I love Meredith's Salon.  I have moved to California, and I miss it terribly.  The key to my love is Amy Kinsley.  She is hands-down the best stylist I have ever met.  She knew my hair like the back of her hand - what would work and what wouldn't.  She's great at working to create a specific look based on a picture and at helping you come up with a style on your own.  She did updos for me on several occasions as well, and they were all fantastic.  In addition to all of this, she has a lovely outgoing personality.  I always look forward to chatting with her during my appointment.  I loved her work so much that while I was at college hours away, I waited to get my hair cut until I could get back to Christiansburg.  I'm too far away to use this strategy anymore, but I sure wish I still could.  Amy is awesome, and Meredith's Salon is THE place for hair in the New River Valley.","type":"review","user_id":"tqu5wlmnYu9d4SBheEwFJQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"nXXfB3-tIIZczK4byP8JWQ","date":"2009-12-03","review_id":"U7KSecupKPbp_9Q3d9vVBg","stars":2,"text":"I don't get it. The burger is served upside down - that's it? It surely doesn't taste any different than getting some unseasoned beef from Kroger and slapping it on a grill/pan.\n\nThe fries that I recall eating here were steak fries - I don't like those.","type":"review","user_id":"ZABoX8_9iMuLa3OAl2Pt8Q","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"p-YvmgcTcpzNS44SSV-26g","date":"2011-09-06","review_id":"nkn9KCRGmZm1ro-1RDBsHQ","stars":4,"text":"It's nice to have a local chocolate shop. They have a great ruffle selection and I love their dark toffee caramel haystack!","type":"review","user_id":"KDWZhkRefaWxOZXsqA6nMg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"4kR9-F-iooU_l_n2mgSGDw","date":"2011-03-07","review_id":"wL1VkXsPOoYK_ExuoSbbAA","stars":5,"text":"Vintage Cellar introduced me to many different beers thanks to their free tastings.  I love their selection on the staff are very helpful. Beer snobs and beer noobs can find just what they're looking for here.","type":"review","user_id":"2dGKfiGCVaHB2QjdLRI2oA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2008-05-09","review_id":"xedtMT8xSdfydjBhs6eXsQ","stars":3,"text":"Great place to enjoy a margarita or beer with friends.  The atmosphere is young and vibrant with an excellent wait staff.  Prepare to have a GREAT time if you go in when it is busy.  The wait is never that bad and the waiters are FAST!  The food is pretty good but nothing incredible.  The great service, great prices and great drinks are the reasons to visit El Rodeo.","type":"review","user_id":"1V38sXUk6_Y78xa7MCqMIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"et0tmr3f3bdZIBfKOwCySQ","date":"2011-06-04","review_id":"3UBUm6w61OTgn_KS3jWsHg","stars":5,"text":"Magnifico is one of a kind! I would hire him again and again as he was the reason our wedding was so wonderful! You won't be disappointed hiring Magnifico for your special events. He captures every moment, beautifully and ensures a memorable time!","type":"review","user_id":"YcIgvQrCHl7Xx9hz1mw3BQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"voXoIsapBR30q_7PgxVeAA","date":"2011-02-12","review_id":"5K-YSoZzWXwdiqRoj7ryrA","stars":4,"text":"Overall, this is a good place.  You get a good mix of Italian and New Orleans style cooking.  \n\nI usually get the Cajun Spicy Shrimp Alfredo and I recently tried their pizza and it was delicious!  The bread is homemade and they have a big selection.  I tried the cajun pizza to get a similar taste of the Cajun Spicy Shrimp Alfredo and I loved it!  The cajun shrimp on top tasted just like the shrimp in the alfredo and all the peppers and chicken on top of the pizza were a treat.","type":"review","user_id":"eN00PkgPgiw5vcdP44JRIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"qZVNTc39d7mLqWeSFTOHIg","date":"2010-11-15","review_id":"ht0MayLaZ431hbI2pn5uRw","stars":2,"text":"This used to be a franchised coffee shop, and recently opened as an independent.  I certainly like the independent thing, but wasn't too impressed here.\n\nEveryone says the food is great, and the specialty drinks.  But for just coffee?  I think I'll stick with my usuals.  Certainly try the food, it looks impressive on the menu ... wi-fi is free if you're not on VT's network, just ask at the counter for the password.","type":"review","user_id":"d0M3Bx5CfuCBMx4a6yFb2w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"HAXTUHm3RFucIbNZSpIU3A","date":"2011-03-01","review_id":"EbUHIm0i00seGaad6BHpBw","stars":3,"text":"So we came back to try the main dining area. First thing I noticed was the menu was slightly different than what was available on the Franks side and the list of drafts had changed. We ate from the Chefs Table menu, which was a choice of appetizer, salad, and entree for a set price. Everything was pretty good, except the main dish. I'd ordered Jerk Pork, and was expecting something with flavor and seasoning, not a very mild almost tasteless clump of meat. The sides were good, the appetizer was good, and the salad fine. My wife didn't have any complaints or compliments on her main entree, a shrimp pasta. I don't know I want to give them a third try, considering the price.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"vpxUqSMqPJyhTisCDSG1_Q","date":"2010-08-26","review_id":"D6uyZrk63QmyOPcVRjRnHA","stars":2,"text":"OK food but terrible service.  I've been there a few times thinking the service was just off when I was there.  I waited about 45 minutes for a simple sandwich.\n\nBetter restaurants with better food are nearby.","type":"review","user_id":"55Tg9lqX55KmtOQA3TedXQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"mAw6QGWaX2nb50P_M6xZpQ","date":"2010-12-02","review_id":"yDNDWr0K5SAPxkIsAcu1fQ","stars":4,"text":"4 1/2 * \n\nNew bigger location is open, near Lowes  was the old \"Shakers\" .\n\nThey remodeled and have a pleasant place, a small outside drink snack patio too.\n\nSame food, presented nicely, flavorful, has full bar.\nWe had a lunch fish plate, Tiilapia,  with roasted veggies. Also the beef  fajitas were tasty.\n\nService was attentive and friendly, drink refills and lots of chips.\nWe'll be Back.  ~$22 for lunch & 2 drinks before tax and tip","type":"review","user_id":"ryqwddTQViGX6EKgFF_0Cg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"kN6Ai2WOz8dEBC75l77iBg","date":"2011-06-05","review_id":"btaZ2LJnpUQ507jxEpjODw","stars":4,"text":"So... Being from the San Gabriel Valley in CA (where you'll find some of the best Chinese restaurants outside of China) I tend to agree with the previous reviewer, but everything is relative. For one, food in Blacksburg just generally sucks. There really isn't a \"good\" restaurant in town (and by good, I'm coming from a pretentious California food-snob perspective) and that includes Blacksburg's sad attempts at any kind of ethnic cuisine.\n\nChinese food here just isn't great. It's pretty much all Americanized (unless you're able to read the Chinese menu at Charlie's Chinese in Christiansburg) and even for Americanized Chinese, it's not very good. \n\nSo what's good about Double Dragon that I'm willing to give it three stars? Well, it's fast, edible, and fresh-tasting. For the most part, the food isn't terribly bland like most of the food (Asian or otherwise) in the area, and has flavors somewhat approximating Chinese food. \n\nWhat I like: \n-Dumplings in hot chili oil- pretty decent, actually good for the area\n-Beef in scallion sauce- it's got flavor and stuff, so I like it.\n-Orange chicken- tastes like your typical orange chicken, which is a good thing for Blacksburg.\n\nWhat's okay:\n-fried dumplings- get them from Chinese Kitchen, they're much better there.\n-Broccoli in garlic sauce- the garlic sauce is bland, but at least the broccoli tends to be crisp\n-Lo Mein- this is something you don't find so much on the West Coast, but it's kinda like a mushier chow mein. You can probably get it better at other restaurants in the area.\n\nSo... Yeah, do I recommend it? Sure. If you want Chinese-American food, and you're stuck in Blacksburg, this place is totally fine. It's good, even. But if you can hop on the next jet outta Blacksburg and go to a real city with real food, you should do that instead.","type":"review","user_id":"HpKwFDZw5BaWHat_4g-ufA","votes":{"cool":0,"funny":1,"useful":0}},
{"business_id":"zkmYfnGF3WilPsGiIkxYYw","date":"2009-07-24","review_id":"RCGnLtpJWsnvf2r4eFlxdQ","stars":3,"text":"This quality of this place is pretty random. I usually go there for the wings, and occasionally a pizza. Both can be great. The pizza more consistantly so. The wings are hit or miss. A lot of the experience is dependant on the waitress.  I've had some forget I even ordered food, and a couple there have given some of the best service in Blacksburg. The kitchen is pretty spotty too. Overcooked wings with almost no sauce on them, or drowned in sauce are normal. A decent amount of the time though you'll get wings that are done about right. The wait time after an order is placed is completely random. I have waited over an hour for food (in a near empty restaurant). Then other times, even with larger groups, the order is out within minutes. The best part of PK's is the ease of getting large groups in there. It's seat yourself, and while it's usually busy a seat generally doesn't take long to find.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nbJSDQDMPopbVf6ASB8a5w","date":"2010-12-12","review_id":"V9AXwaMxI-gm8crHGapDDQ","stars":4,"text":"If I have a choice between here and outback I generally will come here first. The entree quality is better, the sides are unique. There will be just as long of a wait here than at any other place on the weekend but I think this wait us worth it.","type":"review","user_id":"twISWUMTq7r80UP_s11z3w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"ncZgdBYg2gzGeSLJb2xM0Q","date":"2010-08-22","review_id":"RSdjydy3onWmiuH2c7ueTA","stars":1,"text":"One day I decided to try this buffet instead of the newer Hokkaido buffet on the other side of Kroger. They had far less of a selection than Hokkaido, a lot of the food I wanted was not replenished which limited my selection further (I did arrive a little later on the lunch hours but still, the food that was left was just getting cold and inedible by the minute). \n\nThe last straw was that Hokkaido at least had a free drink with it, Beijing Buffet's price was cheaper but when you add a fountain soda to the deal it became more expensive than Hokkaido. \n\nIf I had to choose one buffet, Hokkaido wins this battle, even though both of them are kind of low quality with the food they use.","type":"review","user_id":"ZPpuU4Kz1SrFTrKDQ9S3AQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"4kR9-F-iooU_l_n2mgSGDw","date":"2009-08-19","review_id":"0_cdc_05oiVpCb6QU6OdKQ","stars":4,"text":"This place is indeed incredible because it has such an amazing selection of beers (and wines too I guess but I'm a beer aficionado). I've walked by as they do tastings, but haven't taken part in any myself.\n\nHowever, in spite of their status as a distributor the beers aren't necessarily cheap. I tend to go and get a bottle or two to try something new, each running around 2-3 bucks. It isn't bad, but you're looking at a college town here, 8-12 bucks for a 6 pack is getting in the pricy range for me. I like how they added beeradvocate ratings to some of their beers, but I would prefer they did more special discounts when possible. \n\nEither way, you won't find a better beer store.","type":"review","user_id":"ZPpuU4Kz1SrFTrKDQ9S3AQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2011-04-12","review_id":"5XiD3MmlatThjNWMcNHQmg","stars":4,"text":"A fun vibe to this place -- it was packed on a Friday night.  The fish tacos are great.  I wasn't too crazy about the corn salsa.  Friendly and competent staff.  Parking is a hassle during busy times.","type":"review","user_id":"1J9O2Hpvlt-wyc3lVZnphQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"5zyibT__dkE21sAyLb1qvA","date":"2009-10-25","review_id":"WcXmKJK76w4Hq8t_zX6RAQ","stars":4,"text":"I think this place gets overlooked sometimes because of it's location, which is a shame.  \n\nThe food here is quite good.  The roasted eggplant sandwich and Lefty's burger (topped with goat cheese, grilled onion, and roasted red peppers) are two of my favorites.  The chips are homemade, and always delicious, as are the onion rings. \n\nI've been here a couple of times for breakfast and it's been enjoyable.  They serve pretty standard fare: eggs, french toast, etc..  It's a nice alternative to Gillie's if you're trying to avoid crowds and/or are craving bacon!  \n\nThey also have a great patio outside!","type":"review","user_id":"TyYKyx5_AJyjyaxQyAVRJQ","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"wk8EiiHeB3TFx0YCOOityA","date":"2011-03-05","review_id":"pq9Zo2Eygk2hyDjgyi6pzQ","stars":1,"text":"I made reservations here.  They asked me to spell my name so they could have it correctly.  We arrived early first to be told that they had given our table away since we weren't there.  After pointing out that we were there, and early, the same person who took the reservation said, \"We really don't take reservations\".\n\n    We did not wait, and I would never, ever go back to this place.","type":"review","user_id":"ViADNWMJLsDd1BEsfe_ZWQ","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"7zDbcbUkafhkanpTE5TQRQ","date":"2011-01-21","review_id":"SUtAh2RR97gGqd64InL1ig","stars":5,"text":"Excellent buffet. Actually has lamb, goat, and several chicken dishes. Wonderful, modern decor and even has linen napkins. Was highly impressed.","type":"review","user_id":"RmrCFrMb8ea4tYrn7Q2K0g","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"KsrMCDF689P4bTBrrbTLjA","date":"2009-08-07","review_id":"aDjTJGizsUAPwnGALe4XTQ","stars":2,"text":"Overall, I was expecting about the same standards as the Rock Bottom chain that I experienced in Bethesda before coming to Blacksburg. Bull and Bones had a lot of potential and fell short in almost all categories both times I have been there.\n\nMOOD: Brewery restaurant feel with the stills, large bar, tall tables and the restaurant half. Both times I have been to the bar areas, as they have a much better wall of TVs that is actually very decent for watching sport events. For this purpose, this may be the best place in Blacksburg to watch games while having a drink and munchies.\n\nSERVICE: Hit or miss. The first time I came was the first week the restaurant opened and my service was terrible enough that I could have gotten a free meal easily (I ordered an appetizer and it took over an hour to get it, to a point that I didn't want it anymore). The second time things were a bit more timely, so I won't hold them being new against them too much. On to what matters:\n\nBEER: They have a regular selection and a seasonal. Many of the regulars taste very similar to each other, I was hoping more experimentation with styles and a stronger selection. Indeed, any of their beers beats the american macros you can get anywhere, but they aren't quite better than something as simple as a guinness or sam adams draft. The stout is quite good, but it isn't very drinkable with food. I suppose the lunch pale ale would be my most balanced choice, but I would prefer Rock Bottom's beer selections. \n\nThe worst part about it is that their happy hour is basically nonexistent. They say they have one, but I haven't seen it yet. The advantage of having a brewery/restaurant is that you can discount your beer, however I haven't paid less than 4.50 for a pint where at Rock Bottom I could get 1.50 pints and cheaper food during the happy hour.  \n\nFOOD: It's pretty standard. I didn't find anything on the menu that stands out at me and makes my mouth water and want to order it, the appetizers were just OK and my burger was overcooked. Also, again I must complain about the lack of a decent happy hour really killing this place for me. \n\nAll in all, if you want to watch sports you can go here or to buffalo wild wings. They have better beer, but it's not worth the extra $$ they charge for it. I won't consider going unless they have 2 dollar pints and cheap nachos, it just doesn't taste good enough to justify spending more at this place.","type":"review","user_id":"ZPpuU4Kz1SrFTrKDQ9S3AQ","votes":{"cool":1,"funny":1,"useful":2}},
{"business_id":"wk8EiiHeB3TFx0YCOOityA","date":"2009-05-04","review_id":"KBEIxboRjL5blaUrR3UQqw","stars":4,"text":"Good Italian food and some creative dishes (freshly made spinach raviolli with lemon cream sauce...yum!). Nice wine stop.","type":"review","user_id":"4c2AjbgLRY2YmW7IlVk3GA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"n24Vn9DpMwDW5e6MPjOnrA","date":"2007-12-05","review_id":"Y2OWhEktjqnGW0pvSp1_vw","stars":5,"text":"Holy cow, is this guy still around?  He used to come around in a truck to the office park by the airport, this was in 1992-1995 or so.  You could get a huge sub for like \"$2.50 American\".  Anyway, I used to eat here all the time.  Thanks for all the cheap meals and great cookies.","type":"review","user_id":"ts70l14EjU2BYBAMZzSKVg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"thlQuACT7g1GQLA-45pfkw","date":"2010-03-13","review_id":"6D6928xjB-MyzP_u3JyoMw","stars":5,"text":"As a Blacksburg native with over 20 years of experience trying all of the Chinese food in town, I believe I can safely say that Chinese Kitchen is, and has always been, my favorite. Cheap, fast, and delicious. Everyone's tastes in Chinese food is different, and you might find other places that have certain dishes you prefer more, but all of my friends and family prefer Chinese Kitchen overall and that's gotta be saying something.","type":"review","user_id":"yHrm6uR3oNalEuO_rrA-gw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"f2ggWe2Lw3cGeA5T7mk_ZA","date":"2010-09-24","review_id":"s6JoLPtbT4W-YZDZgmdIyg","stars":4,"text":"Just opened.  We had the tacos (diabla) and empanadas.  Good stuff.  Best Mexican in town - by a longshot.","type":"review","user_id":"ZkDoFwL9snsobjPKHRfEUg","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"F_ofTZiczPkYZ93JAE3RRQ","date":"2010-03-15","review_id":"4_IB_f0JExRsdigtXmFsJg","stars":2,"text":"tried there few years ago not long after they opened.  was pretty excited about a new thai place opening in blacksburg.  owners were nice and chatty when i visited.\n\nnot sure if anything changed from then ...\n\nbut the food was alright.  the portion was small.  made everything seem overpriced.","type":"review","user_id":"Yy5K-pdVXQUrdk-PrHGzLA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"mAw6QGWaX2nb50P_M6xZpQ","date":"2011-03-28","review_id":"zeU83Uz3oVMfSnkH9Z3zAw","stars":5,"text":"Fast service.  Drink refills kept coming.  The food was good.  The little woman liked it.  No complaints really.","type":"review","user_id":"7JHWmxxSgBCWwlSazOvE3Q","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"tJwomYMNjpd4A31rDMXMCw","date":"2011-04-10","review_id":"WS4ytFxwddpJaRB1Cg0AIA","stars":4,"text":"I've been here a few times for food, and more recently for drinks.  I've had burgers several times- they have some interesting ones you won't find everywhere, like the Crabby Patty with crab dip or the burger with grilled pineapple.  I like my burgers to be juicy so I usually order medium rare, which they have done properly for me a few times, but recently ordered a medium-rare that came out medium-well.  At the same time, a friend ordered medium rare and had his come out with some completely uncooked parts.  So generally good burgers, but maybe hit and miss on having them cooked to your liking.  The basic bar food I've ordered here has been good- I particularly like their onion rings.\n\nAs many reviewers have said, happy hour specials are some of the best in town- $2 doubles, $3 long lsland, $5 pitchers, etc.  And especially if you tip well, they aren't stingy with the liquor, a double comes out quite strong.","type":"review","user_id":"-mqKsujB1jjaq5I9Pa07Fg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Y_HIPFeBEb1V8_eOrZt6wQ","date":"2011-04-17","review_id":"O0_oNC4VwVbq-9R1T33khg","stars":4,"text":"What a great natural foods store. If they don't carry it they'll order it at no extra charge. They carry so much produce from local vendors that it's a great supplement to the farmers market. \n\nI love their cheese counter. They are really knowledgeable about the things they carry. They even carried Evo pet food before Innova bought them....Innova is still good though. Don't forget fresh bagels from Roanoke on Thursday!\n\nI miss Eats and wish it were in KS rather than in VA. Hopefully I'll find something similar here soon.","type":"review","user_id":"XV0OSRMtHp6d7uj5lXOTfw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"dZwZlfR-FZkRmA5D4PtMaA","date":"2010-03-31","review_id":"mvLFbh5lY-CZQ70A8AZ4EQ","stars":4,"text":"I have eaten at Sal's a few times while visiting friends in Blacksburg. Once we dined in and had a full meal, the other two times we called ahead and picked up pizzas. I strongly recommend Sal's pizzas. The sauce is fantastic! We had a plain cheese pizza which was my favorite and a meatlovers(cannot recall the exact name).","type":"review","user_id":"kpA1lId7e6B8Xj1yqBWfXQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"KsrMCDF689P4bTBrrbTLjA","date":"2011-08-08","review_id":"wi7INiHxuI7T_1Kq3KSWqw","stars":4,"text":"Great place. Good Crowd.","type":"review","user_id":"8pPu3KE0WYLJDJVhYrZl3w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"zkmYfnGF3WilPsGiIkxYYw","date":"2011-02-26","review_id":"l2daZtR-b3yyXTDk6YQsRw","stars":4,"text":"This is a great place. I decided on my birthday that I was having a hankering for pizza, and where else, would I go but PK's. Pizza and wings, and I was not disappoint. The wings were pretty yummy and the pizza was delicious. We got it to take out, but short time I spent in the place looked fun.","type":"review","user_id":"twISWUMTq7r80UP_s11z3w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"I5dFvzPt57bb9T7z0Mp-jw","date":"2010-11-30","review_id":"wI9ukt7CSL4fQ7qzSCtVLA","stars":4,"text":"Good pastries and breads for the am.  And nice soups and salads.  Clean and bright.  Good place to visit with someone while having a simple meal.","type":"review","user_id":"N9tgUEYnMvdZSDDAZ46sJg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"PDX3igOBbL_HhUD0ZM-e3Q","date":"2009-08-19","review_id":"Wh1SpgzzdI1A_FeNrdZ8Ig","stars":4,"text":"I'm assuming this place is almost new based on the fact that it wasn't in my GPS or in Yelp's business database.  Oh well, it is now.  :)  This hotel is certainly above average.  The bed feels like sleeping on a cloud.  The fitness center is large and all of the equipment is in great shape.  There is more than ample parking.  The room is quite spacious and the whole place has a rather inviting feel.  The walls seem to keep out noise a bit better than most.  The only real downside I can see is that there's not much of anything within walking distance of this place.  (Granted, If you're in Blacksburg you've probably driven to get here anyway).  Also, there was a bizarre white film over the outside of my window.  Oh well.  It was still a very comfortable stay and I'll be back.","type":"review","user_id":"bE080rkVJZjGF_xjvniwSQ","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"vJFplxoIJO2MLpodACW7Vw","date":"2009-08-29","review_id":"IEAxTFJnLQZ9prpj8P3LPg","stars":1,"text":"Everytime I eat here (all of 4 times), I swear I'll never do it again. The only reason I ate here recently is the kitchen is open late by sit-down restaurant standards and I prefer to avoid fast food. Next time, I'm going anywhere else with food, Sheets if I have to. Or dare I say it, even Applebees. The food is bad, the service is bad, and it's crowded. I don't understand it.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nXXfB3-tIIZczK4byP8JWQ","date":"2008-08-04","review_id":"ij4JB-kmplaNG8R4nCoeAg","stars":2,"text":"Five Guys is better.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"I5dFvzPt57bb9T7z0Mp-jw","date":"2011-03-15","review_id":"iZ_elPebMISsZLJAeDFCyA","stars":4,"text":"Until a year ago, my husband and I never visited this place.  It's in a run-down shopping plaza and we just didn't imagine it would be as good as it turned out.  They have fabulous food for breakfast and lunch and on Saturday mornings they have live music.  For breakfast (we've never been for lunch) they have homemade quiche, strata, strudel, muffins and other baked goods as well as a menu of various egg dishes, french toast, pancakes, etc.  They have many things in a case served cafeteria style or you order off the menu.  They have fresh made coffee, cappuccino's & expresso as well as juices, soda and water in a cooler.  The place is always packed on Saturday morning.  Like I said, it's a place we never visited but once we tried it we always want to go back.","type":"review","user_id":"yvKTjtBaX4Lj6V_KM-DtOQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"3ulgAMrHx6FFvDUMrLInDw","date":"2011-03-22","review_id":"9ouyziwYpSvJzlLFpukSgA","stars":2,"text":"The food here isn't that good at all. The buffet price is nice but every time I go I never eat that much because the food is just not that good.\n\nService is good, the servers constantly come by to remove plates and refill your drink.","type":"review","user_id":"-k2jA8vZus1itFdn4bh5Vw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"76hIZMzHZ_lFM0p2N7_gRQ","date":"2011-08-20","review_id":"7hvuygXl1Zg-HmEiU9QH0g","stars":1,"text":"I've been here a few times and I'm really not sure why I ever go back. It's a Greek and \"Italian\" kind of hybrid restaurant. They occasionally have a cool Southern style band come in and play live music, which is a great cultural experience for someone who's not from the area. They have a very good beer selection and some good value options. Service at this place is pretty nonexistant though. You pretty much seat yourself and if the wait staff happens to notice that you exist then they come and begrudgingly take your order. They rarely ever check up on you to see if you need anything and good luck getting them to bring you a check. Odds are you'll have to flag someone down yourself. They have 1 single unisex bathroom, which isn't exactly kept to the most hygienic of standards. If you want to go and sit at the bar to watch a game -- good luck. No one in that place has any idea as to how to operate their TV. The subtitles have been streaming on the one TV for about a year and half now without sound. It's an issue that the ownership just seems to not notice or ignore. They also seem to have an ant issue, because every time that I sit at the bar I always notice an ant or two stroll by. \n            The first time I went, I ordered the Mousakka, which was a menu special for that particular day. Their's consisted of eggplant, ground beef, cheese, and sausage all sort of layered together. I love all of those ingredients individually so I thought why not. They bring you a plate of it, which is a solid 6 inches thick and was clearly baked in the oven. The result, the interior is ice cold while the tops and sides are piping hot. When I came back months later, I ordered the baked ziti with meatballs, something I had been craving. I was expecting a nice plate of ziti with a few meatballs on top and the whole thing coated with mozzarella cheese. Instead, I get the baked ziti with meatballs Mousakka style! It was a 6 inch thick lasagna looking dish that even had the meatballs inside of it. This time though, I had the opposite issue. The exterior was burnt while the interior was warm. The meatballs were comparable to the ones that you buy at Subway or some lousy sub shop. They are absolutely clueless when it comes to cooking Italian style food or running a restaurant in general.","type":"review","user_id":"4Nb4nr3QYwIrQHTMgz_VGQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X381_JV6xOq3VSsep13GvA","date":"2011-08-31","review_id":"rQ55TJk07z4C46zREuX_AA","stars":2,"text":"Highly hyped by a Va-Tech alum ... cool vibe ... probably fun on game day ... but average sandwiches that weren't cheap or good by any means.","type":"review","user_id":"PvdU2IShXhjTJI5NwIbJwQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2011-07-25","review_id":"5D9NmPCGS09FN-_RLnGVcQ","stars":4,"text":"I went to Gillie's with my buddy when I was visiting him in Blacksburg recently. He suggested it as a good place to grab breakfast, and I'm so glad that he did.\n\nIt has a cool college town vibe to it (including the mostly vegetarian and vegan inspired menu) and getting to sit outside on a beautiful Saturday morning is always a plus.\n\nThere's no meat on the breakfast menu at Gillies, but for me that was no problem. I got the Red Earth, which was two scrambled eggs on a bed of potato's, topped with fresh salsa and served with an airy, homemade buttermilk biscuit. A filling meal to say the least, it was flavorful and fresh without being too much food.\n\nI can see how this place would be a popular joint with the Virginia Tech students when class is in session, an excellent array of interesting food at an affordable price tag that left me satisfied and ready to take on the day.","type":"review","user_id":"YdmYLRU6XHImxjYo5ti3JA","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"nCWZR9NRc2grAwP1jq33PA","date":"2010-03-05","review_id":"gtwYwqobPOpH0hlM-F41rw","stars":5,"text":"the place is a rundown, hole in the wall, dive bar that is well maintained with a great set up, good beer list (rotating lines too), serve car bombs by the dozen, tons of TVS, typical bar food (cheap), and has bartenders with personality.  what more could you ask for?","type":"review","user_id":"9ExoXnok36QG0NmDQ_5Jkg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"hSDRGgXGuX2BtgaIi7qm2w","date":"2011-05-03","review_id":"ihKthU_rqE0rSdsvDsCLnQ","stars":4,"text":"FRESH = Okay, when I say fresh, I'm saying that the sushi is fresh and not the tempura fried rolls you order at every other Americanized sushi restaurant.  So come here if you want actual sushi.\n\nThey make the sushi so you can see them and they have self-serve hot tea.  They have a good selection of different combinations, rolls, and boxes you can get and the rice is sweet.  It's delicious!  I definitely recommend coming here if you're looking for something refreshing.","type":"review","user_id":"eN00PkgPgiw5vcdP44JRIQ","votes":{"cool":0,"funny":0,"useful":2}},
{"business_id":"76hIZMzHZ_lFM0p2N7_gRQ","date":"2010-02-08","review_id":"4-WsPyLMKIaaGxiWSy7wEw","stars":2,"text":"So this place has amazing food and the proportions are huge for great prices.  I especially love their cucumber dip.  It's always fresh and goes well with pita chips or the spanakopitas.  They also have an amazing crap and shrimp dip that is sometimes spicy but good but something not spicy at all.  Not real sure why it's so variable BUT it's always good.\n\nTheir best alcohol deal is Luck of the Draw.  You pay 1$ for a beer of their choosing.  I've always had good beer with this deal.  \n\nOhhhh but man has their service went way downhill.  In the last couple of months, I've had horrible service everytime I went.  They are super super slow.  One night I was downstairs and I was trying for about 45 minutes to pay for my beer.  I must have asked each bartender 5 times to bring the check.  Finally, I just gave up and walked out.  I felt a little guilty for walking out but I didn't have all night to sit there and wait for them to get their act together.  And then most recently our table ordered a pizza, some soup, and cucumber dip with pita bread.  The soup and cucumber dip came out fast, but then all of a sudden we were waiting for 35 minutes to get our pizza.  The server never questioned why the tables that arrives after us were receiving their food before us.  Needless to say, we finally got his attention and said we didn't want the pizza and that we wanted the checks.  So we told him which food belonged to which people and which card to charge.  He got this wrong and charged the wrong amounts on each card.\n\nI'm not so sure if I'll be going back.  It just seems like they need new managers or something to fix the service.","type":"review","user_id":"YXiToBAhXFXV-kpeV81qkA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"cE96KgmjaqZaraGOIVaHJw","date":"2009-07-17","review_id":"FA1KLu5noxxkwnc2YlM3lw","stars":1,"text":"This place gets worse with every visit. The menu changes don't help.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3juObN8h-4AZfaxLDhPtQw","date":"2011-09-18","review_id":"SM_aQUUh5MP4ycNIhqO-OA","stars":2,"text":"It's a really small bar and it gets really packed on weekends, the music sucks, typical college crowd, and its really hard to get a drink because the bar is so crowded. The drinks however are strong and cheap.","type":"review","user_id":"TrVUihRXTCr3WpfIGFP4dQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rXGioez8wVRBwJXJoBj9LQ","date":"2010-04-04","review_id":"fRR3fdkBZxLQlFb9YgHTCg","stars":5,"text":"This was my all time favorite when I went to Tech.  The food is delicious and the price wasn't bad.  You get roughly the same quality of food that you would at Kabuki's, which is a fancy Japanese steakhouse for less than half the price.  It's not really authentic Japanese food but it's not too terribly over Americanized either.  The food is downright addictive.  If you're in the area you should definitely give this place a try.","type":"review","user_id":"nWT3tYZYFoKPUXSHYYhuLQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"hSDRGgXGuX2BtgaIi7qm2w","date":"2011-07-11","review_id":"yYFZVs9FBp5_BSultjfByg","stars":3,"text":"Fair sushi for fair prices. Good for a quick sushi meal on the go. For when you don't feel like sitting down and spending an hour eating sushi.","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2010-09-07","review_id":"a1hji4fj_UK9Tu3fC4sC-w","stars":4,"text":"Feeling lazy.\n\nBottom Line:  Don't bother coming here unless it's for breakfast/brunch.  Every time I come here I order an omelette (it's made with 3 whole eggs, and stuffed full of 3 choices of fillings or you could get one off the menu) and it comes loaded with a heaping pile of crunchy-on-the-outside, chewy-on-the-inside delicious hash browns and the largest biscuit I have ever had in my life (come early or they run out of biscuits and give you honey texas toast, the biscuit was huge, like about the size of a softball).  \n\nAll of that is about $8-9, a bargain if you consider how high-quality the ingredients that go into the food are and how wonderfully and exact it's prepared.\n\nGo there in the morning when you're hungover, the hash browns alone will cure you.","type":"review","user_id":"zNV3YeyLDsfN16j9d5lzrA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"zkmYfnGF3WilPsGiIkxYYw","date":"2011-08-06","review_id":"P8UM0ChL_EikLini6Alv6w","stars":1,"text":"Having gone to PK's recently while visiting some friends and family in Blacksburg, I don't believe that I would plan my return visit to the restaurant anytime soon.\n\nIt seems like a decent sports bar-ish place, where you could go have a beer with some buddies and check out a football or basketball game, but the food really left a lot to be desired.\n\nWhen I first walked in, I tried to look around at some of the other tables to see what people were getting and what might be worth a try. Seems like pizza or wings is the thing to get here. I went with the pizza. It fell flat for me.\n\nI tried two of their speciality pies by the slice, the California pizza (with spinach, artichoke hearts and feta cheese) and the Garden Patch Pizza (with mushrooms, onions, green pepper, tomatoes and black olives). While the toppings sound like something that I would enjoy eating, they didn't taste all that fresh and there wasn't nearly enough of them to feel like I was getting the proper flavor from all of the veggies.\n\nAnother strike against PK's, their crust had a horrendous texture. Very tough and chewy, it took some major arm muscles to cut into with a knife and then even more effort to chew it all up. Overall not a great experience.\n\nI enjoyed the company, and sitting around with my family catching up on everyone's lives, but could have done without the food. There seems to be a lot more places around Blacksburg that would trump PK's any day of the week.","type":"review","user_id":"YdmYLRU6XHImxjYo5ti3JA","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"8gd212vWAszoQ4P40uBlmQ","date":"2011-01-11","review_id":"ujkBSuf8InBzozdAYXUxXA","stars":5,"text":"This store is a real shocker (and godsend) in the sea of dumb college bs that dominates Blacksburg. It's the one place that caters to tastes not involving Hokies football or Gossip Girl, and it's the sole spot in town where I felt anything close to home. If the subculture is your kind of culture, from goth to pin up to psychobilly domestic goddess, Xanadu is Blacksburg's lone answer.","type":"review","user_id":"FCwz8ZjUD0T_n1tEysp75g","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X7SaMeMdYa76zmavVc2YUA","date":"2011-04-21","review_id":"7vBrlSyyni_nTjVqXM8COg","stars":3,"text":"It's a college BW's, so it's going to be noisy and crowded most of the time. Even so, it took a good bit of time for my group to be seated, and we  were a party of three. The wings were okay enough, but in the case of my honey bbq wings, it looked like the sauce had been applied with a spritzer. Chances are, you know what you're going to get if you come here, but just know that this isn't the best BW's out there.","type":"review","user_id":"VH5pKCf64byq4k4RgV-buw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"0MlzKv-ExET2wV73hr-fsg","date":"2011-07-11","review_id":"WD1k1v2ZYoB8NU3S9phntA","stars":5,"text":"This kroger has all of the basic groceries that university mall kroger has and more! I don't shop anywhere else when I'm in Blacksburg.","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"NLfQp6SUK9vwv3WNURbjIg","date":"2010-11-30","review_id":"g2b3cBlydoLMJ4xJeujAzg","stars":5,"text":"To the people who are reviewing Gumby's like it's a fine dining restaurant: really?!\n\nThis place is an institution at Tech. Drunkenly shoveling hot pokey sticks into my mouth surrounds some of my finest, but murky memories in the Burg.\n\nIt's not the best ingredients, it's not finely seasoned by an artisan chef. It's freaking pokey sticks and you eat them late at night when it's 5 degrees outside and you've just come home from the bar after a 34-0 win over UVA and 8 hours of tailgating in the cold.","type":"review","user_id":"DguVfhEhr7a_XzVEXZVXrw","votes":{"cool":0,"funny":1,"useful":2}},
{"business_id":"wk8EiiHeB3TFx0YCOOityA","date":"2011-03-15","review_id":"oALx0fykhrKVeWTWrVr6Qg","stars":3,"text":"I liked this place and will return.  However, I wouldn't call it  great and I'm not dying to go back.  The service was nice and the meal was good.  The decor is simple but clean and they have a wine shop.  It's not what I would call good quality Italian and I felt that their website makes it out to be more than it really is.  But, it's decent and I would recommend that you at least try it.","type":"review","user_id":"yvKTjtBaX4Lj6V_KM-DtOQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"tpaVWvFqb08iv4_RgzDkjQ","date":"2011-02-21","review_id":"gwAPNCZcbSsbBTmHwO25wQ","stars":5,"text":"I think this is probably the best sushi establishment in Blacksburg.  I use to come here multiple times a week.  Their special rolls are to die for and they have a lunch special called the \"power lunch,\" that is amazing.  Their power lunch is not on the menu, but it is a spicy tuna roll, deep fried, with spicy mayo and eel sauce on top, it comes with soup and salad and is only $7-8.\n\nI use to come here every Monday for their half price rolls, usually the Crunch roll and salmon rolls.  I would recommend trying many of their other special rolls, like the Wild Cat, Dynamite, Phoenix Tail, Gold Point, and Four Seasons.  The safe is always really nice there, they will hand you a hot towel when you are seated, and just always courteous.","type":"review","user_id":"cwvH-kvUqE4UhlVdyL_BbQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X381_JV6xOq3VSsep13GvA","date":"2010-04-04","review_id":"bDYFQXkVgCP2F1mcBq5ZUw","stars":4,"text":"It has a unique atmosphere with all the crazy decorations and the food is pretty good.  The menu consists primarily of sandwiches but they have other things like wings, pastas, and salads.  The best day to go is on Mondays when they have their wings and half price Hindy nights.  It's great for 2 to 4 people.  I would go with my husband and order 20 teriyaki wings and a Hindy, then take half the sandwich home for later.  Otherwise I'd recommend the Brooklyn Bridge if you're a meat lover.  Overall good food, good service and fun atmosphere.","type":"review","user_id":"nWT3tYZYFoKPUXSHYYhuLQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"p-YvmgcTcpzNS44SSV-26g","date":"2011-02-07","review_id":"VGvdnTpEK58B-GRCDugokQ","stars":5,"text":"(Wow, I have never seen an overall rating for a business be so wrong! 2 stars is absurd.)\n\nThe Chocolate Spike is one of my favorite places anywhere to get handmade chocolate and it's right HERE in Blacksburg! I imagine if you came here looking for a cafe you would be disappointed, but this is a chocolate shop. It's true that the shop lost some of it's charm when it moved from downtown, but I am sure they do better business where they are now and I can't really begrudge them the move.\n\nThings I love from the Chocolate Spike:\n- Chocolate covered candied fruits (especially orange peel)\n- Truffles \n- Plain dark chocolate or bittersweet bits that you purchase by weight. \n\nThe selection of chocolate and chocolate cover goodness is extensive, but the basics do not suffer because of it. \n\nThe prices are good for homemade chocolate. The chocolate is excellent quality. Buy some for yourself, your sweetheart, your mom, your officemates... they will love you for it!","type":"review","user_id":"Of1gS4IfNhszA8tn6KNLXQ","votes":{"cool":0,"funny":0,"useful":2}},
{"business_id":"aJMJiCDrj1RsNxWlVTe_fA","date":"2011-01-10","review_id":"9V7r_KxrkqjuxSh2FOENoQ","stars":5,"text":"Always have good food here.  They prep all fresh veggies everyday. Managers and servers are nice","type":"review","user_id":"CHsmNK9m_RxKf8BjH6mVkQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3juObN8h-4AZfaxLDhPtQw","date":"2011-01-07","review_id":"FaIfjJS8IHOUr2rSkC_q8w","stars":3,"text":"This is what you expect from a typical college sports bar. Downstairs has a few pool tables and allows smoking.","type":"review","user_id":"twISWUMTq7r80UP_s11z3w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2011-06-15","review_id":"FxY5MGgabvQwP-X-OA9KlQ","stars":1,"text":"Terrible food, terrible restaurant!\n\nEven when I adjust my score for Blacksburg, I hate this place. Folks who like it here have probably never had a real fish taco before. The food reminds me of my undergrad dining hall version of fish tacos, and that was actually much better (it might've helped I'm from California).\n\nThis place is too pricey for what it is, and it's not a lot. You get a few small pieces of fish covered in an awful white sauce that, despite being bland managed to hide the taste of the fish, and not in a good way. \n\nNot recommended.","type":"review","user_id":"HpKwFDZw5BaWHat_4g-ufA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"hWoT61c8id5vIsxlP618nQ","date":"2007-07-03","review_id":"FhweSjCkzVDGbQibRIZ4CA","stars":4,"text":"Despite my dislike of the frat guys and \"oh my God!\" sorority girls that are in the place, I do enjoy a bit of TOTs. If you head there with your friends you'll definitely run into a lot of people you know. If you don't know anyone there and realize the night may not be as fun as planned, just order a couple of Rails and you'll be talking to everyone in the bar by the end of the night. The Rail is a bit steep in terms of price but you really only need one or two to make you the happiest man or woman on the Earth. Its packed on football weekends and the karaoke nights are always fun. There's usually a two dollar cover or something near that, but I think its def. worth it.","type":"review","user_id":"8k4y8CvcC5oL-rKFMxHb0g","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"G_GPyXy1k9yA3njUJpW55g","date":"2009-08-22","review_id":"JwjqSL1aj4SOWI89W-uMNA","stars":4,"text":"Only ever ate at the sushi location and during winter break when they were experimenting with the menu...wow, it was so good. Service was great too.","type":"review","user_id":"4c2AjbgLRY2YmW7IlVk3GA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"vpxUqSMqPJyhTisCDSG1_Q","date":"2010-08-16","review_id":"VH86bXCCntAJSuRfeXkSFw","stars":4,"text":"How I found out about this place: On the main strip of Blacksburg, the college town of Virginia Tech.\n\nWhy I came here: Lots of recommendations from friends, a really nice break from just eating the same American food all the time.\n\nThat said, this place is a pretty casual Mediterranean place in a small college town.  Once you walk in you notice all of the crazy artwork on the ceiling tiles of the entire restaurant, many of them designed by local students and artists.  The menu has many of your traditional Lebanese/Mediterranean staples like Falafel, baba ghanoush, gyros, etc, as well as calzones and pizzas and hot-submarine sandwiches.  I felt since this place was known for their Mediterranean food I'd go for that, asked the waiter what in his opinion was the best on the menu and he recommended their 'mixed-grill' platter.\n\nThis included:\n-2 skewers of mixed seasoned chicken and steak and various veggies\n-a pita the size of a barstool seat (im not kidding)\n-a good size pile of hummus with olive oil and paprika\n-a salad made with romaine\n\nThe meat was extremely well seasoned and juicy, the pita was fresh from the oven and hot, the hummus was tangy and went well with everything, and the salad was made with romaine as opposed to worthless iceberg.\n\nAll of this was $9.95!!  I can't stress enough that this is THE BEST value in Blacksburg in my opinion.  \n\nBottom Line: This place has your standard Mediterranean/Lebanese fair and knows how to do it well.  The service is a little slow, but is totally worth the wait when your food comes.  The value of the meal I ordered is unbeatable, I cannot vouch for the rest of the menu.  A nice break from the hamburgers and french fries and subs that Blacksburg normally offers.","type":"review","user_id":"zNV3YeyLDsfN16j9d5lzrA","votes":{"cool":0,"funny":0,"useful":2}},
{"business_id":"nCWZR9NRc2grAwP1jq33PA","date":"2009-09-06","review_id":"CfOur9xaQAACwjWO4_8sJA","stars":4,"text":"I'm very happy to see that Rivermill is receiving a lot of good reviews here.  This is for good reason.  \n\nI've been going to Rivermill for a few years occasionally but recently started to heavily frequent this bar.  Rivermill has one of the best beer selections in town with over 20 beers on tap with some great happy hour deals.  Bartenders themselves are incredibly friendly.\n\nThe crowd varies quite a bit depending on the night.\n\nFor the first time tonight I had their food.  I can't speak much to it since it was my first time and all I got was a grilled cheese with chips but I will say the food quality was really good and that the menu has a lot of potential and the pricing is perfect.  I will definitely be exploring more of the menu in future visits.\n\nOverall, great beer, good food, good atmosphere.  Must go.","type":"review","user_id":"1V38sXUk6_Y78xa7MCqMIQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"vJFplxoIJO2MLpodACW7Vw","date":"2010-03-15","review_id":"pDHGXLHPEMCR4ENI59wQ3Q","stars":2,"text":"2.5 stars\n\nthe place is alright.  food is about average.  it's like any other chain restaurants.  service can be slow.\nalthough they can accommodate large groups of parties ... their service is slow ...","type":"review","user_id":"Yy5K-pdVXQUrdk-PrHGzLA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"PBZCrvjHasay0wqqI58IxA","date":"2008-08-04","review_id":"60F6ySqIrOx_dUY3Pjkphg","stars":5,"text":"The best sushi and best Japanese in the NRV. Much better prices than Poor Billy's or Kabuki's and better food. Only negative is no beer or wine.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rO-I1eS_92gzFkclW2ZvNg","date":"2010-06-21","review_id":"9mjg4O6KVpHgUq9f4BhQYQ","stars":3,"text":"Great coffee and great pastries--when they want them to be. When they have a decent selection of pastries, they are just killer. But often times I go in and there's hardly any selection and what they have is very limited and hardly appealing. The coffee is always great and the atmosphere is fun. Great place to sit and do homework or read--if you can get a table. Its small and popular, so good luck finding a place to sit on the weekends.\n\nOh and its cash only. Fail.\n\nAlso, the hipster crowd there is pretty hilarious. And if you don't like cigarette smoke, be sure to sit near the back because they leave the door open and if anyone is sitting outside on the bench smoking it just wafts right in. Gross.\n\n\nThe pumpkin chocolate chip muffin is their BEST pastry by far. Absolutely the best I've ever had--so moist and epicly good. If only they had it available more consistently....sigh.","type":"review","user_id":"0vz1kjUpqUWJ6C7Bh8IrMw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3juObN8h-4AZfaxLDhPtQw","date":"2008-08-04","review_id":"MwOYKNPrHLBF4WS_Zc7sDw","stars":3,"text":"This place has trivia, which is a bonus and earns it a fourth star. The food is the same as every other Americana bar downtown, where none of them stand out. \n\nThis place has the extremely annoying habit of requiring you to put big nasty permanent ink marks on your hand if you are over 21. I hate that shit, give us a bracelet.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"76hIZMzHZ_lFM0p2N7_gRQ","date":"2010-01-03","review_id":"JQ8Hs4DA25wFr5jr1vwF7g","stars":3,"text":"great beer list and happy hour specials.  the servers are busy, but generally attentive.  great pita wedges too!","type":"review","user_id":"Pw3BjgqG0mxC76jc_LsscQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"CfwAg7i_tEVLXwPtEgxung","date":"2008-06-20","review_id":"gOtfo5nBYO-5x1MnEkQFBQ","stars":4,"text":"I'm not much of a mountain biker, but I became a bike-commuter in college (UC DAVIS--bike capital of the US) and carried the habit with me through grad school (Virginia Tech).\n\nSO when i first moved to the burg, I found out there are only 2 bike shops in town.  I chose to check out east coasters since it was closer to our townhouse.  The staff was super helpful in giving suggestions of what bikes would be good options for me.  I felt like a little kid taking test rides in their parking lot, since this was my first new bike since middle school!  Afterwards, they made sure all the gears/chains and stuff were in good shape and asked if I needed a water bottle holder and/or kickstand to be installed.  Within a couple hours of chatting with the staff and testing out bikes in the parking lot, I left with a shiny new red trek.  Something in the 3-series.\n\nIt's 4 years later and I still really like my bike.  It's still a good bike to ride around the city with.  I'm glad east coasters was so close to my townhouse, else who knows what the bike shop downtown would have sold me!!!","type":"review","user_id":"5m-p2ddJBi4nIXWSglVGEQ","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"rXGioez8wVRBwJXJoBj9LQ","date":"2009-09-07","review_id":"TzaQPM2MFsRpjeq24F8Eyg","stars":3,"text":"I was expecting more from this place after reading about it. Both in flavor and in portions.  I found myself hungry again not long after eating here, and I could not taste the teriyaki in my meal. I will say the steak was cooked nicely and was tender, not some low grade shoe leather you'd expect from a place like this. It's a decent lunch spot, I suppose, but it's a bit steep at almost  $10 a person.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"ZhwZCCBVmzwumpO8M27gIg","date":"2008-03-07","review_id":"xIXKyojYdBb-0v5G-MhEVw","stars":5,"text":"I love this place.\n\nGreat location and great selection.  The staff is really knowledgeable and always have good recommendations for your tastes.  They will even let you listen to any CD before you buy it.\n\nMake sure to check out the listening stations each week.  They do a nice job putting up cool new tunes.  You are destined to find something awesome and obscure.","type":"review","user_id":"BBznrftC_2RYzK7nc2lHGQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"thlQuACT7g1GQLA-45pfkw","date":"2009-01-06","review_id":"tcFwnthmqhONVuJ_ySaQ-g","stars":4,"text":"This place is one of the better Chinese takeout places in Blacksburg.  The guy who takes the orders is really friendly and nice.  Huge portions and very reasonably priced.  If you want Chinese in Blacksburg, this is the place.","type":"review","user_id":"1V38sXUk6_Y78xa7MCqMIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"hIl5mwJaGY1P95pf8cKciA","date":"2010-08-18","review_id":"dkbpWQ4ZUyMq2aL-6HJtBw","stars":5,"text":"Great local donut shop.  My son and I had a regular thing to stop in after swim lessons each Saturday morning.  I miss that and he does too!  This place is classic and has donuts that can't be beat.","type":"review","user_id":"4c2AjbgLRY2YmW7IlVk3GA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2008-10-11","review_id":"t_PFB6LkYpcdE7eJfUtjIQ","stars":3,"text":"I wish I could give it 3.5 stars since this place is a little out of the ordinary. The food is a little above average but lacks good flavor. It's mostly fresh but not much imagination put into it. It's too much of a college bar to be a good quality restaurant but the tequila list is decent. The margaritas are also slightly above average but better than most in the area. They do use mix in the drinks but it's better than most other places that use mix. If you're drink comes out bright green it's as fake as a UVA football fan. Go ahead and squeeze a lime into a glass, it's not very green. Nobody needs that artificial crap in your body, just demand more out of a restaurant. The corn salsa is decent but takes quite a bit of Tapatio to get it anywhere near spicy enough. The service is usually pretty decent despite the drunk dudes occasionally trying to make their night miserable. \n\nThe restaurant is what it is though, a decent college bar with slightly better food than the rest. It has a lot of potential to have great food and drinks but is a great change of pace in Blacksburg.","type":"review","user_id":"ZR6P3FXCz8719U2oul0zkA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2011-08-20","review_id":"je98HgyUTA-2EpxlEDgH9Q","stars":4,"text":"BRUNCH! \n\nusually a long wait but totally worth it","type":"review","user_id":"r0jUD2_g-p57HjCA0hpA1g","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X381_JV6xOq3VSsep13GvA","date":"2009-12-13","review_id":"DQf6mY2ozC4GQITeh3H3Iw","stars":3,"text":"A college town sandwich place that has a unique interior. They menu is vast with all kinds of sandwiches. \n\nCaution for the hungry people - The meat on the sandwiches has been steadily declining for years...either that or I'm getting bigger (Oh! maybe both :-)) There have been times when I've ordered double meat on the sandwich just so I wouldn't leave hungry. \n\nThe Hindy is the biggest sandwich but watch out for the Monday 1/2 price sale on it. They charge you half because they cut the amount of meat on the sandwich by half. \n\nOrder yourself some extra onion dip with you sandwich to take care of some of the chips!","type":"review","user_id":"7MI0oX7_fTwjU5NML80jsw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"j3lZQs0YKMDAwKSbDRNY7Q","date":"2011-09-07","review_id":"3DluwpYCs9yOL0VRS0PIEg","stars":4,"text":"O-Pass is a cute little restaurant inside a mini-mall. I tried the Chicken Katsu platter, which was amazing. I don't usually like chicken katsu, but I have to admit, this was fantastic. Very flavorful! I can't say enough good things about the chicken katsu. The platter also included miso soup (piping hot!), rice, potato salad, a regular salad and an.. egg.. thing. I also ordered a bubble tea. The total for the platter and bubble tea came out to less than $10, which was very reasonable.\n\nThe bubble tea was certainly decent and I was pleased by the variety of flavors. I ultimately decided on a passion fruit flavor. The flavor was great, but the tapioca bubbles themselves were really small and very chewy (it's hard to explain, but it wasn't the nice soft chewy flavor. They were more of a hardened chewy). I personally was not a fan of the bubbles, but that's more personal preference.\n\nThe service was a little weird. The women behind the counters seemed impatient that we didn't know what we wanted right upon walking in and they just seemed aggravated they had to stop their conversation to take our orders. \n\nI really liked O-Pass and I would return again just for the chicken katsu!","type":"review","user_id":"AclSvnWzSk_GKOPZ2LCE8Q","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"__EmsZiRXiUmljbfpOqZig","date":"2010-01-19","review_id":"z1gRPQOaWk71BK11-gG5uw","stars":1,"text":"Yep, it's awful allright.  The food appears to be pre-packaged and reheated.  The service is horrible.  The place is filthy.  I've been to other awful arthur's and this one \nappears to be the bastard stepchild.\n\nI've tried to like it and went back 2 more times.  I got a shrimp salad with salty tortilla chips (really?) and balsamic dressing.  What someone was smoking that they thought these items went together is a mystery to me.  I asked for a \"dark beer\" and the waitress said, \"we have Juengling\" - needless to say....one star for this place is a STRETCH!","type":"review","user_id":"Pw3BjgqG0mxC76jc_LsscQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"n24Vn9DpMwDW5e6MPjOnrA","date":"2008-11-26","review_id":"WFEP6jGUwFVGy8Bje48YPA","stars":5,"text":"Everything Tim M. said, but get the tomato on your double mini me.\n\nI've had many things off the menu, and spoiler alert, they're all hits.\n\nThe double Mini Me is the way to go.\n\nSeating can be cramp, so don't expect to roll in with your entire fraternity and chum it up...\n\nThis place is amazing.","type":"review","user_id":"fJBmDZ4iDZW6f54RWnWFFA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"B1yzS_JFgWxQVHsqQp-d7g","date":"2009-01-29","review_id":"xsv5ZJOum9kI4SM1kO_0fQ","stars":1,"text":"I abhorred this abomination of a Japanese restaurant during my time as a student at Virginia Tech. It is mainly there for the entertainment, and the food is too buttery and not authentic Japanese food at all! The dining experience is really not worth the overpriced menu. But that is how I view hibachi grills in general, just there to lure in ignorant Americans with their pseudo-Japanese cuisine and flashy tricks with fire.\n\nIf you want to pay $20+ for a lousy meal and get shrimp thrown at you, then by all means, go dine at Kabuki.","type":"review","user_id":"MGY9Z55I5o7X-8XT0QqOxQ","votes":{"cool":0,"funny":1,"useful":0}},
{"business_id":"-QNnL7C_z7NxiCarq3VZTQ","date":"2009-11-06","review_id":"lON3olgEXoY6eoBBEWAc2g","stars":4,"text":"I do not attest to the authenticity of the Greek cuisine, nor the quality of the atmosphere. What can say is that Mike, the owner, makes it work. The restaurant is exceptionally well run, sometimes you go in there during a busy lunch hour and at most there are three people running the entire place! That is cooking, serving and running the cashier. It's exceptionally well run. You will also notice that he has a limited number of ingredients, but they are well utilized to make good food. It is what it is, but you'll often see me in there, enjoying a gyro, grilled pita and orangina. A quick and tasty lunch option in the 'burg.","type":"review","user_id":"UBAgJG4nVDG4B6yQw3twfA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3juObN8h-4AZfaxLDhPtQw","date":"2010-03-30","review_id":"t0AXLvZLc69p-BNiyClVvA","stars":3,"text":"It's definitely a college bar, but then... in Blacksburg what bar isn't decorated with Hokie colors whether it be on the patrons or the walls? I met some friends in the upstairs section of Champs to catch up, enjoy some drinks and almost win at shuffle board. I'm not typically a fan of college bars, but it wasn't as obnoxious as college bars could be. Spring break may have facilitated that. Either way, the service was great and there were no hitches in the evening. A solid sports/college bar.","type":"review","user_id":"gtKhPN62qTI8Lyuqc9ESag","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"5zyibT__dkE21sAyLb1qvA","date":"2010-08-03","review_id":"0l5gu-ReeO2mvwFT-BD1xw","stars":4,"text":"Lefty's is easily passed by. It wasn't until recently that I started to revisit them, I had forgotten how good the food is. Nothing on the menu really stands out, but it's more interesting then your average burger joint. They've got a pretty good breakfast too, it's worth getting up early for on the weekends anyway. The wait staff is typical of Blacksburg. On my last visit, I ordered one thing and received another. I didn't raise a fuss, the food was good anyway, and I got to try something I normally wouldn't have ordered.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"NLfQp6SUK9vwv3WNURbjIg","date":"2007-10-16","review_id":"hVgeGU0biNK0KFYQOGKmbg","stars":4,"text":"I don't know why the only post for Gumby's is a bad one. NOBODY gets the pizza here! You only get it if your goal is to NOT feel like a worthwhile human being.\n\nThis place is all about the pokey sticks... and they are DELICIOUS! Delicious as in you drink just so you can rush home and drunkenly call them 10 minutes before they close. Delicious as in you will cross a tundra (or the drillfield for those of us who go to VT) if a box of these is waiting for you on the other side. So delicious you'd give up you first child so you can have the last pokey stick in the box. They are amazing and becuase they are sold at Gumby's I give them 4 stars... and also because you can order them on campusfood.com. Minus one star for selling anything OTHER than pokey sticks.","type":"review","user_id":"dvAXqNtZHuxLgTIyTC4omQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2010-09-05","review_id":"5WPb684xZJJrS6KUkV9O2w","stars":4,"text":"Follies is good and unique semi-vegetarian cuisine.  I haven't been there in a couple of months but they've always had th best breakfast in town.  Good biscuits, good yogurt or scrambled eggs, good potatoes but the coffee - not so much.  This last is surprising since the same people own a nice coffee shop.\n\nService is okay but variable.  I've never had an insulting waitress though in all my 15 plus years of eating there.  The reviewers who complain about insulting service and bad food must have a hidden agenda.  Cleanliness is just fine.  Believe me, I've seen way worse (Sycamore).\n\nThe atmosphere is college liberal which is what you'd expect in Blacksburg at a veggie restaurant.  Again, the peoplebwho didn't like this must have a hidden or neocon agenda.  We don're need them though, do we?  NO!\n\nSo, very good breakfast served a relaxed pace.\n\nDinner I've had here @ five times.  It costs much Kremlin but has always been very good.  It's been a few years so I can't rate them on it.\n\nOverall, four stars for very good food and the best biscuits in town.\n\nPrice is good if you keep to simple fair such as the 122 with tofu.","type":"review","user_id":"VVzG_2ZQg63rOBfBkS6VLA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"n24Vn9DpMwDW5e6MPjOnrA","date":"2008-12-01","review_id":"M6a6UbD9zkz8_HKkLuNN4g","stars":3,"text":"the sandwiches here are a little skimpy.  i would suggest the expensive sandwich.  i forget what it's called but it has twice the meat as all the rest.","type":"review","user_id":"3zWYE-sXRgbT6pHzGo8LNw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2009-07-20","review_id":"XM0ahKbFt4yi-asvmNbKMA","stars":3,"text":"The food and atmosphere here were absolutely great.  It was indeed all that the folks said it would be like. I had my first real \"southern grits\" here and it was surprisingly pleasant to eat... especially with a lot of butter!.  I also had a spinach and cheese omellete that was very well prepared.  My only grip is that the place was packed.  It was Sunday morning brunch, so it was no surprise.  So my party had to be wedged in the back.","type":"review","user_id":"uLthrQwJFUYvfNzsB45iHA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"hWoT61c8id5vIsxlP618nQ","date":"2010-12-01","review_id":"8NIQq4dtCGeknCF3uYk7jw","stars":2,"text":"The infamous aspect of this bar is the Rail which is worth it if your goal is to get hammered, but there is no other reason to come here if your not into the Greek crowds and want to fight a huge crowd and talk too loud.","type":"review","user_id":"jGvxxmxEolyBn6uAhsKAhg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nCWZR9NRc2grAwP1jq33PA","date":"2010-06-17","review_id":"R6BE52-YtQZY0zrvtr2DFA","stars":5,"text":"Great bar with good burgers tots and tons of beer. Chill scene with good happy hour deals","type":"review","user_id":"9FYDtoHxARMfWDF9lzaurQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"NLfQp6SUK9vwv3WNURbjIg","date":"2011-09-18","review_id":"k0r8ySdWw5B792XSMqxYbg","stars":4,"text":"I love the pokey stix, they are so flavorful. The food here is cheap and the portions are great. After a night of partying, this place is a must.","type":"review","user_id":"TrVUihRXTCr3WpfIGFP4dQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2009-11-30","review_id":"y5mh1FRvK4jLsjHJNsmwAw","stars":4,"text":"Great menu, though it is quite repetative if you go more than once a month. Best breakfast is on the weekends. Good specials. Slow service but good atmosphere.","type":"review","user_id":"_v9J4gRv_0q_ocYtZKm22w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"4kR9-F-iooU_l_n2mgSGDw","date":"2010-07-28","review_id":"_5lUvZ64FaagRKL3mlIbaA","stars":2,"text":"Best place in town to find some new beers to try.   The prices for the beer are very inflated.  I also get the impression that the staff are more concerned about wine than beer.  Employees are more than willing to help you pick out a wine, but ask them to pick out a beer and they look like you told them to go out back and shoot old yeller.","type":"review","user_id":"bN413avBeTgOIR7gdORjvQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"hIl5mwJaGY1P95pf8cKciA","date":"2010-03-13","review_id":"-ea7yyDwqMo8YJpInKHpYg","stars":3,"text":"3.5 stars!\n\nonly tried their donuts before.  fresh donuts made daily! there's something about fresh donuts that just taste better than grocery store donuts.  you should try to get there earlier in the day, or else you might end up getting donuts with limited selection.\n\ncash only!","type":"review","user_id":"Yy5K-pdVXQUrdk-PrHGzLA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"wk8EiiHeB3TFx0YCOOityA","date":"2008-08-23","review_id":"jj5fBzJFfvLvjm2y1730XQ","stars":4,"text":"I think this is the best Italian in the New River that I have tried and I love that you can bring any wine from their wine shop directly to your table for only a $2 fee.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2008-12-01","review_id":"WXXhY31tYp0suAdU3YHM8A","stars":4,"text":"nothing beats el rods for cheap good mexican food.  i've never had a margarita from there even though everyone around me gets them.  personally, i like the huge beer that you almost need two hands to pick up.  it's a good place to drink and eat (with some hot college girls to look at between).","type":"review","user_id":"3zWYE-sXRgbT6pHzGo8LNw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rApUugTXL6kg1DIosUhDUQ","date":"2009-11-28","review_id":"9DkTzSiykePcWkWzORhY2A","stars":4,"text":"the first time we went to fosters, it was horrible.  i'm glad we tried it again.  there is a new, imaginative menu, the service was superb and the atmosphere was comfortable.  will definitely go back.  food isn't anything to write home about..but for blacksburg, it's great.","type":"review","user_id":"Pw3BjgqG0mxC76jc_LsscQ","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"G_GPyXy1k9yA3njUJpW55g","date":"2008-05-09","review_id":"6rQuft5YDSHNwqc4fpK7Gw","stars":2,"text":"I have been to Poor Billy's main restaurant twice and their sushi-only location once.  Both times I have been to Poor Billy's main restaurant I was extremely disappointed with the wait time.  When the restaurant is crowded they only ever have two sushi chefs working who are not true sushi chefs at all.  The wait time on sushi is horrendous!  The last time I was at the main restaurant for sushi we waited 1 hour and 45 minutes.  Those who didn't get sushi got their food delivered first and finished still before the sushi arrived.  Even the non-sushi items are sub-par!  Don't be fooled by the atmosphere; the food is not good and the service is SLOOOW.","type":"review","user_id":"1V38sXUk6_Y78xa7MCqMIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X381_JV6xOq3VSsep13GvA","date":"2011-06-21","review_id":"Yr9ScZNm5cDZFJC52h6-9g","stars":5,"text":"Great wings, sandwiches and kool aid","type":"review","user_id":"TrVUihRXTCr3WpfIGFP4dQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"B1yzS_JFgWxQVHsqQp-d7g","date":"2010-04-04","review_id":"Lk2yQUlvahuPzHXO_faTxQ","stars":3,"text":"This is a pretty standard Japanese Steak House.  The food is highly Americanized but it tastes good.  You're mostly going for the show.  The chefs are wonderful to watch but given the prices at this place, it's mostly a special occasion restaurant.","type":"review","user_id":"nWT3tYZYFoKPUXSHYYhuLQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Te72-fjbquQFCfPBgJ4ldQ","date":"2011-06-16","review_id":"TjBT331tiujexjimaSeF2g","stars":4,"text":"The food is relatively good, but they have a great wine selection and half price bottles of wine on Wednesday. One of my favorites, especially for the summer.","type":"review","user_id":"OtGNdI6lHvi0xvw4d6gDRg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"7QNzak_Hn1xqq2fcRFnljg","date":"2011-03-21","review_id":"quEQ1gkUO1GCrtdH513WzQ","stars":5,"text":"Beautiful campus, nice people and professors, and amazing food. Cheap in-state tuition as well. Plus, it looks like Hogwarts School of Witchcraft and Wizardry because of the \"Hokiestone\" used in the construction of the buildings (there is even a Quidditch team). I'm surprised there aren't more reviews for this.","type":"review","user_id":"VH5pKCf64byq4k4RgV-buw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2010-06-23","review_id":"9TZqsdXsXfVQnZpT34lY6g","stars":5,"text":"My favorite Mexican restaurant ever.  The California Burrito is really good, and the service never fails.  Usually they fill up your water before you get half-way through the glass.","type":"review","user_id":"mlkw5s9EpAW8MzCV3orA-A","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"G_GPyXy1k9yA3njUJpW55g","date":"2011-07-30","review_id":"Hm2GoyBf5YuqD16_jKYKuw","stars":4,"text":"Had a really nice meal here the other night that was some of the best food I've had in a while.  \n\n We both got seafood dishes:  the grape-leaf-wrapped grouper with grit cakes was awesome -- flavorful, moist, good portion size.   For the other dish, the scallops with porcini mushroom pierogi, every thing was spot-on -- the scallops were seared right, the sauce was nice and complemented the rest of the meal really well (I assume the artichoke hearts in the sauce were canned, but everything else was fresh).\n\nTo top it off, we got a seasonal blackberry creme brulee that hit the spot -- not too heavy, and the blackberry flavor was great.\n\nThe service was just fine, and our waiter was friendly.  The only knock on the place was that it can be fairly loud -- the restaurant wasn't full, but the sound just carries in that space, largely because there's not much to absorb it, and the walls (metallic?) seemed to bounce the sound right off.  \n\nI haven't tried the sushi, but the seafood entrees were really delicious (although they were each $20 or so).","type":"review","user_id":"U7LPGxc39wPCGJ4D4dnx9A","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rApUugTXL6kg1DIosUhDUQ","date":"2009-09-16","review_id":"9mq0Ru2xiXrI_A1gxcRB-g","stars":4,"text":"For the bartenders and service alone, I will return to Foster's.  Everyone was friendly and they worked well together to serve the customer as efficiently as possible.  It was a team effort - just like Coach Foster's D-fense.  The food was okay and the drinks were very good.  Looking forward to more game watching at the bar after the Hokies win.","type":"review","user_id":"2zUTgUL73lJNmCZ7voving","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"GJIZlVlPncUQk9x1EjgnFA","date":"2010-06-26","review_id":"P6YsIRVi6ogRk6YprvmLxA","stars":4,"text":"Panera Bread is a chain.  I'm from the West Coast, so I didn't realize this at first.  It's not crazy cheap, but the prices are certainly not ridiculous either.  All of the franchises are clean in appearance and modern.  They have free Wi-Fi at all of their locations.  The sandwich/soup shop also makes their own baked goods.  Most people show up and order their sandwiches/soups for lunch type eats, but their bread/bagel/dessert selection for take-out is very good as well.\nThe lunches for under $5 are not generally worthwhile.  You can get a very tasty variety for under $7, however.  If you are okay with a little ridiculousness in price, try the teas.  The green tea is very good, but a hair too much in price.","type":"review","user_id":"wMzGO3ZI7WV3bIplNjRVFw","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"voXoIsapBR30q_7PgxVeAA","date":"2010-07-05","review_id":"6qMhNyx_jpIGG54mUAaI_g","stars":3,"text":"When I moved here, I was told to this was the place to go for good pizza. I tried it and was disappointed. It's not bad, but it's not good either. I've only been back a couple times since, there are several better choices for pizza in the area. I did recently return to try their breakfast. The menu items were intriguing, giving a bit of an Italian twist to traditional breakfast food. I ended up splitting the Grand Combo Plate with my wife, (which is pancakes,eggs, bacon, sausage, fruit, toast, & potatoes, nothing exciting) along with an order of beignets. They were out of fruit, so they offered to substitute with an item of our choice, no big deal. The potatoes were seasoned rather heavily, and the pancakes had a strong grainy taste. Otherwise, no real surprises, everything was prepared well and cooked as ordered. I'd like to come back and try some of the more interesting options, but I'm in no hurry.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"ncZgdBYg2gzGeSLJb2xM0Q","date":"2010-07-26","review_id":"4___veZNHQsJ2HyZoGpUSQ","stars":3,"text":"You get what you pay for. It's a decent cheap buffet. Nothing to get to excited about, but if you want a lot of Chinese food for cheap this is your place. It was clean, but not exceptionally pretty. Overall, a 3-star experience.","type":"review","user_id":"IvBMyL7qGEjIko24erJNUw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"tpaVWvFqb08iv4_RgzDkjQ","date":"2010-04-17","review_id":"Hotr97arASMSCFuo0m4oBg","stars":4,"text":"I also use a separate rating scale when discussing Blacksburg restaurants (this would be a 3 star restaurant in California where I'm from and the sushi is amazing). But overall, I think this is probably the best sushi in Blacksburg. The specialty rolls are the way to go. Not a lot of selection in fish, but for the novice sushi eater, this will not be a problem. Have a few glasses of sake and the ambiance gets better ;)","type":"review","user_id":"kxL4RiAm_I8TKYEmPz89bg","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"nuU8Wg64xGbsyK_DaOma-w","date":"2010-04-04","review_id":"myfr8Hqw5G638pZSRwoBUQ","stars":4,"text":"Good sandwiches with fresh ingredients.  People are friendly and they cut the meats and cheese right in front of you.  It's nothing terribly spectacular but it's considerably better than subway for me.","type":"review","user_id":"nWT3tYZYFoKPUXSHYYhuLQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"F_ofTZiczPkYZ93JAE3RRQ","date":"2010-06-05","review_id":"x-w7adA_3WWjaYHnpSQQPw","stars":5,"text":"Last year I went there at least three times, and every time we enjoyed the food. The ruby curry, with tomatoes, pineapple, and fried tofu, was delicious and I've made buckets of pedestrian orange curry trying to duplicate it. There was also enough food that we took some of it home in boxes.","type":"review","user_id":"Qnix8eS5meKg9dImfGcC8A","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"QxiEo0oS1MyBrr0vWlMqyg","date":"2009-09-15","review_id":"7SovebN6JB5No6nt_zytew","stars":5,"text":"These people are top notch -- especially when compared to my previous experiences at Star Nissan in the Chicago-land area.  \n\nHonest.  Quality.  Goes above and beyond the required service.","type":"review","user_id":"m79laZx-DVX8So7cXrA-KQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"tJwomYMNjpd4A31rDMXMCw","date":"2011-07-06","review_id":"MHAIJ3hl1WsdugPaWw0-Ng","stars":1,"text":"While recently in Blacksburg for the first time ever for a wedding, I made the horrible mistake of trying to go to Sharkey's.  The doorman let my friend and I in but denied access to one of my other friends because the doorman was confused by my friend's foreign ID.  I spoke with employees at other bars in the area and they said foreign IDs are a valid form of ID and they deal with such IDs all the time due to the significant foreign student population at Virginia Tech.  \n\nA disagreement ensued between the doorman, another employee and two of my friends.  While my friends conducting themselves calmly and reasonably, the two employees quickly became belligerent and aggressive and physically shoved my friends.  I was frightened by this exchange and shocked that employees would actually use physical force without any provocation.\n\nWe found an awesome bar down the road that was really welcoming, much, much nicer and fun.  Don't waste your time or money on such a dirty, disgusting bar with employees with anger management issues.","type":"review","user_id":"BeM4vSaK29pt1CeHh1BPPQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"B1yzS_JFgWxQVHsqQp-d7g","date":"2011-06-20","review_id":"DNwop8_vSYKs4dwP01ZbrQ","stars":4,"text":"Good food, good service. Not fantastic but you always know what you will get. Really good steak.","type":"review","user_id":"Z8Hk167C8bQzW0vf5pZtFw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X381_JV6xOq3VSsep13GvA","date":"2010-02-11","review_id":"dKU_MC7R0ZyxUA0Yo6ptxw","stars":1,"text":"Freakishly creepy interior and sub-par food. That is Macado's.","type":"review","user_id":"ZABoX8_9iMuLa3OAl2Pt8Q","votes":{"cool":1,"funny":1,"useful":2}},
{"business_id":"76hIZMzHZ_lFM0p2N7_gRQ","date":"2011-06-07","review_id":"v0qIvK8dTz4Tq7SqPdYwiQ","stars":4,"text":"No alcohol outside until they get their ABC license amended.  Other than that everything was excellent.  They had about a 12oz prime rib dinner for 16.99.  Cheapest prime rib I have seen since the early 90's and it was worth about twice what they charged for it.  The chicken pita was good, as was the Greek pasta.\n\nI wouldn't eat outside after 3 PM in the Summer.  There is almost no protection from the late afternoon sun.","type":"review","user_id":"k9BAzY1cqjYtMY9J4YdSMQ","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"7GSobyijoZeDKWGLUOsXgA","date":"2011-01-20","review_id":"rWVt9q42PU6nRvTfSSsbTA","stars":5,"text":"Absolutely LOVE this place. Until they opened I had been shopping at Petsmart because I could hardly afford the smaller pet stores in Christiansburg and they didn't carry the food I wanted for my dog anyway. The guy who runs it is super nice and helpful. He has helped me save so much money! I can't remember the last time I was so happy a store opened. :)","type":"review","user_id":"0vz1kjUpqUWJ6C7Bh8IrMw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"PMduIGhezzKOdEsjEX4llg","date":"2010-04-04","review_id":"8ew0CtnkWm4l5_mN_YWhcA","stars":3,"text":"This chain is known for good burgers and great fries but unless you're a hardcore burger fanatic, the prices are a bit hard to swallow. It has a fun atmosphere and you can pretty much have your burger anyway you want it but if you want to have fries and a drink with it, expect to pay more than 10 dollars.","type":"review","user_id":"nWT3tYZYFoKPUXSHYYhuLQ","votes":{"cool":0,"funny":1,"useful":0}},
{"business_id":"wk8EiiHeB3TFx0YCOOityA","date":"2010-05-19","review_id":"uvig7QafuwKbGH7ajlamEw","stars":2,"text":"When I first came here in 2004 for my sisters graduation the place was amazing. I specifically remember the great bread and butter! It was so sweet and light. \n\nSadly the key is \"was\", as over the years  the quality of food has just fallen.  This past time I went, nobody in my party had anythign good to say. One complained the lasagna was over cooked. Another that the alfredo was \"gritty\". My ravioli was tough. The best I heard was that the chicken parm was ok. \n\nThe staff was very prompt and a person I assume to be the manager appologized  for having us wait for a table to clear, and then once seated came by again to thank us for our patience. They even have a nice little wine shop and offer tastings. \nHowever, I just can't get over how much the food has fallen.","type":"review","user_id":"_x7GY1uFoNePmirs3scEqg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3ulgAMrHx6FFvDUMrLInDw","date":"2011-09-14","review_id":"5SUidDzVUi1lxzJDAjOywQ","stars":3,"text":"I came here for a late lunch (3 p.m.) with a bunch of friends and wasn't too excited about the restaurant. I'm Chinese and of course I'll be skeptical about Chinese American buffets. I do have to take into account, however, that Blacksburg is not well known for their Asian food so Hokkaido buffet is a great option if you want your fixing of greasy, cheap, sweet, Chinese American food.  \n\nFor $5.99 at lunch time, you get a variety of typical Chinese American food. Not good quality, which is obvious, but they do taste like the typical General Tso Chicken, General Tso Eggplant, Stuffed Mushroom, Broccoli & Fish, Chinese Mealballs, Fried Rice, etc. I would rather come here than go to a Chinese place with a lunch special because the food tastes the same...you just get more options in Hokkaido buffet!\n\nThe dessert section composed of fresh cantaloupe and oranges. There were also a variety of mini cakes with flavors such as strawberry, coconut, vanilla, and chocolate. My favorite feature of buffets is always the ICE CREAM MACHINE. The ice cream is not as icy as I expected and was pretty good. Come on, you can't go to a Chinese buffet without being attracted to their ice cream machine. Hehe. \n\nI wouldn't come here every week due since the food here is pretty heavy and dare I say unhealthy? But if you want to satisfy your Chinese cravings, give this place a try. It's cheap, relatively clean, and the service is great!","type":"review","user_id":"DW5rPm4lfnWDIG0zkO2A9g","votes":{"cool":2,"funny":2,"useful":2}},
{"business_id":"hIl5mwJaGY1P95pf8cKciA","date":"2011-09-20","review_id":"hi1vf4gISkQeAxS1tjh0Cw","stars":5,"text":"This place has the best, freshest, donuts anywhere! It's so good that it's worth writing my first and only Yelp review for Carol Lee's. The irony is, I don't think they need reviews to reaffirm what Blacksburg townies already know! I've been trying to find something of the same caliber in northern Va but with no success. Worth driving 4 hours for!!","type":"review","user_id":"8SO3-3yhAQbAvKJIFALu-g","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"4kR9-F-iooU_l_n2mgSGDw","date":"2008-08-23","review_id":"MYYlG3drBd2b129Ew0cPkA","stars":4,"text":"A great beer and wine store with frequent tastings.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"I_CFI8tpJHkGthEet3v3WA","date":"2010-06-02","review_id":"cuTzSC8ckFwuy9TG52cZRw","stars":3,"text":"Cool hangout place.  Low-key, nothing really out of the ordinary.  Definitely a good selection of beers.  Also, a good selection of scotch and whiskeys (although I am not particularly picky about those).  \n\nI came back to Blacksburg for the first time in probably 8 years or so, and hung out with some old friends here.  It's kind of small, dark and smokey, but good times anyways.","type":"review","user_id":"2vB-TT0KRGuIYlpWOgIPHw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2010-03-13","review_id":"Vp6gG2ThfWNa7gclAad1bQ","stars":2,"text":"I have been repeatedly disappointed in this place.  The quality of the food is up and down.  Getting a hot cup of tea is a challenge.  One time the sauce on my eggs tasted bottled.  Another time the vegetable stir fry was way over done and salted.\n\nI have experienced so much better vegetarian food around the country so I have to say they would benefit from a relook at the food and a redo of many of their recipes.","type":"review","user_id":"N9tgUEYnMvdZSDDAZ46sJg","votes":{"cool":0,"funny":1,"useful":0}},
{"business_id":"76hIZMzHZ_lFM0p2N7_gRQ","date":"2006-12-29","review_id":"xQiSB0vxRBvMV_FA0fL8Lw","stars":3,"text":"The pita pizzas are a good deal. $5 for a pizza that can be 2 meals!  The subs are also pretty decent there.  However the service is generally slow and sometimes forgetful! I ordered a ginger ale with my meal once and it never came! And I still got charged for it!  \n\nThe moussaka  was ehhh..  the baklava was so-so... the beer selection was decent. I used to choose this place cause they are the only ones who served Flying Dog Ales but now Rivermill has that as well.","type":"review","user_id":"5m-p2ddJBi4nIXWSglVGEQ","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"B1yzS_JFgWxQVHsqQp-d7g","date":"2008-08-04","review_id":"yF47fMae8RL0c0TnVOEj4A","stars":3,"text":"This place is only worth the money if you are going for the entertainment. The food is good, but it is better elsewhere. If you want good Japanese food, to to Tataki, just down the street at the intersection of North Franklin and Merrimac.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"jZBRs1UCbylCpcTOQ5Bi3Q","date":"2009-08-29","review_id":"XkHGptcPEuZCs9KGrBUWug","stars":1,"text":"Very unimpressed. I went once and I will never go back.  Food quality is the worst compared to other Mexican restaurants in the Christiansburg/Blacksburg area.\n\nStay away!","type":"review","user_id":"1V38sXUk6_Y78xa7MCqMIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2010-04-25","review_id":"6s_AMw1DW2-0rpG7jHIQlQ","stars":2,"text":"I took my sister in for breakfast this past weekend while visiting. I had heard such good things about Gillies but we were so disappointed. The eggs and French toast were okay and the potatoes very good. But the so called \"fresh\" salsa was clearly made with canned stewed tomatoes. It was so gross that I scraped it all off.  \n\nThe service was as appalling as my canned salsa.  The waitresses were snippy, inattentive and ours literally threw creamer at us when we asked for it.  I realize it's sort of a hippy hang out but maybe the waitresses should shave their underarms if they want to wear tank tops and handle food.","type":"review","user_id":"dDsGEQy66FWv4xe41QfsOg","votes":{"cool":0,"funny":2,"useful":0}},
{"business_id":"fm0rDtwGgWf9RjPRzGy1Bg","date":"2011-05-30","review_id":"TTCzwn_6k1AwSuqAB8oLBA","stars":5,"text":"I've been obsessed with Rita's since watching it on an episode of \"Unwrapped\" on the food network. \n\nThey have some wacky flavors which rotate (I've had Swedish fish - which taste just like the gummy candy and the mango). \n\nMy last visit here, I had the Blendini which is like a Dairy Queen Blizzard but made with a mix-in of the Italian Ice. \n\nI loved that at the top, you had your italian ice and at the bottom, you had your ice cream (custard they call it) and then your candy mix-in. \n\nIt was delish and even though my waistline will not be happy - I definitely was cooled down on a hot 90 degree day!","type":"review","user_id":"jp4X9H56zjjLacnpHz02Iw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rXGioez8wVRBwJXJoBj9LQ","date":"2009-01-06","review_id":"xCiI3hjTqZsUrrE5ZvThwQ","stars":3,"text":"Don't get me wrong, the food was pretty good.  I think my main problem is that this place gets way too much hype than what it deserves.  The atmosphere isn't the greatest and the food is overpriced in my opinion.  However, the best thing about the food here is how fresh it is; everything is cooked fresh once  you order it.","type":"review","user_id":"1V38sXUk6_Y78xa7MCqMIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"HqPPWAttTuBpDoKnAQt4Vw","date":"2011-07-11","review_id":"jZkYAt_k84A3sRZbASRmnw","stars":3,"text":"Nice rooms and facilities. Close to campus, but not worth the money.","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"4MPACVneQtpnTbzHavn1fQ","date":"2011-08-20","review_id":"CE-RO-KYunEgiizyz-FCoQ","stars":3,"text":"First, I'll talk about the positives. This place by far has the best tasting coffee in town (and I believe I've been to every coffee shop in town). It's brewed on sight and there's a huge variety. The cafe is impeccably clean and there's a lot of great seating, particularly at their counter. Their hours are fantastic, particularly for early risers such as myself -- I believe they open at 6am (although I'm not a fan of the 10PM close time near a university, but to be fair, every cafe in town closes at around that hour). \n           Now for the negatives. The food is really lousy. The sandwiches are completely boring and unoriginal and honestly -- anyone is perfectly capable of making one of their sandwiches at home for a 5th the price. It's really just bland cold cuts from any grocery store. I can't really compliment them on their breakfast items as they don't really appear to make any of it themselves. The pastries are shipped in and covered with this tacky looking clear wrap. The same thing applies to the bagels -- imported and clear wrapped. Their oatmeal is boxed --  straight out of the grocery store. Honestly, if they want a 4th star, they need to really improve on the food side. \n           The other big negative there is service. The people who work there are professional and take your order, but they're all pretty introverted. I've been going there sporadically for about 2 years and I don't think any of them know my name or care to know. I order the same exact thing every time I go in and I still get asked by them what I want everyday and I'm pretty confident that they really have no idea what I want. I stopped going there for about a 3 month stretch and came back and there wasn't a \"Hey long time no see,\" or \"Hey where have you been.\" It was like they had never seen me before and the scary part is is that I've actually had conversations with a few of them. You can have an entire conversation with someone who works there -- see them the next day -- and they'll completely forget who you are. I mean, I don't want them to have artificial personalities like most Starbucks employees where they're fake nice to you, but Jeez I've been going there for 2 years you should at least recognize me. They're like robots. \n           I would imagine that their robotic personalities stem from the top. The owner Scott seems to run a tight ship, but he's the only aggressive introvert I've ever seen in my life. He hardly ever utters a word, but when say a telemarketer calls he'll snap at them with the ferocity of a drill sergeant. I've had one bad experience there (which is what prompted me to stop going for 3 months)... I brought in a sandwich from Sub Station down the street and ordered a coffee. I was at the counter eating my food and he snapped, \"Don't bring in outside food again. You know that we have sandwiches here!\" At this point, I had been going there everyday for about a year and a half and this was the first sentence he had ever said to me. Honestly, Mill Mountain just needs to shake up their culture. Their employees (and owner) need to become a bit more social. Their real saving grace is that their coffee is absolutely fantastic and that they're the only place open in the early morning hours.","type":"review","user_id":"4Nb4nr3QYwIrQHTMgz_VGQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2011-07-11","review_id":"m-JhAW18Rjcs5j6nZ9C0Pg","stars":4,"text":"Great vegetarian food at fair prices. I'm no vegetarian and I love this place. Their breakfast cannot be beat!","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"tJwomYMNjpd4A31rDMXMCw","date":"2007-12-20","review_id":"PqFuDR3MnUJ532_PVrwf-g","stars":3,"text":"this was always a standard place for me to grab a late lunch when i lived in blacksburg.  the sandwiches are reasonably priced and you have the option of getting your side as sweet potato fries with orange marmalade for dipping.  it sounded weird the first time i heard somebody order it, but it's actually freaking delicious.  i haven't ever found the same thing anywhere else.","type":"review","user_id":"I-NDOmfDpEtYN1Qpes5yqA","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"rApUugTXL6kg1DIosUhDUQ","date":"2010-02-17","review_id":"1P6sfhSrmQ9-zV0IqiTMJg","stars":3,"text":"I was pleasantly surprised. I wasn't expecting much because the only review I had heard was that it was average. But, the appetizer was really good and the portions were impressive. We got the half-size appetizer and it was huge. I can't imagine getting the full-sized version.\n\nThe salads were surprisingly good. The entrees were good, not great, but I enjoyed the friendly service, the atmosphere and the overall experience. I'm glad Blacksburg has a more upscale, yet affordable, sports bar and grille experience.\n\nWe will definitely be back.","type":"review","user_id":"3xuYR9y1d44tMluc8qluEQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"3OmYvTrYQFwITFq4vm6Vsg","date":"2008-08-04","review_id":"VaYUN-AHOfK70tPJYINguw","stars":5,"text":"Simply the best restaurant in the New River Valley. Amazing service, amazing food.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":1,"useful":0}},
{"business_id":"thlQuACT7g1GQLA-45pfkw","date":"2010-05-04","review_id":"Tra80Q1cRkmEUTfA3OOrFA","stars":2,"text":"Came in here late one evening, mainly because I was near by and hungry. I'd heard good things about this place from some people I know, so I figured it was worth a shot. It looks like your typical strip mall Chinese joint, a little dingy with next to no dining area. It was pretty busy, and probably a little dirtier than normal because of that. After getting the food, I was not impressed. The food tasted a little freezer burnt and the imitation crab had a very odd taste. With so many better options in the area I won't be going there again.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"lE_jefQ2F9PSjtNmNTSFIA","date":"2009-02-06","review_id":"WiWc_WzBlMcQEYCEbQ4UIQ","stars":1,"text":"The Farmhouse receives way too much credit in the area for no reason.  I've been to the restaurant twice and have had a negative food experience both times.  The atmosphere is extremely poor (red fake-leather booths that I think I've seen at Pizza Hut).  \n\nAs for the food, both times I went I ordered a steak \"medium rare\" and both times it came to me \"well done\".  How could you be off by so much two times and claim to be a reputable restaurant for steaks!?\n\nMy girlfriend got chicken in a lemon sauce with asparagus which was definetly not worth the $4 I could have paid to cook it myself at home.\n\nIf you are thinking about going to this restaurant, move along.  I'm seriously never this negative so this review should mean a lot.\n\nTry Bookbinders or The Summit, both in Christiansburg, if you are looking for a great meal!","type":"review","user_id":"1V38sXUk6_Y78xa7MCqMIQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"f2ggWe2Lw3cGeA5T7mk_ZA","date":"2011-06-23","review_id":"I86w0GGN_hOs_KBGvCctUQ","stars":2,"text":"I'd been meaning to try this place for some time now, but always seemed to forget it was there when going for Mexican. Then a friend insisted I try it, raving about how great it is. It was a Friday night, and the place was almost dead (maybe it was the construction?). Looking over the menu I could see why my friend wanted me to try it. The menu was full of interesting twists on typical Mexican foods, with odd ingredients or other slight alterations in how they're prepared. The salsa that was brought out was fresh, with a slight bite, better than most in the area. So there was the good points... on to why I gave it 2 stars. The wait staff was unpleasant to a point they were almost rude. My taco sampler was disappointing, and lacking the intense and wonderful flavors the menu teased at. As other people have noted, the decor and ambiance were lacking.  I can't say I would never eat there again, because I probably will. The menu was appealing enough I want to try a couple other items before I pass final judgement.\n\nBTW, there's no mystery about cheap beer for $1.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"76hIZMzHZ_lFM0p2N7_gRQ","date":"2006-12-30","review_id":"8Lqfg2p5fXsKb_fdmFOtCg","stars":3,"text":"Good place for cheap beer and huge plates of food with many vegetarian selections - I wouldn't make a special trip to eat there (I live ~1 hour away) but pop in when I'm in town.","type":"review","user_id":"nzdh_u5N9QXhDFxJ9A8pXQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2010-03-13","review_id":"fRYShe_jQCYrqJfpUZ7O1g","stars":3,"text":"In reading the other reviews i don't disagree but if you just order the basic tex-mex dishes such as beef tacos with guacamole or cheese enchiladas and an icy brew you will get a decent meal and the price is great.  I agree i would not order the fajitas or the more fancy menu items but stick with basics and you can't go wrong.  I have eaten here on and off for 10 years while visiting my daughter and son-in-law for a quick cheap sit down meal with good service and it works.","type":"review","user_id":"N9tgUEYnMvdZSDDAZ46sJg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rO-I1eS_92gzFkclW2ZvNg","date":"2010-06-10","review_id":"21aHjNGxNAxcxfOz3daD0A","stars":5,"text":"They've always had good coffee and service. So they're a bunch of hipsters--isn't that more interesting, at least? I like the raw brick on the wall. This is my favorite place to go in Blacksburg, and they're gutsy being a few blocks from Starbucks on one side and Mill Mountain on the other.","type":"review","user_id":"Qnix8eS5meKg9dImfGcC8A","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"7zDbcbUkafhkanpTE5TQRQ","date":"2009-10-25","review_id":"fPYhVQNlBbzDkfDfEPiGLg","stars":2,"text":"I go here from time to time with other people, and have not been particularly impressed.  \n\nLunch-a lot of people go here for a quick lunch during the week.  They have a moderately priced ($9, i think) lunch buffet.  The selection is somewhat diverse but not very exciting.  It includes a lot of staples like tandoori chicken and chicken masala and also some vegetarian fare.  They've managed to make Indian food bland and uninteresting, which is hard to do.\n\nDinner-I've found that the food is better at dinner than on the buffet, but expensive considering the quality.  Better than lunch, but still nothing to write home about.\n\nIf you want good Indian food in the NRV, I'd suggest Taaza in Roanoke.  It's excellent!","type":"review","user_id":"TyYKyx5_AJyjyaxQyAVRJQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"HqPPWAttTuBpDoKnAQt4Vw","date":"2010-03-13","review_id":"9goMlrq98D1rq93NckrB3A","stars":4,"text":"Excellent hotel and we hosted a brunch here after my daughters wedding and they were organized, professional, made good recommendations and the food was good (better than the average hotel fare at a meeting or event). \n\nIt is fun talking to the employees many of whom are either going to school for a service industry degree or recently graduated from VT. \n\nIt is one of the most expensive places in town but not more than what you would pay back in DC or Atlanta.","type":"review","user_id":"N9tgUEYnMvdZSDDAZ46sJg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rO-I1eS_92gzFkclW2ZvNg","date":"2007-01-19","review_id":"xMC3Ixh1QKQh0MG3jEyQ3Q","stars":4,"text":"One of the best independant coffee shops in town. The coffee is delicious, the people who work there are really friendly and the atmosphere is very welcoming. A nice place to get some work done (free wireless) and a great place to have a cup of coffee with friends. I always take friends here when they visit. My only complaint is that it's a rather small space. Perhaps it's crowded just because a lot of people frequent it, but sometimes, it can be hard to find a seat and that's the only reason why I don't give it 5 stars.\n\nOh PS: Their chocolate chip pumpkin muffin is pretty much the one thing that gets me out of bed on weekends. It's SO good and they also have baked goods that are vegan friendly.","type":"review","user_id":"dvAXqNtZHuxLgTIyTC4omQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"Te72-fjbquQFCfPBgJ4ldQ","date":"2009-10-28","review_id":"4b_TxP8nBV5u5F0P458qLA","stars":2,"text":"There are two good things about Boudreaux's:  The drink specials and the rooftop seating/bar.  It's hard to beat a half price bottle of wine special.\n\nThe only problem is, the food isn't that good.  It's not bad, just mediocre.  The jambalaya and gumbo are both pretty uninteresting.  The best thing I've had is the blackened catfish po-boy sandwich.","type":"review","user_id":"TyYKyx5_AJyjyaxQyAVRJQ","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"hlIwpc2gvIljc0YaqBJDNg","date":"2010-06-05","review_id":"4aDvWFrUwabW4le05v-zbA","stars":4,"text":"They're skilled and pleasant. I had a minor allergic reaction to the wax, so if you've got sensitive skin you might want to go elsewhere or ask them if they've got more than one kind of wax.","type":"review","user_id":"Qnix8eS5meKg9dImfGcC8A","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"qZVNTc39d7mLqWeSFTOHIg","date":"2011-07-21","review_id":"x3JIdWson87BQ707AOgRGg","stars":5,"text":"Cutest bake shop in the NRV! I wish I had come here earlier. The decor is bright & playful. There's plenty of room to lounge, study, or just chitchat with friends. There's even a kids' area to play around in.\n\nThe bubble tea sign & cupcake display totally caught my eye. Cupcakes are whimsically decorated. Flavors of both the frosting and cake are vanilla, chocolate, or buttercream. These cupcakes could definitely be competent contenders against Magnolia's or Billy's in NYC.\n\nAlso, the drink choices: where else can you find a coconut latte? The drink has a light hint of coconut mixed with espresso. It's just right, not too bold. :)\n\nOther unique drinks include salted caramel hot coco, steamed coconut milk, and green tea latte. \n\nEven their logo is too adorable. I had to take one of their free stickers. If I were a student at Virginia Tech, I'd definitely come here every day.\n\n(P.S. They also serve breakfast sandwiches all day and hot paninis. I will have to try the sandwiches out when I'm back in the area next time)","type":"review","user_id":"lCRntv4-tXaM052bYxmCyA","votes":{"cool":3,"funny":3,"useful":4}},
{"business_id":"X7SaMeMdYa76zmavVc2YUA","date":"2008-08-04","review_id":"u0DQqa-Pkxu3g8hlusCV4Q","stars":4,"text":"This place has NTN Trivia, which is awesome! The drink prices aren't great, but there are specials on Sam on saturdays and Leinekugel's on Tuesday. If you can stomach generic beer, there is usually a special. Wing night is Tuesday, so matching this with Leinekugel night makes for a great Tuesday. Oh, and the wings are good too, I like the spicy garlic.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2010-12-19","review_id":"HOktnsVCvg6s3pDsJRmyww","stars":3,"text":"After living in Charlotte, NC for two years, I was psyched that the \"other\" location of Cabo Fish Taco would be in my new home, Blacksburg.  I really enjoy their corn salsa, chips and margaritas.  The tacos are good... but not quite as good as the same menu items in Charlotte. It just seems like their other location makes the tacos with a bit more love.... more fish, better tortillas and more flavorful mexi-slaw.  I would give this place 4 stars, if I hadn't been to the Charlotte version. \n\nStill, a good standby.","type":"review","user_id":"LAiubp2QgH2kbxQXV7Dwtw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"4kR9-F-iooU_l_n2mgSGDw","date":"2010-04-17","review_id":"uTSVKvf2TIvhzfQxnOpWZQ","stars":5,"text":"They have a great selection, a very knowledgeable staff, and have awesome close-out specials all the time. If you need a 32-pack of beer for the beer pong tournament you're having this weekend, you probably don't want to buy your beer here. This is the grown up's beer and wine shop. I LOVE it!!!","type":"review","user_id":"kxL4RiAm_I8TKYEmPz89bg","votes":{"cool":0,"funny":2,"useful":0}},
{"business_id":"tpaVWvFqb08iv4_RgzDkjQ","date":"2009-07-17","review_id":"ctq7qtZJYdKIieFnFqXTQA","stars":4,"text":"This is one of the best places in the Blacksburg area for sushi. With Kayo, turned Blue Ribbon, turned Tataki now closed, it's one of few quality choices. I liked this place when it was in Salem, and I am glad they moved to Blacksburg. The look and feel is much better than the old location.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"XzsZqaWSTXbyS_kbv7GZSA","date":"2008-08-04","review_id":"HqxUCxVFzrqoO-8XEPXZGA","stars":3,"text":"Not bad, but we prefer Ceritano's or Zeppoli's for Italian food. It is kind of pricey for the quality.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2008-07-21","review_id":"WShwRQGVkMkxJFVu7z8dsw","stars":5,"text":"I would hop a plane to Bburg just for Cabo... well almost! Love this place! Plenty of menu options for all your friends and the buffalo shrimp tacos are to die for! Inside and outside seating and you can grab a couple drinks and play pool upstairs if you have to wait for a table. \n\nAnd for Steppin' Out 2007- they filled the entire parking lot with sand.. how can you not love it!?","type":"review","user_id":"QnoN3SNip50oBtgjXmfGYQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"-QNnL7C_z7NxiCarq3VZTQ","date":"2008-10-12","review_id":"PWPy69S3mWMCq2WoLOb12w","stars":4,"text":"Food: yummy. So tender. A++++++ Will buy again!","type":"review","user_id":"ZABoX8_9iMuLa3OAl2Pt8Q","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"ZFdGatpUaeb37NZRGsL_yw","date":"2008-08-04","review_id":"G6AM43OiUFYMsXBwxJOKsA","stars":4,"text":"Great pizza, but no longer around. Roma pizza is now in its place.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"I_7cQmHxx6LokP9yr7Fx-w","date":"2008-08-23","review_id":"e78ADtrPFfnyw2a6nmB7rA","stars":4,"text":"This Regal is the only modern theater in the area, although that may soon change. Their student price of 7.25 is not bad, but you can get six dollar tickets at the student union.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"thlQuACT7g1GQLA-45pfkw","date":"2004-11-23","review_id":"CfLbNIFn_k70oJXQuSNGbg","stars":5,"text":"The Lo Mein is good.","type":"review","user_id":"SBWy7wzlHokEdK4UGx3XsQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2008-08-04","review_id":"tPZW6yrzhhxJabR3y8vWbg","stars":4,"text":"This is delicious for dinner, a little expensive for lunch. They have a bunch of tequila's, not as many as Red Rocks in Centreville for all those NoVa natives in Blacksburg, but a good amount. The music is usually really good and they serve their food pretty late too.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"tJwomYMNjpd4A31rDMXMCw","date":"2011-07-06","review_id":"nqdeKL6MLUj4sZ0b-mNZYw","stars":4,"text":"Sharkey's is officially my favorite bar in America. Ewwww! Sharkey's? \n\nYes. Sharkey's. \n\nI've heard rumors that this place gets crowded in the winter and smells like pee. I don't care. I would sit IN a toilet for drink specials like these. From 5pm-9pm you can get a double vodka soda for $2. Yes. TWO. DOLLARS. Two hundred pennies. 40 nickels. 8 quarters. 20 dimes. Two Sacagewea golden dollars. \n\nI didn't try the food. I probably never will. That definitely doesn't bother me. The only thing that bothers me is that these specials might not justify a 12 hour road trip.","type":"review","user_id":"u-u8vyXgSSQSA_K6rvrZjA","votes":{"cool":0,"funny":4,"useful":0}},
{"business_id":"GBC4DyQOspHcFnDECKF4ig","date":"2011-06-18","review_id":"apRT6zY9r-6tleJlUQ9q0Q","stars":4,"text":"Wal-Mart is Wal-Mart.  There's not many surprises here on what you get.  It's absolutely wonderful for people-watching, like the guy I saw with two different shoes on.  Or how, out of 3 people, 1 will be wearing camo, 1 will be wearing tie-dye, and 1 will be wearing Hokie gear.  \n\nAs a store, it's always clean, the service is decent, and the goods are on par with any other store in the area.  The major selling point for me is that it's a Super Wal-Mart...as in, they sell groceries.  I've actually shopped at the local Food Lions and Krogers, tracking the costs of like items.  The Wal-Mart is, hands down, the cheapest place to shop.  Even if you use MVP and club cards at those other places.\n\nIf you're looking for a good social outing, or can stand the odd people around you (depending on how you look at it), this is the best place to shop to save a good chunk of change.","type":"review","user_id":"37x54E6hH0tfcWtbOdhiNA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"yeVkVm4kFVO25iFjpGKAkg","date":"2010-11-24","review_id":"wj53URDlMaRAaYJIydPBqQ","stars":4,"text":"I'm living here now, in the graduate/professional section. No parties, nice and quiet, I have a great view of the farm and tech campus. They do regular maintenance, it's a little pricey, but they include water and \"heat\", so really there's not much to complain about.","type":"review","user_id":"twISWUMTq7r80UP_s11z3w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"NLfQp6SUK9vwv3WNURbjIg","date":"2008-04-15","review_id":"VlJ9eSbWnX-tif0W6h5W1Q","stars":2,"text":"Cheap, but not very good. Also, they're open late. Spend a few dollars more, buy your own ranch dressing and get better pizza.","type":"review","user_id":"1iuUH43JM8Nq4_993ka7ag","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"nXXfB3-tIIZczK4byP8JWQ","date":"2011-09-10","review_id":"uVlN5SZB7n-uASacBmI3CA","stars":4,"text":"I love Mike's! They absolutely have the best burger anywhere! I am a big burger lover and so I try the burgers at most restaurants I go to. But I am always disappointed as none ever compare to Mike's. The place has an ok atmosphere. Good for a beer and burger, I guess. The service is lacking as you belong to no one server. They are oftern slammed and no one is making sure you got your order taken. I often go up to the register to order if I haven't been waiting on in a while. I would give it 5 stars if it wasn't for the service.","type":"review","user_id":"LzquZXFdp0QH6vKThJp8pw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"DFjhSd1CRQBarXbsyPT4WQ","date":"2011-08-16","review_id":"rDbZUYANsLEZpD_GR8VjYg","stars":2,"text":"Had dinner there recently.  Brisket was tough and chewy.  Needed to cook for at least another couple hours or so.  The cole slaw was bone dry.  I think they forgot that sauce is part of the recipe.  Buns for our sandwiches were stale.  Overall a disappointment.   On the plus side...  their sauces are quite tasty.  Maybe we got a bad meal but I'd be hard pressed to give it another try.  there has to be better BBQ in the area.","type":"review","user_id":"m9tPYl77eABXl9YWTmJ4dg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"tJwomYMNjpd4A31rDMXMCw","date":"2007-12-05","review_id":"CJZ1OaRQ6JkE_b2hhlT58w","stars":3,"text":"I still prefer Hawaii Kai across the street.  It's in the Peking Palace restaurant.  Love those $2 pitchers.","type":"review","user_id":"ts70l14EjU2BYBAMZzSKVg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nXXfB3-tIIZczK4byP8JWQ","date":"2009-12-01","review_id":"rVVO65bDZfntT2XRiWsC_Q","stars":5,"text":"Best Cheeseburgers ever.\n\nIf you want a nasty ball of grease you can go to five guys, but if you want a truly delicious burger than Mikes is the only place to go.","type":"review","user_id":"nfuCvltk4w9s1VjyZ1AwDw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2007-01-19","review_id":"uqevBFO5C0iJ87fpacnBxQ","stars":5,"text":"This baja seagrill is perfection! There are only two locations in the United States, but if you're ever lucky enough to stumble across one, I encourage you to try it. Their ingredients are so fresh and their taste is very unique. I suggest any of their tacos, their dips, and ESPECIALLY their rasta pasta.","type":"review","user_id":"dvAXqNtZHuxLgTIyTC4omQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Y_HIPFeBEb1V8_eOrZt6wQ","date":"2011-01-17","review_id":"2Q9knC8sZX9bcb5qKAMZyg","stars":5,"text":"Eats is a well stocked natural foods store. They have a large selection of specialty cheeses, as well as a large amount of bulk items available (nuts, beans, rice, granola). They also source local eggs and produce if you can't make it to the farmers market! I also think Eats is the best place to get coffee in the area (and the cheapest, too!). If you purchase a membership (for 10$/year) you get a discount on every purchase (15% off!). Definitely worth it.  The other natural foods store in Blacksburg is very similar, Annie Kays, but does not carry nearly the same amount of cheeses that Eats offers.","type":"review","user_id":"scL6AqiMiYt5I9H-RJjfUw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"X7SaMeMdYa76zmavVc2YUA","date":"2009-08-08","review_id":"ztjT8hvC4UU35fA96rTkQg","stars":3,"text":"This place is no different than any other wing joint but your service may vary drastically.  Because they employ mostly college students working for beer money the wait staff will vary from extremely nice and helpful to useless and frustrating.  I've gone many times and never gotten the same server, there is clearly a constant overturn.  The food is consistent and is really only a good value on their wing nights.","type":"review","user_id":"RlfM67CZ4NSHsa2sJ9AYIQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2008-10-17","review_id":"NlKFsCAomrXvwmRShESuRg","stars":2,"text":"This place used to be great when it first opened. I was a huge fan.  Over time though the service and food quality have really fallen.  The fried fish tacos are always pretty good with their avacado spread, but I would stay away from anything that has shrimp in it.  The last 2 times I had them they tasted really \"off\"  with the last being inedible. The corn salsa is different and okay when you don't get the old whither tomatoes in it.\n\nThe other thing that really holds this place back are the sides. Most of them are bland and tasteless or poorly prepared.","type":"review","user_id":"rhE4gLtM0gb3XLwSz6HPCw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"gomSgjEesyhMgdN8w2tBOA","date":"2008-09-25","review_id":"NfhO_P00zvPegx6jioDVgA","stars":1,"text":"Not sure why this place always gets high marks.  But I will say I've only been once and it was enough to never make me go back.\n\nI went for brunch one weekend.  The table I was seated at was dirty.  It did not get cleaned off.  The place was no where near packed, but service was horrible.  The waitress wouldn't refill my water.  When she finally did, she gave me warm water from the tap.  I had to ask for more ice, and she literally gave me one piece which melted instantly in the warm water.   My silverware was dirty.  I found a hair in my eggs which were cold.  And the whole experience took about 1 hour and a half!  I could never bring myself to go back to this place.","type":"review","user_id":"BqUm1rHPSxlCWr-3HhNQyw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"ncZgdBYg2gzGeSLJb2xM0Q","date":"2011-03-14","review_id":"Okz5HSOkAKGim3ayARCZOQ","stars":3,"text":"This place is exactly what you would expect from a Chinese buffet. We like to go here because it's cheap but it's nothing special.  I would recommend Hokkaido if you're in Blacksburg (for price and quality) or, if you're willing to drive a bit, go to Crown Buffet in Radford.  It's worth the drive.","type":"review","user_id":"MEelJ6vFB3R98QijclGK6Q","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"zVrWseVuOpMapq_Lq8H6_w","date":"2009-08-27","review_id":"m_XUsimsQqkhutohsWfVcQ","stars":2,"text":"My nails looks great when I left, but within 24 hours my french mani was chipping and peeling off...disappointing.","type":"review","user_id":"al3Ii-nMy0KuuK42wdHfyg","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"KsrMCDF689P4bTBrrbTLjA","date":"2010-05-19","review_id":"IqCYIVemaP1YzovvjqXPhg","stars":2,"text":"I want to love Bull and Bones and I'm thrilled to have a brewery in Blacksburg but B&B doesn't quite hit the mark.\n\nThe beers and food are both good, but not great.  The BBQ is disappointingly dry and smoked wings sound like a good idea, but aren't; the skin ends up flabby and gross instead of crispy and delicious.","type":"review","user_id":"Ink9lkuugIvoE3LDEUZt5g","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"Y0WP6ZFx-CSYmsbKogLkhQ","date":"2011-07-01","review_id":"AP-ODg6b16aVLz4ngcXm6g","stars":3,"text":"In my opinion, this place used to be dirty and has really cleaned up.  The food is typical Arby's and pretty good.  The service has always been prompt and friendly.  My only real issue with the place is the actual layout of the building itself.  If you want to do drive-thru, you'll literally circle the building...twice!  When you pull in, you have to drive a complete circle to get to the spot where you can place an order.  Then, as you pull forward to pay and get your food, you're into your second circle and have to complete it if you want to get out of the parking lot.  Wild!","type":"review","user_id":"37x54E6hH0tfcWtbOdhiNA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"CQDgwHALlXTgvfOd0HoH8g","date":"2006-12-29","review_id":"VbYPdNDNym89TSib9nOh2w","stars":5,"text":"Great selection in movies! Cheap ticket prices! I like the Lyric alot.","type":"review","user_id":"5m-p2ddJBi4nIXWSglVGEQ","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2011-06-21","review_id":"PVhCkoGgDtIR_NhPo-b6mw","stars":4,"text":"Great fish tacos nomnomnom","type":"review","user_id":"TrVUihRXTCr3WpfIGFP4dQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2008-10-11","review_id":"fofDk5FxWWAfE14wKUrofw","stars":2,"text":"This place is decent if you're a college student looking for some average Mexican food and cheap drinks but it's far inferior to any good Mexican restaurant. I consider Mexican my specialty both food and drink wise and have dined at many across the country. Unfortunately the Mexican food around here is too \"Americanized\" and lacks any flavor or spice. I know it's not the restaurant's fault as they serve the bland food that the majority of the customers want  but as far as I'm concerned they could do a better job. The food isn't bad but the drinks are almost undrinkable. As with my food I prefer a little more flavor out of a margarita, not just a kool-aid wannabe. It would be OK if they had some good Anejo's to sip on but most of the tequila served would be better suited to start bon fires with. \n\nIf you're looking for Mexican food it's definitely better than the Taco Bell across the street (which isn't Mexican food) but at least one Mexican restaurant around here could step up the authenticity a little bit.","type":"review","user_id":"ZR6P3FXCz8719U2oul0zkA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"zTuPYiRzmeYZqjxTeAqhSA","date":"2010-02-11","review_id":"-8gQR38xZaAr9jMSSbM-6Q","stars":3,"text":"I thought the sandwiches here were kinda meh - but I was sober at the time I formulated this opinion.\n\nOne night I had a lot of drinks and my mind was much more clear. The speed at which they can serve drunk kids is amazing and a true life saver.","type":"review","user_id":"ZABoX8_9iMuLa3OAl2Pt8Q","votes":{"cool":1,"funny":1,"useful":1}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2009-07-17","review_id":"Cs4FBW88MsyO3opCcYVHNA","stars":3,"text":"I like this place, and for the Blacksburg area it's unique. Their fish tacos are okay and possibly the best I've had in Virginia. They don't really compare to something from So Cal though. I usually either play it safe with the fish tacos or gamble with the special.  Depending on the night, I've had some really good food off the specials menu, then I've had some I'd of rather sent back.  Overall it's hit or miss. Everything else off the regular menu is usually a disappointment.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"KsrMCDF689P4bTBrrbTLjA","date":"2010-09-03","review_id":"TXlm1z6dhLg2x9j5YFTh6w","stars":4,"text":"Very nice upscale decor inside this microbrewery near the campus of Virginia Tech.  They have a huge granite bar (with an unusual frozen metal strip to set your drinks on, very cool) and seating area as well as plenty of HDTV's for sports and also billiards tables in the back.  \n\nThe bartenders were very accommodating and friendly during my only visit here.  The menu manly consists of BBQ offerings from wings to sandwiches and ribs.  We tried an order of the wings (which are smoked, not fried) and they were delicious.  The micro brewed beers were pretty good and you can get a sampler for only $5.99.  None of the brews really jumped out at me as being great but they were all decent examples of the styles they were representing.\n\nI will definitely be back the next time I am in Blacksburg.","type":"review","user_id":"5bBuhr_Dzpo8c0Q-PLdyQQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rXGioez8wVRBwJXJoBj9LQ","date":"2011-07-05","review_id":"hbHs-Ie0szwX4CXBEml7ww","stars":3,"text":"This is one of those restaurants that everyone loves but you're not really sure why (see: Cabo Fish Taco) because it's just not very good, not even for Blacksburg. And then you eat there a couple of times and you realize you're starting to like it more and more each time, and you wonder if it's because it's really better than you first realized or if your standards are just getting that low.\n\nWell, if you want Japanese food, don't go here. For that matter, don't really go anywhere in Blacksburg (Blacksburg has some okay sushi, but anything else Japanese- and there's a lot more to Japanese cuisine than just sushi- be wary). But if you want something quick and meaty, with names that sound like Japanese food but have really nothing to do with the food in question, go here.\n\nEveryone raves about the Hokie sauce, which I think is something like a heavily watered down Thousand Island but I'm not entirely positive, but it's just a strange condiment to add to something that's supposed to be Japanese food. Unfortunately, the chicken (or beef) is always dried out to the point that you actually need to use the Hokie sauce just to get some kind of moisture in your food.\n\nWhat saves this place, however, is the Hokie fish. It's always cooked well and has a nice teriyaki-style glaze that just works, and you don't even need the Hokie sauce for it- it's good enough to eat on its own. Get it with broccoli and you have a pretty decent meal.\n\nI hate bashing locally owned, mom and pop places, but this place has plenty of fans, which never ceases to surprise me. I'll recommend it, but mostly for the fish, which says a lot considering we're nowhere near the ocean and I'm generally suspicious of seafood here as it is.","type":"review","user_id":"HpKwFDZw5BaWHat_4g-ufA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Cmim8IrcxWZdJ6SN6CDSAw","date":"2010-03-15","review_id":"PlQLFz7AzUVQHB26FREzSw","stars":2,"text":"not much to yelp about boston beanery ...\nthis place is overpriced and average or below average food.\nservice is alright too ...\n\nthe only time that's worth trying this place is if you had a coupon.","type":"review","user_id":"Yy5K-pdVXQUrdk-PrHGzLA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"wk8EiiHeB3TFx0YCOOityA","date":"2010-05-19","review_id":"2RjV35LWs69Dyo8KkB9Z9A","stars":4,"text":"Excellent food, reasonable prices.\n\nI've been a fan of Zeppoli's for over a decade.  The fresh pasta is wonderful, and you can buy it frozen to take home.  The wine shop is excellent and be sure to try the bi-monthly wine tastings.  At $15 a person it's an inexpensive night out and a lot more fun than just going out to dinner.","type":"review","user_id":"Ink9lkuugIvoE3LDEUZt5g","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"3ulgAMrHx6FFvDUMrLInDw","date":"2010-01-29","review_id":"K54M3ntSXTfTXZq6pD8Rig","stars":4,"text":"If you didn't know, the guy that owns Chinese Kitchen opened up Hokkaido. Bottom line, just go to CK. It's cheaper and you'll still be FULL. CK's food is also better. Butttt Hokkaido is pretty good and I go often, but only for lunch. I don't think allll the dishes are good, but the ones I love (lo mein, pepper chicken, general tso) are acceptable. I also love the sushi bar, although sometimes there is NOTHING out there except for some random rolls. I think for dinner, they'll put out more, but for lunch, they keep the sushi buffet menu at a minimum. :( \n\nThe desserts also suck, but HEY it's 7bucks and is all you can eat sushi + mongolian bbq. it's worth going to! Check it out.","type":"review","user_id":"Ea-4Db0QkOA9Vp3CyMQcBw","votes":{"cool":1,"funny":1,"useful":2}},
{"business_id":"vpxUqSMqPJyhTisCDSG1_Q","date":"2011-06-07","review_id":"9yXsDpr_HzQaaiU5maQJOQ","stars":3,"text":"Hummus is slightly bland but still good.  Steak Tzatziki wrap was good.\n\nIf I want souvlaki, pitas, or something from the \"cone of meat\" I'd go to Souvlaki's over this place.","type":"review","user_id":"k9BAzY1cqjYtMY9J4YdSMQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"76hIZMzHZ_lFM0p2N7_gRQ","date":"2010-06-05","review_id":"XDqz5CY4IzVg0DUNKLLv-g","stars":4,"text":"It is noisy and dark, but they have great food. Their eggplant parmesan is to die for. Their baklava is something special--one time they were out of it because the old lady who makes it was snowed in--wow!","type":"review","user_id":"Qnix8eS5meKg9dImfGcC8A","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2009-10-25","review_id":"3tQrG5qx2tV2D3ePYyLv0w","stars":3,"text":"The food is decent, but there's nothing exceptional or interesting about it.  It's a shame that the menu isn't a little more interesting.  When I go, I get the bbq mahi tacos or the epic tuna burrito, which are two of the better items on the menu.  \n\nThey do have good margaritas, and a huge tequila list.  They also have a pretty nice patio outside, so it's a great place to go in the summer with friends for margaritas.","type":"review","user_id":"TyYKyx5_AJyjyaxQyAVRJQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"f2ggWe2Lw3cGeA5T7mk_ZA","date":"2010-10-01","review_id":"tXnHU8oUI1fkYZUDgjFtQQ","stars":1,"text":"We were excited about a fresh - mex option in Blacksburg. This place was a disappointment. From the hostess not giving us enough menus - or saying she would bring crayons for the kids menu and then never returning. \n\nThe kids meals are 5.99 and include a drink. My daughter ordered mac and cheese - which was a small bowl of the store bought box stuff you buy for less than a buck a box. She left hungry. What a rip.\n\nAs for the menu - it is overpriced for sure. I got 3 tacos for $10 and they just had the meat and the tortilla with 3 little plastic cups - two with salsa and one with cheese. No cilantro or lettuce or anything like that. Boring and paltry looking plate of food. If the tortillas are made there they must be stored for a while because they didn't taste fresh. The ole' ones i get from the store taste fresher.\n\nYou can't get a meal for less than $10 - most meals are in the $12 range. Page one of the menu has 8 specialties and page two is quesadillas or tacos. \n\nI will say the waiter really tried. The guy who served my food looked at me like I was an idiot for asking for silverware though - they only gave us 3 sets for 4 people.\n\nGo to El Mariachi or Alejandros - a MUCH better deal and the food is fresh and good.","type":"review","user_id":"H_CE013G8vhO5tvQNSBLdw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2008-05-29","review_id":"-ja8_4zXz2hM_MrMzpDaBA","stars":4,"text":"I miss this place.  It was one of my favorites in the burg when I lived there.  I was excited to find out the abandoned looking building across the street from the off campus Tech Bookstore was going to be a fish taco place.  The tacos are really good, the chips and corn salsa was delish, the salads were a little salty and the fake sushi-esque rolls were so-so.  I have tried the wraps and burritos as well, but can't remember if I was wooed by them or not.  Oh and I enjoyed the cheap margs.\n\nOn a different note: There is a tequila club here, where you get a card with your name on it.  And everytime you take a shot of a specific tequila, you can check it off the list of 50+ tequilas.  I definitely did not join the club, however my friend did.  He vowed to complete the card in one summer.  It was a very drunken summer for him and me who tagged along for support.  I asked if he won a tshirt or anything... he said no.. just the satisfaction of checking off every tequila on the card! hahahaha  Aww I miss the drunken days/nights of blacksburg!","type":"review","user_id":"5m-p2ddJBi4nIXWSglVGEQ","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"nCWZR9NRc2grAwP1jq33PA","date":"2008-05-23","review_id":"hmx8A7MwsJ8KntJifpuE6w","stars":5,"text":"The management of The Rivermill describes this establishment as a \"third place\", like Starbucks once was. They try to create a place where anyone and everyone can go to enjoy a great selection of beer. And I think they succeed. No matter who you are, you're welcome at the Rivermill.\n\nGreat nightly specials including Pint Night, Bomb Night, and awesome chips and salsa on Friday. Fantastic food - you must try the buffalo cheeseburger. It's a local recipe that you have to taste.\n\nRivermill is my favorite bar in town. I will miss this place when I leave town. If you're ever in Blacksburg, stop by for a pint - you won't regret it.","type":"review","user_id":"hB3seohVMhFNX7fsBKHqxQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"PDX3igOBbL_HhUD0ZM-e3Q","date":"2010-08-28","review_id":"nALFXyYPmxdrPjS094O6kg","stars":4,"text":"Ahh, I knew I was going to be comfortable the second I walked in. After a long drive, walking into the lobby at the Hilton Garden Inn felt like what I imagine the lobby to heaven to feel like. A table with a welcoming bouquet of flowers, open space, comfortable lighting, couches, a fire place... and a TV to my left, and a bar to my right. Happiness! The best part about check-in (yeah, who even says they've had a \"best part\" to checking in??): The tray of cookies! It was a long drive and it's the little things that make me happy.\n\nIf I wasn't only staying for a night I would've taken advantage of their pool and fitness center. What else did this hotel come with? Soft and comfy beds, a refrigerator and coffee pot in our room, a hair dryer (I am female and  do appreciate such things), friendly people, and pretty good food for breakfast - eggs made to order, French toast, fresh fruit, oatmeal with toppings AND the waffle station. Fine, it wasn't free (nothing good is) but it was inexpensive and made up for the fact that I woke up periodically the night before because of the loud A/C. \n\nHGI did well, I'd come back again for a night.","type":"review","user_id":"OLNFCq3cHBB4lsmSXLI5cg","votes":{"cool":1,"funny":0,"useful":2}},
{"business_id":"wk8EiiHeB3TFx0YCOOityA","date":"2011-01-26","review_id":"-chmEGk-tLVXTq8sUoep1A","stars":2,"text":"I've been to Zeppoli's several times since living in Blacksburg. Pretty much every time I go I'm so disappointed and wonder why I let myself be dragged there.\n\nI'll give an easy breakdown of why.\n\nFood: Not impressed by the food at all. Each time the food is so mediocre I end up wondering why I'm paying so much for something I could do myself at home, and better; that's not what you want to think when you go out to have a good time and avoid having to do things at home yourself. The last time I went the pasta was undercooked and the sausage was presented as two long slabs tossed over the pasta. Not very exciting.\n\nService and staff: The servers are usually allright, albeit a bit sarcastic at times which is expected from a place that has college students as servers. Whenever I've gone and stayed a bit after people have left, they begin to turn the lights on and off to boot you out of there. The last time I went, the owner basically told us she wanted the last bottle of cabernet sauvignon and that we should have the merlot instead. What the heck kind of restaurant owner wants to hog the last bottle of cabernet to herself when the customers want some more?\n\nThey do pack the food for you in a box if you want it to go and the house wines are pretty cheap and decent.\n\nAll in all this place is OK. Don't expect to be wooed.","type":"review","user_id":"-k2jA8vZus1itFdn4bh5Vw","votes":{"cool":0,"funny":2,"useful":1}},
{"business_id":"YKWQbP6B13LT60j9tEEtIg","date":"2011-09-05","review_id":"-WSs8LlV5wSLZJHYcd45OA","stars":4,"text":"Food was good.  Prices were reasonable compared to many other places around.  Service was great.  Very accommodating for family with 2 young kids.  Table and restrooms were clean.  Would return but due to size can see that place could get very crowded during peak hours.","type":"review","user_id":"1XTW4TgxfCeTZRo0wCKD_g","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"YKWQbP6B13LT60j9tEEtIg","date":"2010-10-03","review_id":"fcWNT4eXjp30PSk3KA4JMw","stars":4,"text":"Had a chance to try Green's the other day for lunch.  I'm not a fan of sushi, I've just never gotten the bug, but they've got a great grill menu for the pickiest of eaters.  Highly recommend for lunch or a quick dinner - it's a small little shop on College Avenue that's easy to fit into a busy schedule.","type":"review","user_id":"d0M3Bx5CfuCBMx4a6yFb2w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"hlIwpc2gvIljc0YaqBJDNg","date":"2010-08-04","review_id":"IbaN0zyhPj1Sh0HyRxXR1g","stars":5,"text":"I have been going to Tivon for years and have only been disappointed once, but that was because my regular hair stylist was not there. Teal knows exactly what to do with my hair, whereas most hairstylists don't.\n\nBefore leaving my appointment one day, I decided to get a manicure. The nail tech was super nice and my nails looked gorgeous after I left.\n\nI would recommend this place to anyone and everyone I know in the area. I'm going to miss Teal and this place when I move. Everyone who works there is a total sweetheart.","type":"review","user_id":"-bbtJTohokk9lP2ERBEOlg","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"aURgpKldq6YKqAleHaFUtA","date":"2010-01-21","review_id":"moo-BwcZwzPpZ_SRziL8ZQ","stars":4,"text":"Really enjoyed the Silver Surfer Margarita, a combo plate of BBQ Fish Taco and the Cabo Fish Taco, but the Cabo got my attention.  Crisp fish and crunchy cabbage with a great sauce.  They also have a Jalapeno Mashed Potato as an excellent side.","type":"review","user_id":"14exv848JLJlW-a_LOYKXw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"KsrMCDF689P4bTBrrbTLjA","date":"2010-05-20","review_id":"BJRiF-rmSwVY0Yg2Fc_PLA","stars":4,"text":"I have never been disappointed here. The ribs are perhaps my favorite but by no means is the only good thing on their menu (smoked wings and brewhaus chicken, to name two). I also recommend  their beer sampler for your first time their (or if you are like me and can't decide).\n\nEven though the place is huge, so can be the lines.  Also, service is hit or miss depending on the day/waitress.  So if you are looking for an in and out meal, you are looking in the wrong place. But if you've got the time of day and  are looking for some good ribs and beer, this is the place to be in Blacksburg.","type":"review","user_id":"_x7GY1uFoNePmirs3scEqg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"rO-I1eS_92gzFkclW2ZvNg","date":"2010-06-01","review_id":"fOIIeAYmRO5ErSrL_TnkLw","stars":2,"text":"I am completely over Bollo's.  There is always a SLOW SLOW line with bad service- as though customers are really putting out the person working behind the counter.  My last three attempts here have failed because I just don't have the time to stand in line for an insanely small cup of coffee...although their baked good really are delish.  Too bad their fake hippie attitudes make the place annoying.","type":"review","user_id":"al3Ii-nMy0KuuK42wdHfyg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"7GSobyijoZeDKWGLUOsXgA","date":"2011-07-08","review_id":"-l_xPH0QcRccPCXLWrg5aw","stars":5,"text":"Kibbles is absolutely THE BEST pet store!  The owner is very knowledgeable and helpful and if he doesn't have something you want, he will get it.  Kibbles carries real pet food and they definitely care about the quality and reputation of the brands they stock on their shelves.","type":"review","user_id":"wK__Ts4m6izuPgRh7I-2VA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"thlQuACT7g1GQLA-45pfkw","date":"2010-07-03","review_id":"I9lTD2Lo-TgheLsFla3ebQ","stars":4,"text":"My family calls this \"The Hole in the Wall Chinese\" because its just tucked into the stripmall in a little space without much seating... but its wonderful!  The dumplings are my favorite, they're delicious either steamed or fried.  My mother always gets the cashew chicken and its very good, too.  The guy at the register is very nice, and he remembers our usual orders whenever we come in!  This would be five star if it were cleaner and wasn't so cramped. As is, its delicious and inexpensive so I'll keep going back!","type":"review","user_id":"miq5sVQ9XjopPdeuBXhUiw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nCWZR9NRc2grAwP1jq33PA","date":"2011-09-16","review_id":"NBJuKCn4rDhgJjpTBlmJPw","stars":4,"text":"A fun, hipster, beer bar. Great food and a fantastic drink selection.","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Vd9gGFmHfsfQE9Ytxnr85Q","date":"2011-09-02","review_id":"T242X2rjNFb36iJ_PFuuWA","stars":3,"text":"Oh walmart. \n\nI have a love/hate relationship with you. You're the biggest grocery store in line with 'low' prices but you always make me feel dirty when I shop here and the crowds are endless. \n\nGo if you're going to stock up for something; otherwise, just go to another store and avoid the madness.","type":"review","user_id":"jp4X9H56zjjLacnpHz02Iw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"xRrnli_Yg_Dvu2hBHRfPTA","date":"2011-02-07","review_id":"bEr20mOc25EhZUTkyGqTHw","stars":3,"text":"Easy Chair is a mixed bag. (I wish I could give it a 3.5)\n\nPros: \n- Location is great. \n- Coffee is very good.\n- They often have a super cheap two iced lattes for two bucks in the summer. Perfect for after the gym.\n- They have the only used book store in town which is great for browsing with your drink. \n- The bagel sandwiches are delicious.\n- Outdoor seating for when it is warm.\n- The employees are generally very nice.\n\nCons:\n- Parking can be a total mess when school is in session.\n- Lack of outlets for plugging in computers. It is rumored, from a somewhat reliable source, that this is intentional since they want to discourage students from working there all day. Makes sense. Seating is limited.\n- I once asked about fair trade selections and was informed that they don't do \"cause coffee.\" That left me with a burning desire to stuff the Jamaican Blue Mountain beans this guy was holding up his nose. It wouldn't be unfair to accuse me of being a coffee snob, but the pretentiousness oozing from that statement left me with a cold spot in my heart for this place. But since the judgment usually goes the other way (as in, \"you don't drink fair trade? *gasp*\") it wasn't enough to truly turn me off what is a mostly charming local coffee shop.","type":"review","user_id":"Of1gS4IfNhszA8tn6KNLXQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2008-09-25","review_id":"K7RvCQzo_fFwq37RFZfIAw","stars":5,"text":"I love this place!  I lived in the Bburg area for about 12 years and just recently moved to the Phoenix metro.  Mexican food is my favorite!  And I have yet to find a Mexican joint out here that beats El Rodeo.  Both in quality of food, drinks, and service.  \n\nIf you go to El Rodeo you know you will get fast service, good food, strong drinks, and fresh salsa.  Yes the margaritas are from a machine but they usually put a few shots of tequila on top, so they are fairly strong.  This is definitely the best Mexican food in the area.  (and apparently in the Tempe area too!)","type":"review","user_id":"BqUm1rHPSxlCWr-3HhNQyw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"__EmsZiRXiUmljbfpOqZig","date":"2011-09-12","review_id":"hjQxFDBjARIMDyuUjYycrw","stars":3,"text":"Fair food at okay prices. Service is alright. Drink specials are always worth it. A great place to hang out, have a drink and listen to the live music or comedians, not much of a family dinner place.","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"nCWZR9NRc2grAwP1jq33PA","date":"2008-08-04","review_id":"vJ4OnKDQkqLAzHFiNVmjDw","stars":3,"text":"Standard food, no NTN trivia, decent beer specials on certain nights, but nothing about this place makes it stand out except one thing, if you don't want youngsters around, this place won't let them in at night. The beer selection is pretty good.","type":"review","user_id":"C21M4hzJliK1M-XxGquBgg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"HAXTUHm3RFucIbNZSpIU3A","date":"2011-05-21","review_id":"0bJlMmrYyEDSOBlzhQZURQ","stars":4,"text":"This place is outstanding, and is most likely the best place to eat in Blacksburg.\n\nAnyways, so I was attending a business conference at VT for the week (with my attractive, flirty female coworker of course - I try to take her everywhere). \n\nThe first thing I notice is the mix-and-match 4 course meal for $30! You get to pick swordfish, snapper, pork loin, ribeye, or whatever the menu has that day, and match it with any soup you want, some scallops or a salad, and have your choice of desert. You get a LOT of great food (the taste and aesthetics are both excellent) for what I consider to be a reasonable price for a 4-course meal. There's also your typical burgers and whatnot served here as well, which were also good.  From the dining area you can also see into the beautiful mountain scenery and watch the sunset.\n\nMy coworker and I shared a bottle of Gehrwurtstresomething Riesling (the wine and beer menu is massive, with many local flavors), which got us pretty buzzed, and all the better because our company is paying for the entire trip!\n\nHowever, the best part was our waitress, Harmony. She was just \"WOW.\"  Some servers just give your service, but Harmony was outstanding. This girl must really enjoy her job because I have never seen a waitress so friendly, funny and personable.  We actually came back a second night that week, and she sat down at our table with us and talked about what bars she goes to and how much she likes dubstep and how her Robert Miles CDs were stolen (I love Robert Miles btw). Hell, she flirted with me more than my flirty coworker did. I was about half a glass shy from asking her if she wanted to come back to my hotel room when her shift was over.\n\nBottom line: come here, eat, be merry, and chat with Harmony. Oh, and the restaurant is actually a haunted house (some lady pushed her sister down the stairs and killed her) which was converted into the restaurant. Awesome.","type":"review","user_id":"aDGpWRUP3vdVXG5aOME3BQ","votes":{"cool":2,"funny":2,"useful":2}},
{"business_id":"vpxUqSMqPJyhTisCDSG1_Q","date":"2010-12-21","review_id":"dyxv21hwmgaoXoeBMMiuRw","stars":1,"text":"Went to pita vera to order an xl pizza.  The service was friendly but a little slow even though the restaurant was practically empty.  The problem arose when our pizza took over 45 minutes to arrive at our table, and upon delivery, the server (not the same server that had been waiting upon us) dropped the food off without a word, and returned to his station.  Once we picked up our pizza, the crust was very dark and tasted burnt, but was still soggy and floppy, and the cheese was not fully cooked.  I'm not sure what they did to this pie, but I'm never going back.  Neither server checked on us after this, so we did not have the opportunity to ask about a replacement pie.  We just paid the bill and left.","type":"review","user_id":"Ae3tQ0MJjf3Oo3cficHh4g","votes":{"cool":0,"funny":0,"useful":1}},
