{"business_id":"7ROpZOsaDK1V7Zl_2RaPTA","date":"2010-05-01","review_id":"d-_F5bhWnxCl4fWRemnstQ","stars":3,"text":"Attitudes is a small hotel bar with a small performance area and dance floor. I've seen a couple of shows here and have had a pretty good time at both. \n\nThe performance stage is small and low in front of a small dance floor and raised area surrounding it. It's a bit awkward to navigate - you can't get straight to the bathroom from the dance floor. The floor can get pretty crowded, and it can get fratty. There's a perfect space for those taping the shows, and the staff is friendly and accommodating - in general and to tapers. Beer is not too expensive. The food is a little more expensive, and passable but not fantastic. \n\nBoth times I've been here, though, there's been some kind of preppy event at the conference room next door. It hasn't been a problem, I just thought I should note it.\n\nI saw Donna Jean and the Tricksters here last summer and Railroad Earth here last night. Donna Jean was pretty good, though she played to a mostly empty house. Railroad Earth was fantastic, though. A small, intimate environment like this is the best place to see them.\n\nOverall, a slightly inconvenient location but not a bad place.","type":"review","user_id":"KbnM8LCVWAo_ldunfFnHnw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"tJwomYMNjpd4A31rDMXMCw","date":"2007-10-15","review_id":"nqyCrAbzYvKoGxu1ER7A8g","stars":4,"text":"This seems to be the go-to bar here in Blacksburg. You can pretty much always expect it to be crowded. Their happy hour specials are ridiculous and their drinks are always pretty stiff. If you are looking for the epitome of college bar, this place is for you. Minus one shining star because the last time I went here, last call was at 1:15am and that was incredibly LAME.","type":"review","user_id":"dvAXqNtZHuxLgTIyTC4omQ","votes":{"cool":1,"funny":1,"useful":1}},
{"business_id":"K4Sq3cz0-73HWS14K6I6Ng","date":"2010-01-03","review_id":"69Eff1vjMkUYhbIvQy-qYA","stars":2,"text":"margarita tasted like it was made with crystal light mix and the cheapest tequila money can buy.  it covers up the taste of the food though...which is pretty tasteless.  service is good though!","type":"review","user_id":"Pw3BjgqG0mxC76jc_LsscQ","votes":{"cool":0,"funny":0,"useful":1}},
{"business_id":"-QNnL7C_z7NxiCarq3VZTQ","date":"2008-11-24","review_id":"GmCG-YqqVivAmJjmlLrxbA","stars":4,"text":"\"I love Lamb\" \n\nThis place is tasty, I grew up in southeast VA so I had never had a Gyro prior to my college days. I was taken to this place by a frat bro and I thank him to this day for it. This place is awesome and the price is just right. \n\nGood food, good friends, great times (Save by the bell high five)","type":"review","user_id":"QSE-VB9cWndmTLo2u9UUMg","votes":{"cool":1,"funny":1,"useful":2}},
{"business_id":"hWoT61c8id5vIsxlP618nQ","date":"2009-11-30","review_id":"mmpnwlLMzv-NsPuPyAL_bA","stars":1,"text":"Same as sharkeys. Pretention and inane talk","type":"review","user_id":"_v9J4gRv_0q_ocYtZKm22w","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"thlQuACT7g1GQLA-45pfkw","date":"2008-08-21","review_id":"v3ngT-Ki0CZLxxSAPIqEWw","stars":1,"text":"Cheap large portions prepared quickly. I wish that there was even the slightest bit of quality, the hot and sour soup lacked the requsite flavors, all the other dishes from the Lo-Mein to the General Tso's and Szcehuan Chicken seem to have been a product of a lazy kitchen that just throws ingredients in a wok and tops it with a pre-made sauce. \n\nEating here is also not a good idea, while I was here... The owner of the restaurant launched into a diatribe in Mandarin; screaming at the top of her lungs on the phone and to one of her cooks. It was absolutely nuts...","type":"review","user_id":"SHSCOFmA-o1KjwPIxWEqJA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"5ydvKUok_yX7dBHbpluuRg","date":"2011-07-11","review_id":"1NT-VtRTYpbBt3WRlCXkWw","stars":3,"text":"Good selection of shesha for a rural virginia college town.","type":"review","user_id":"_kMpx-ZA-tPJE5RJD_1gNg","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"__EmsZiRXiUmljbfpOqZig","date":"2009-09-05","review_id":"ZwnnKRDh2aq-WTYNu9R3FQ","stars":1,"text":"The name doesn't lie. I've only been to this location, and everytime I've eaten there I always wished I hadn't. It usually comes back to haunt me, if you know what I mean. I've got doubts about how fresh the seafood is. It's not hard to make a salad, but they managed to not even be able to accomplish that. The crab balls, all filler and for the price that isn't acceptable. The fruity cocktails almost always have flies in them. I won't complain about the service because it's just as bad as everywhere else in Blacksburg. I will never eat there again.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":1,"useful":1}},
{"business_id":"vpxUqSMqPJyhTisCDSG1_Q","date":"2011-04-18","review_id":"KDdhhQRf3pYNRvQRtYLZxA","stars":3,"text":"If you're into organic or mediterranean food, then this is a great place to go. However, besides that, there's not much else in terms of \"food genre\" to offer here. The calzone I had was OK; certainly different from others I've had, but it wasn't outstanding. It's a little expensive though.","type":"review","user_id":"VH5pKCf64byq4k4RgV-buw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Rhzx-LNOm4EU5Gi2IO0J1g","date":"2009-03-09","review_id":"GQ_I8iA7ggfVKqFS96SEFw","stars":4,"text":"Visiting Blacksburg to watch Hokie's play against Tarheels and needed a place to eat before the men's basketball game.  So where do you go when Subway's and Hardee's crack the top 20 in restaurants in the area!?  You go 'local' and where the drinks are inexpensive!  After hearing about The Gobbler on yelp and checking out the menu I thought as a vegetarian worse case scenario would be having the baked ravioli. \n\nThe place was not that busy when we arrived a little less than 2 hours before tipoff, but started picking up while we were dining.  Everyone coming in were college students enjoying some pool, beer and maybe a smoke (which coming from a non-smoking town forgot you were still able to do that).  The waitstaff was very nice.  The lady that sat us and started our order recommended I try the calzone which I am glad I did!  Not only was it delicious but also enough for three meals!  My friend also enjoyed her sub and chips.  \n\nAfter the shift change we were also helped by a nice gentleman and a lady named Laura.  Now I have to give an extra shout-out to Laura for not only being an awesome server but also HAND DRAWING directions to Cassell Coliseum.  Sure I felt like a fool when I realized just how close we were BUT I wouldn't have made the correct turns to get there in a timely manner- AND she even gave us two options to get there! :)\n\nIf I make it back to Blacksburg I will plan on dropping in to The Gobbler knowing I'll be supporting a local hangout, eating a delicious calzone, treated to excellent service and maybe just another drawing from Laura!","type":"review","user_id":"82fiiwqa-GB069DRpEsFig","votes":{"cool":1,"funny":0,"useful":1}},
{"business_id":"92PznvJFnyw54j5LeQqNWA","date":"2008-04-03","review_id":"wzQ2dhsRbx_dAXcO4NNRrA","stars":4,"text":"Doesn't have to be fancy to be good. \n\nYou order at the bar, your food comes in a plastic basket and on paper, but it is oh-so-good, cheap, and well-portioned.\n\nI love the chicken tacos. You'd be suprised at how many places can mess up chicken tacos. The chili dog is good too. The people are chill and real, the music is underground rap or indie rock or classics, the beers available rock my face off.","type":"review","user_id":"qfsK7_jZ68XAg9Jpt5KQ8w","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"z2o5kP4SZVbsO5UCH1rP0g","date":"2010-01-06","review_id":"jXLglE1wPbheHLX9sxbCjg","stars":1,"text":"If you enjoy eating colored cardboard you might enjoy this place. None of the pizza had any flavor, to the point where the hawaiian tasted just like the buffalo chicken. I'm still trying to figure out how that is even possible. Needless to say I won't be returning.","type":"review","user_id":"JQKKh5ItoBZPwZZew75-CA","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"voXoIsapBR30q_7PgxVeAA","date":"2010-04-04","review_id":"THPpVBXVwRbKZ9bEHJaC7Q","stars":3,"text":"The best thing about this place in my opinion is the pizza and calzones.  The rest is pretty average Italian fare.  They have some things that are on the pricey side but the calzones and pizza are at a fair price.  The service can be a bit slow but overall it's not bad. Their lunch buffet is good if you don't mind not having too much variety.  They usually put out a few pizzas with a few options for dessert.  The quality is great but the variety not so much.  I'd go here again but only for their pizza or calzones.","type":"review","user_id":"nWT3tYZYFoKPUXSHYYhuLQ","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"Te72-fjbquQFCfPBgJ4ldQ","date":"2011-07-31","review_id":"D-vtftHkvo7VXp8vWRzV2w","stars":2,"text":"Boudreaux's is good when it's good and awful when it's not.  The service is pretty much always lacking, sometimes ridiculously so.  The drop biscuits and sausage gravy is good, but kind of expensive especially for a college town.  The brunch is a la carte for the most part, which can get annoying, but the drinks tend to be good.  Had a bad experience with the oyster po'boy, so I wouldn't recommend getting that.  The seafood gumbo is generally good.  Honestly not going to miss it like some of the other places on main street after I move away from Blacksburg.","type":"review","user_id":"wYkjRrJ1lgRTtezXIUN2bw","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"4kR9-F-iooU_l_n2mgSGDw","date":"2011-08-20","review_id":"g2n4PWUmXS7YVKy9kyN_ZA","stars":5,"text":"this is where my dad buys all his wine. \ngreat selection of beer & wine for blacksburg.\n\nfun tastings as well!!!","type":"review","user_id":"r0jUD2_g-p57HjCA0hpA1g","votes":{"cool":0,"funny":0,"useful":0}},
{"business_id":"5zyibT__dkE21sAyLb1qvA","date":"2011-05-28","review_id":"kidT3j1IziBdZorg3LJBWg","stars":4,"text":"Man, this place is good!! Literally just got done eating the Spinach and bacon burger, which had a very mild herbed goat-cheese and some caramelized onions on it. It's also served on some crusty, toasted sourdough bread. That was a seriously good burger!! The boyfriend had what I guess was their special burger of the day, which was the Chipotle BBQ Pork burger, and although I'm not a fan of blue-cheese I took a bite anyway and it was super-delicious!!! \n\nWe also decided to be fat kids and got dessert. I got their Cranberry-Walnut chocolate chip pie and OH MY GOD!!!! You realllllly need to try that. Randy got the Bourbon Pecan Pie, which was good..... buuuuuut.... mine was better. They make their own desserts and I really hope they make their pie crusts too because it was amazingly buttery, flaky and delicious. If they don't make their crusts I don't want to know. Just let me keep thinking they do.\n\nWhile we were ordering our food (to go) we looked over their extensive beer and wine lists (but mostly the beer) and they have a great selection! Lagunita's, Bell's, and other craft beers! \n\nThe service was good, too, I have to add! (Mostly because I'm a server)\n\nThe only reason I didn't give it 5 stars is because all the toppings of the burger were on the bottom and I felt that it made the foundation (bun/bread, etc) kind of soggy. But definitely give this place a go!!! I highly recommend it!!","type":"review","user_id":"0nvDxcmlbaNTBV4XC6QCzg","votes":{"cool":1,"funny":0,"useful":0}},
{"business_id":"j3lZQs0YKMDAwKSbDRNY7Q","date":"2011-02-28","review_id":"BvE9xACwGUntbP-SxME71Q","stars":5,"text":"My favorite lunch place.  A little expensive if you get a drink, too, but the discount punch card helps a bit if you go a lot like I do.  Tons of drink variety, though I've only tried the matcha, original, and taro bubble milk teas, which are all good. I love their crepes--they are a perfect size for lunch, and are a well-balanced meal (I usually add extra lettuce or corn for added nutrition.). Nice magazine selection for reading, and free Wifi. Decor is fun and modern--bright orange and white with natural wood.  The only downside is no exterior windows due to mall location.","type":"review","user_id":"NSHURcUpyOqKC4X8CIlxNQ","votes":{"cool":0,"funny":0,"useful":0}},
